nrfconnect/sdk-hal_nordic/nrfx/mdk/nrf54l20_enga_types.h
/* CRACENCORE_CRYPTMSTRHW_BA418SHA3HWCFG: Generic g_Sha3CtxtEn value. */
  #define CRACENCORE_CRYPTMSTRHW_BA418SHA3HWCFG_ResetValue (0x00000001UL) /*!< Reset value of BA418SHA3HWCFG register.         */

/* BA418SHA3HWCFG @Bit 0 : Generic g_Sha3CtxtEn value. */
  #define CRACENCORE_CRYPTMSTRHW_BA418SHA3HWCFG_BA418SHA3HWCFG_Pos (0UL) /*!< Position of BA418SHA3HWCFG field.                */
  #define CRACENCORE_CRYPTMSTRHW_BA418SHA3HWCFG_BA418SHA3HWCFG_Msk (0x1UL << CRACENCORE_CRYPTMSTRHW_BA418SHA3HWCFG_BA418SHA3HWCFG_Pos)
                                                                            /*!< Bit mask of BA418SHA3HWCFG field.*/


/* CRACENCORE_CRYPTMSTRHW_BA419SM4HWCFG: Generic g_SM4ModesPoss value. */
  #define CRACENCORE_CRYPTMSTRHW_BA419SM4HWCFG_ResetValue (0x000201FFUL) /*!< Reset value of BA419SM4HWCFG register.           */

/* BA419SM4HWCFG @Bits 0..9 : Generic g_SM4ModesPoss value. */
  #define CRACENCORE_CRYPTMSTRHW_BA419SM4HWCFG_BA419SM4HWCFG_Pos (0UL) /*!< Position of BA419SM4HWCFG field.                   */
  #define CRACENCORE_CRYPTMSTRHW_BA419SM4HWCFG_BA419SM4HWCFG_Msk (0x3FFUL << CRACENCORE_CRYPTMSTRHW_BA419SM4HWCFG_BA419SM4HWCFG_Pos)
                                                                            /*!< Bit mask of BA419SM4HWCFG field.*/

/* USEMASKING @Bit 17 : Generic g_sm4UseMasking value. */
  #define CRACENCORE_CRYPTMSTRHW_BA419SM4HWCFG_USEMASKING_Pos (17UL) /*!< Position of USEMASKING field.                        */
  #define CRACENCORE_CRYPTMSTRHW_BA419SM4HWCFG_USEMASKING_Msk (0x1UL << CRACENCORE_CRYPTMSTRHW_BA419SM4HWCFG_USEMASKING_Pos)
                                                                            /*!< Bit mask of USEMASKING field.*/


/* CRACENCORE_CRYPTMSTRHW_BA424ARIAHWCFG: Generic g_aria_modePoss value. */
  #define CRACENCORE_CRYPTMSTRHW_BA424ARIAHWCFG_ResetValue (0x0000017FUL) /*!< Reset value of BA424ARIAHWCFG register.         */

/* BA424ARIAHWCFG @Bits 0..8 : Generic g_aria_modePoss value. */
  #define CRACENCORE_CRYPTMSTRHW_BA424ARIAHWCFG_BA424ARIAHWCFG_Pos (0UL) /*!< Position of BA424ARIAHWCFG field.                */
  #define CRACENCORE_CRYPTMSTRHW_BA424ARIAHWCFG_BA424ARIAHWCFG_Msk (0x1FFUL << CRACENCORE_CRYPTMSTRHW_BA424ARIAHWCFG_BA424ARIAHWCFG_Pos)
                                                                            /*!< Bit mask of BA424ARIAHWCFG field.*/



/* ============================================== Struct CRACENCORE_RNGCONTROL =============================================== */
/**
  * @brief RNGCONTROL [CRACENCORE_RNGCONTROL] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CONTROL;                           /*!< (@ 0x00000000) Control register                                      */
  __IOM uint32_t  FIFOLEVEL;                         /*!< (@ 0x00000004) FIFO level register.                                  */
  __IOM uint32_t  FIFOTHRESHOLD;                     /*!< (@ 0x00000008) FIFO threshold register.                              */
  __IOM uint32_t  FIFODEPTH;                         /*!< (@ 0x0000000C) FIFO depth register.                                  */
  __IOM uint32_t  KEY[4];                            /*!< (@ 0x00000010) Key register.                                         */
  __IOM uint32_t  TESTDATA;                          /*!< (@ 0x00000020) Test data register.                                   */
  __IOM uint32_t  REPEATTHRESHOLD;                   /*!< (@ 0x00000024) Repetition Test Count Cut-Off value.                  */
  __IOM uint32_t  PROPTHRESHOLD;                     /*!< (@ 0x00000028) Adaptive Proportion Test (1024-sample window) Cut-Off
                                                                         value.*/
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  STATUS;                            /*!< (@ 0x00000030) Status register.                                      */
  __IOM uint32_t  INITWAITVAL;                       /*!< (@ 0x00000034) Initial wait counter value.                           */
  __IOM uint32_t  DISABLEOSC[2];                     /*!< (@ 0x00000038) Disable oscillator rings #n*32 to #((n+1)*32)-1.      */
  __IOM uint32_t  SWOFFTMRVAL;                       /*!< (@ 0x00000040) Switch off timer value.                               */
  __IOM uint32_t  CLKDIV;                            /*!< (@ 0x00000044) Sample clock divider.                                 */
  __IOM uint32_t  AIS31CONF0;                        /*!< (@ 0x00000048) AIS31 configuration register 0.                       */
  __IOM uint32_t  AIS31CONF1;                        /*!< (@ 0x0000004C) AIS31 configuration register 1.                       */
  __IOM uint32_t  AIS31CONF2;                        /*!< (@ 0x00000050) AIS31 configuration register 2.                       */
  __IOM uint32_t  AIS31STATUS;                       /*!< (@ 0x00000054) AIS31 status register.                                */
  __IOM uint32_t  HWCONFIG;                          /*!< (@ 0x00000058) Hardware configuration register.                      */
  __IM  uint32_t  RESERVED1[9];
  __IM  uint32_t  FIFO[16];                          /*!< (@ 0x00000080) FIFO data                                             */
} NRF_CRACENCORE_RNGCONTROL_Type;                    /*!< Size = 192 (0x0C0)                                                   */

/* CRACENCORE_RNGCONTROL_CONTROL: Control register */
  #define CRACENCORE_RNGCONTROL_CONTROL_ResetValue (0x00040000UL) /*!< Reset value of CONTROL register.                        */

/* ENABLE @Bit 0 : Enable the NDRNG. */
  #define CRACENCORE_RNGCONTROL_CONTROL_ENABLE_Pos (0UL) /*!< Position of ENABLE field.                                        */
  #define CRACENCORE_RNGCONTROL_CONTROL_ENABLE_Msk (0x1UL << CRACENCORE_RNGCONTROL_CONTROL_ENABLE_Pos) /*!< Bit mask of ENABLE
                                                                            field.*/

/* LFSREN @Bit 1 : Select between the NDRNG with asynchronous free running oscillators (when 0) and the Pseudo-Random generator
                   with synchronous oscillators for simulation purpose (when 1). */

