nrfconnect/sdk-hal_nordic/nrfx/mdk/nrf54l20_enga_types.h
/* OPPTRC @Bits 16..19 : When executing primitive arithmetic operations, this pointer defines the location (0x0 to 0xF) where
                         the result will be stored in memory. */

  #define CRACENCORE_PK_POINTERS_OPPTRC_Pos (16UL)   /*!< Position of OPPTRC field.                                            */
  #define CRACENCORE_PK_POINTERS_OPPTRC_Msk (0xFUL << CRACENCORE_PK_POINTERS_OPPTRC_Pos) /*!< Bit mask of OPPTRC field.        */

/* OPPTRN @Bits 24..27 : When executing primitive arithmetic operations, this pointer defines the location where the modulus is
                         located in memory (location 0x0 to 0xF). */

  #define CRACENCORE_PK_POINTERS_OPPTRN_Pos (24UL)   /*!< Position of OPPTRN field.                                            */
  #define CRACENCORE_PK_POINTERS_OPPTRN_Msk (0xFUL << CRACENCORE_PK_POINTERS_OPPTRN_Pos) /*!< Bit mask of OPPTRN field.        */


/* CRACENCORE_PK_COMMAND: Command register. */
  #define CRACENCORE_PK_COMMAND_ResetValue (0x0000000FUL) /*!< Reset value of COMMAND register.                                */

/* OPEADDR @Bits 0..6 : This field defines the operation to be performed. */
  #define CRACENCORE_PK_COMMAND_OPEADDR_Pos (0UL)    /*!< Position of OPEADDR field.                                           */
  #define CRACENCORE_PK_COMMAND_OPEADDR_Msk (0x7FUL << CRACENCORE_PK_COMMAND_OPEADDR_Pos) /*!< Bit mask of OPEADDR field.      */

/* FIELDF @Bit 7 : 0: Field is GF(p) 1: Field is GF(2**m) */
  #define CRACENCORE_PK_COMMAND_FIELDF_Pos (7UL)     /*!< Position of FIELDF field.                                            */
  #define CRACENCORE_PK_COMMAND_FIELDF_Msk (0x1UL << CRACENCORE_PK_COMMAND_FIELDF_Pos) /*!< Bit mask of FIELDF field.          */

/* OPBYTESM1 @Bits 8..17 : This field defines the size (= number of bytes minus one) of the operands for the current operation.
                           */

  #define CRACENCORE_PK_COMMAND_OPBYTESM1_Pos (8UL)  /*!< Position of OPBYTESM1 field.                                         */
  #define CRACENCORE_PK_COMMAND_OPBYTESM1_Msk (0x3FFUL << CRACENCORE_PK_COMMAND_OPBYTESM1_Pos) /*!< Bit mask of OPBYTESM1
                                                                            field.*/

/* RANDMOD @Bit 19 : Enable randomization of modulus (counter-measure). */
  #define CRACENCORE_PK_COMMAND_RANDMOD_Pos (19UL)   /*!< Position of RANDMOD field.                                           */
  #define CRACENCORE_PK_COMMAND_RANDMOD_Msk (0x1UL << CRACENCORE_PK_COMMAND_RANDMOD_Pos) /*!< Bit mask of RANDMOD field.       */

/* SELCURVE @Bits 20..22 : Enable accelerator for specific curve modulus: */
  #define CRACENCORE_PK_COMMAND_SELCURVE_Pos (20UL)  /*!< Position of SELCURVE field.                                          */
  #define CRACENCORE_PK_COMMAND_SELCURVE_Msk (0x7UL << CRACENCORE_PK_COMMAND_SELCURVE_Pos) /*!< Bit mask of SELCURVE field.    */
  #define CRACENCORE_PK_COMMAND_SELCURVE_Min (0x0UL) /*!< Min enumerator value of SELCURVE field.                              */
  #define CRACENCORE_PK_COMMAND_SELCURVE_Max (0x6UL) /*!< Max enumerator value of SELCURVE field.                              */
  #define CRACENCORE_PK_COMMAND_SELCURVE_NOACCEL (0x0UL) /*!< (unspecified)                                                    */
  #define CRACENCORE_PK_COMMAND_SELCURVE_P256 (0x1UL) /*!< (unspecified)                                                       */
  #define CRACENCORE_PK_COMMAND_SELCURVE_P384 (0x2UL) /*!< (unspecified)                                                       */
  #define CRACENCORE_PK_COMMAND_SELCURVE_P521 (0x3UL) /*!< (unspecified)                                                       */
  #define CRACENCORE_PK_COMMAND_SELCURVE_P192 (0x4UL) /*!< (unspecified)                                                       */
  #define CRACENCORE_PK_COMMAND_SELCURVE_CURVE25519 (0x5UL) /*!< (unspecified)                                                 */
  #define CRACENCORE_PK_COMMAND_SELCURVE_ED25519 (0x6UL) /*!< (unspecified)                                                    */

/* RANDKE @Bit 24 : Enable randomization of exponent/scalar (counter-measure). */
  #define CRACENCORE_PK_COMMAND_RANDKE_Pos (24UL)    /*!< Position of RANDKE field.                                            */
  #define CRACENCORE_PK_COMMAND_RANDKE_Msk (0x1UL << CRACENCORE_PK_COMMAND_RANDKE_Pos) /*!< Bit mask of RANDKE field.          */

/* RANDPROJ @Bit 25 : Enable randomization of projective coordinates (counter-measure). */
  #define CRACENCORE_PK_COMMAND_RANDPROJ_Pos (25UL)  /*!< Position of RANDPROJ field.                                          */
  #define CRACENCORE_PK_COMMAND_RANDPROJ_Msk (0x1UL << CRACENCORE_PK_COMMAND_RANDPROJ_Pos) /*!< Bit mask of RANDPROJ field.    */

/* EDWARDS @Bit 26 : Enable Edwards curve. */
  #define CRACENCORE_PK_COMMAND_EDWARDS_Pos (26UL)   /*!< Position of EDWARDS field.                                           */
  #define CRACENCORE_PK_COMMAND_EDWARDS_Msk (0x1UL << CRACENCORE_PK_COMMAND_EDWARDS_Pos) /*!< Bit mask of EDWARDS field.       */

/* SWAPBYTES @Bit 28 : Swap the bytes on AHB interface: */
  #define CRACENCORE_PK_COMMAND_SWAPBYTES_Pos (28UL) /*!< Position of SWAPBYTES field.                                         */
  #define CRACENCORE_PK_COMMAND_SWAPBYTES_Msk (0x1UL << CRACENCORE_PK_COMMAND_SWAPBYTES_Pos) /*!< Bit mask of SWAPBYTES field. */
  #define CRACENCORE_PK_COMMAND_SWAPBYTES_Min (0x0UL) /*!< Min enumerator value of SWAPBYTES field.                            */
  #define CRACENCORE_PK_COMMAND_SWAPBYTES_Max (0x1UL) /*!< Max enumerator value of SWAPBYTES field.                            */
  #define CRACENCORE_PK_COMMAND_SWAPBYTES_NATIVE (0x0UL) /*!< Native format (little endian).                                   */
  #define CRACENCORE_PK_COMMAND_SWAPBYTES_SWAPPED (0x1UL) /*!< Byte swapped (big endian).                                      */

/* FLAGA @Bit 29 : Flag A. */
  #define CRACENCORE_PK_COMMAND_FLAGA_Pos (29UL)     /*!< Position of FLAGA field.                                             */
  #define CRACENCORE_PK_COMMAND_FLAGA_Msk (0x1UL << CRACENCORE_PK_COMMAND_FLAGA_Pos) /*!< Bit mask of FLAGA field.             */

