nrfconnect/sdk-hal_nordic/nrfx/mdk/nrf54l20_enga_types.h
/* PIN18 @Bit 18 : Pin 18 */
  #define GPIO_OUTCLR_PIN18_Pos (18UL)               /*!< Position of PIN18 field.                                             */
  #define GPIO_OUTCLR_PIN18_Msk (0x1UL << GPIO_OUTCLR_PIN18_Pos) /*!< Bit mask of PIN18 field.                                 */
  #define GPIO_OUTCLR_PIN18_Min (0x0UL)              /*!< Min enumerator value of PIN18 field.                                 */
  #define GPIO_OUTCLR_PIN18_Max (0x1UL)              /*!< Max enumerator value of PIN18 field.                                 */
  #define GPIO_OUTCLR_PIN18_Low (0x0UL)              /*!< Read: pin driver is low                                              */
  #define GPIO_OUTCLR_PIN18_High (0x1UL)             /*!< Read: pin driver is high                                             */
  #define GPIO_OUTCLR_PIN18_Clear (0x1UL)            /*!< Write: writing a '1' sets the pin low; writing a '0' has no effect   */

/* PIN19 @Bit 19 : Pin 19 */
  #define GPIO_OUTCLR_PIN19_Pos (19UL)               /*!< Position of PIN19 field.                                             */
  #define GPIO_OUTCLR_PIN19_Msk (0x1UL << GPIO_OUTCLR_PIN19_Pos) /*!< Bit mask of PIN19 field.                                 */
  #define GPIO_OUTCLR_PIN19_Min (0x0UL)              /*!< Min enumerator value of PIN19 field.                                 */
  #define GPIO_OUTCLR_PIN19_Max (0x1UL)              /*!< Max enumerator value of PIN19 field.                                 */
  #define GPIO_OUTCLR_PIN19_Low (0x0UL)              /*!< Read: pin driver is low                                              */
  #define GPIO_OUTCLR_PIN19_High (0x1UL)             /*!< Read: pin driver is high                                             */
  #define GPIO_OUTCLR_PIN19_Clear (0x1UL)            /*!< Write: writing a '1' sets the pin low; writing a '0' has no effect   */

/* PIN20 @Bit 20 : Pin 20 */
  #define GPIO_OUTCLR_PIN20_Pos (20UL)               /*!< Position of PIN20 field.                                             */
  #define GPIO_OUTCLR_PIN20_Msk (0x1UL << GPIO_OUTCLR_PIN20_Pos) /*!< Bit mask of PIN20 field.                                 */
  #define GPIO_OUTCLR_PIN20_Min (0x0UL)              /*!< Min enumerator value of PIN20 field.                                 */
  #define GPIO_OUTCLR_PIN20_Max (0x1UL)              /*!< Max enumerator value of PIN20 field.                                 */
  #define GPIO_OUTCLR_PIN20_Low (0x0UL)              /*!< Read: pin driver is low                                              */
  #define GPIO_OUTCLR_PIN20_High (0x1UL)             /*!< Read: pin driver is high                                             */
  #define GPIO_OUTCLR_PIN20_Clear (0x1UL)            /*!< Write: writing a '1' sets the pin low; writing a '0' has no effect   */

/* PIN21 @Bit 21 : Pin 21 */
  #define GPIO_OUTCLR_PIN21_Pos (21UL)               /*!< Position of PIN21 field.                                             */
  #define GPIO_OUTCLR_PIN21_Msk (0x1UL << GPIO_OUTCLR_PIN21_Pos) /*!< Bit mask of PIN21 field.                                 */
  #define GPIO_OUTCLR_PIN21_Min (0x0UL)              /*!< Min enumerator value of PIN21 field.                                 */
  #define GPIO_OUTCLR_PIN21_Max (0x1UL)              /*!< Max enumerator value of PIN21 field.                                 */
  #define GPIO_OUTCLR_PIN21_Low (0x0UL)              /*!< Read: pin driver is low                                              */
  #define GPIO_OUTCLR_PIN21_High (0x1UL)             /*!< Read: pin driver is high                                             */
  #define GPIO_OUTCLR_PIN21_Clear (0x1UL)            /*!< Write: writing a '1' sets the pin low; writing a '0' has no effect   */

/* PIN22 @Bit 22 : Pin 22 */
  #define GPIO_OUTCLR_PIN22_Pos (22UL)               /*!< Position of PIN22 field.                                             */
  #define GPIO_OUTCLR_PIN22_Msk (0x1UL << GPIO_OUTCLR_PIN22_Pos) /*!< Bit mask of PIN22 field.                                 */
  #define GPIO_OUTCLR_PIN22_Min (0x0UL)              /*!< Min enumerator value of PIN22 field.                                 */
  #define GPIO_OUTCLR_PIN22_Max (0x1UL)              /*!< Max enumerator value of PIN22 field.                                 */
  #define GPIO_OUTCLR_PIN22_Low (0x0UL)              /*!< Read: pin driver is low                                              */
  #define GPIO_OUTCLR_PIN22_High (0x1UL)             /*!< Read: pin driver is high                                             */
  #define GPIO_OUTCLR_PIN22_Clear (0x1UL)            /*!< Write: writing a '1' sets the pin low; writing a '0' has no effect   */

/* PIN23 @Bit 23 : Pin 23 */
  #define GPIO_OUTCLR_PIN23_Pos (23UL)               /*!< Position of PIN23 field.                                             */
  #define GPIO_OUTCLR_PIN23_Msk (0x1UL << GPIO_OUTCLR_PIN23_Pos) /*!< Bit mask of PIN23 field.                                 */
  #define GPIO_OUTCLR_PIN23_Min (0x0UL)              /*!< Min enumerator value of PIN23 field.                                 */
  #define GPIO_OUTCLR_PIN23_Max (0x1UL)              /*!< Max enumerator value of PIN23 field.                                 */
  #define GPIO_OUTCLR_PIN23_Low (0x0UL)              /*!< Read: pin driver is low                                              */
  #define GPIO_OUTCLR_PIN23_High (0x1UL)             /*!< Read: pin driver is high                                             */
  #define GPIO_OUTCLR_PIN23_Clear (0x1UL)            /*!< Write: writing a '1' sets the pin low; writing a '0' has no effect   */

/* PIN24 @Bit 24 : Pin 24 */
  #define GPIO_OUTCLR_PIN24_Pos (24UL)               /*!< Position of PIN24 field.                                             */
  #define GPIO_OUTCLR_PIN24_Msk (0x1UL << GPIO_OUTCLR_PIN24_Pos) /*!< Bit mask of PIN24 field.                                 */
  #define GPIO_OUTCLR_PIN24_Min (0x0UL)              /*!< Min enumerator value of PIN24 field.                                 */
  #define GPIO_OUTCLR_PIN24_Max (0x1UL)              /*!< Max enumerator value of PIN24 field.                                 */
  #define GPIO_OUTCLR_PIN24_Low (0x0UL)              /*!< Read: pin driver is low                                              */
  #define GPIO_OUTCLR_PIN24_High (0x1UL)             /*!< Read: pin driver is high                                             */
  #define GPIO_OUTCLR_PIN24_Clear (0x1UL)            /*!< Write: writing a '1' sets the pin low; writing a '0' has no effect   */

/* PIN25 @Bit 25 : Pin 25 */
  #define GPIO_OUTCLR_PIN25_Pos (25UL)               /*!< Position of PIN25 field.                                             */
  #define GPIO_OUTCLR_PIN25_Msk (0x1UL << GPIO_OUTCLR_PIN25_Pos) /*!< Bit mask of PIN25 field.                                 */
  #define GPIO_OUTCLR_PIN25_Min (0x0UL)              /*!< Min enumerator value of PIN25 field.                                 */
  #define GPIO_OUTCLR_PIN25_Max (0x1UL)              /*!< Max enumerator value of PIN25 field.                                 */
  #define GPIO_OUTCLR_PIN25_Low (0x0UL)              /*!< Read: pin driver is low                                              */
  #define GPIO_OUTCLR_PIN25_High (0x1UL)             /*!< Read: pin driver is high                                             */
  #define GPIO_OUTCLR_PIN25_Clear (0x1UL)            /*!< Write: writing a '1' sets the pin low; writing a '0' has no effect   */

