nrfconnect/sdk-hal_nordic/nrfx/mdk/nrf54l20_enga_types.h
/* PIN25 @Bit 25 : Set as output pin 25 */
  #define GPIO_DIRSET_PIN25_Pos (25UL)               /*!< Position of PIN25 field.                                             */
  #define GPIO_DIRSET_PIN25_Msk (0x1UL << GPIO_DIRSET_PIN25_Pos) /*!< Bit mask of PIN25 field.                                 */
  #define GPIO_DIRSET_PIN25_Min (0x0UL)              /*!< Min enumerator value of PIN25 field.                                 */
  #define GPIO_DIRSET_PIN25_Max (0x1UL)              /*!< Max enumerator value of PIN25 field.                                 */
  #define GPIO_DIRSET_PIN25_Input (0x0UL)            /*!< Read: pin set as input                                               */
  #define GPIO_DIRSET_PIN25_Output (0x1UL)           /*!< Read: pin set as output                                              */
  #define GPIO_DIRSET_PIN25_Set (0x1UL)              /*!< Write: writing a '1' sets pin to output; writing a '0' has no effect */

/* PIN26 @Bit 26 : Set as output pin 26 */
  #define GPIO_DIRSET_PIN26_Pos (26UL)               /*!< Position of PIN26 field.                                             */
  #define GPIO_DIRSET_PIN26_Msk (0x1UL << GPIO_DIRSET_PIN26_Pos) /*!< Bit mask of PIN26 field.                                 */
  #define GPIO_DIRSET_PIN26_Min (0x0UL)              /*!< Min enumerator value of PIN26 field.                                 */
  #define GPIO_DIRSET_PIN26_Max (0x1UL)              /*!< Max enumerator value of PIN26 field.                                 */
  #define GPIO_DIRSET_PIN26_Input (0x0UL)            /*!< Read: pin set as input                                               */
  #define GPIO_DIRSET_PIN26_Output (0x1UL)           /*!< Read: pin set as output                                              */
  #define GPIO_DIRSET_PIN26_Set (0x1UL)              /*!< Write: writing a '1' sets pin to output; writing a '0' has no effect */

/* PIN27 @Bit 27 : Set as output pin 27 */
  #define GPIO_DIRSET_PIN27_Pos (27UL)               /*!< Position of PIN27 field.                                             */
  #define GPIO_DIRSET_PIN27_Msk (0x1UL << GPIO_DIRSET_PIN27_Pos) /*!< Bit mask of PIN27 field.                                 */
  #define GPIO_DIRSET_PIN27_Min (0x0UL)              /*!< Min enumerator value of PIN27 field.                                 */
  #define GPIO_DIRSET_PIN27_Max (0x1UL)              /*!< Max enumerator value of PIN27 field.                                 */
  #define GPIO_DIRSET_PIN27_Input (0x0UL)            /*!< Read: pin set as input                                               */
  #define GPIO_DIRSET_PIN27_Output (0x1UL)           /*!< Read: pin set as output                                              */
  #define GPIO_DIRSET_PIN27_Set (0x1UL)              /*!< Write: writing a '1' sets pin to output; writing a '0' has no effect */

/* PIN28 @Bit 28 : Set as output pin 28 */
  #define GPIO_DIRSET_PIN28_Pos (28UL)               /*!< Position of PIN28 field.                                             */
  #define GPIO_DIRSET_PIN28_Msk (0x1UL << GPIO_DIRSET_PIN28_Pos) /*!< Bit mask of PIN28 field.                                 */
  #define GPIO_DIRSET_PIN28_Min (0x0UL)              /*!< Min enumerator value of PIN28 field.                                 */
  #define GPIO_DIRSET_PIN28_Max (0x1UL)              /*!< Max enumerator value of PIN28 field.                                 */
  #define GPIO_DIRSET_PIN28_Input (0x0UL)            /*!< Read: pin set as input                                               */
  #define GPIO_DIRSET_PIN28_Output (0x1UL)           /*!< Read: pin set as output                                              */
  #define GPIO_DIRSET_PIN28_Set (0x1UL)              /*!< Write: writing a '1' sets pin to output; writing a '0' has no effect */

/* PIN29 @Bit 29 : Set as output pin 29 */
  #define GPIO_DIRSET_PIN29_Pos (29UL)               /*!< Position of PIN29 field.                                             */
  #define GPIO_DIRSET_PIN29_Msk (0x1UL << GPIO_DIRSET_PIN29_Pos) /*!< Bit mask of PIN29 field.                                 */
  #define GPIO_DIRSET_PIN29_Min (0x0UL)              /*!< Min enumerator value of PIN29 field.                                 */
  #define GPIO_DIRSET_PIN29_Max (0x1UL)              /*!< Max enumerator value of PIN29 field.                                 */
  #define GPIO_DIRSET_PIN29_Input (0x0UL)            /*!< Read: pin set as input                                               */
  #define GPIO_DIRSET_PIN29_Output (0x1UL)           /*!< Read: pin set as output                                              */
  #define GPIO_DIRSET_PIN29_Set (0x1UL)              /*!< Write: writing a '1' sets pin to output; writing a '0' has no effect */

/* PIN30 @Bit 30 : Set as output pin 30 */
  #define GPIO_DIRSET_PIN30_Pos (30UL)               /*!< Position of PIN30 field.                                             */
  #define GPIO_DIRSET_PIN30_Msk (0x1UL << GPIO_DIRSET_PIN30_Pos) /*!< Bit mask of PIN30 field.                                 */
  #define GPIO_DIRSET_PIN30_Min (0x0UL)              /*!< Min enumerator value of PIN30 field.                                 */
  #define GPIO_DIRSET_PIN30_Max (0x1UL)              /*!< Max enumerator value of PIN30 field.                                 */
  #define GPIO_DIRSET_PIN30_Input (0x0UL)            /*!< Read: pin set as input                                               */
  #define GPIO_DIRSET_PIN30_Output (0x1UL)           /*!< Read: pin set as output                                              */
  #define GPIO_DIRSET_PIN30_Set (0x1UL)              /*!< Write: writing a '1' sets pin to output; writing a '0' has no effect */

/* PIN31 @Bit 31 : Set as output pin 31 */
  #define GPIO_DIRSET_PIN31_Pos (31UL)               /*!< Position of PIN31 field.                                             */
  #define GPIO_DIRSET_PIN31_Msk (0x1UL << GPIO_DIRSET_PIN31_Pos) /*!< Bit mask of PIN31 field.                                 */
  #define GPIO_DIRSET_PIN31_Min (0x0UL)              /*!< Min enumerator value of PIN31 field.                                 */
  #define GPIO_DIRSET_PIN31_Max (0x1UL)              /*!< Max enumerator value of PIN31 field.                                 */
  #define GPIO_DIRSET_PIN31_Input (0x0UL)            /*!< Read: pin set as input                                               */
  #define GPIO_DIRSET_PIN31_Output (0x1UL)           /*!< Read: pin set as output                                              */
  #define GPIO_DIRSET_PIN31_Set (0x1UL)              /*!< Write: writing a '1' sets pin to output; writing a '0' has no effect */


/* GPIO_DIRCLR: DIR clear register */
  #define GPIO_DIRCLR_ResetValue (0x00000000UL)      /*!< Reset value of DIRCLR register.                                      */

