nrfconnect/sdk-hal_nordic/nrfx/mdk/nrf54l20_enga_types.h
/* LOCK @Bit 8 : Locks the region n setting */
  #define MPC_REGION_CONFIG_LOCK_Pos (8UL)           /*!< Position of LOCK field.                                              */
  #define MPC_REGION_CONFIG_LOCK_Msk (0x1UL << MPC_REGION_CONFIG_LOCK_Pos) /*!< Bit mask of LOCK field.                        */
  #define MPC_REGION_CONFIG_LOCK_Min (0x0UL)         /*!< Min enumerator value of LOCK field.                                  */
  #define MPC_REGION_CONFIG_LOCK_Max (0x1UL)         /*!< Max enumerator value of LOCK field.                                  */
  #define MPC_REGION_CONFIG_LOCK_Unlocked (0x0UL)    /*!< Region n settings can be updated                                     */
  #define MPC_REGION_CONFIG_LOCK_Locked (0x1UL)      /*!< Region n settings can't be updated until next reset                  */

/* ENABLE @Bit 9 : Region n enable */
  #define MPC_REGION_CONFIG_ENABLE_Pos (9UL)         /*!< Position of ENABLE field.                                            */
  #define MPC_REGION_CONFIG_ENABLE_Msk (0x1UL << MPC_REGION_CONFIG_ENABLE_Pos) /*!< Bit mask of ENABLE field.                  */
  #define MPC_REGION_CONFIG_ENABLE_Min (0x0UL)       /*!< Min enumerator value of ENABLE field.                                */
  #define MPC_REGION_CONFIG_ENABLE_Max (0x1UL)       /*!< Max enumerator value of ENABLE field.                                */
  #define MPC_REGION_CONFIG_ENABLE_Disabled (0x0UL)  /*!< Region n is not used                                                 */
  #define MPC_REGION_CONFIG_ENABLE_Enabled (0x1UL)   /*!< Region n is used                                                     */

/* READ @Bit 12 : Read access */
  #define MPC_REGION_CONFIG_READ_Pos (12UL)          /*!< Position of READ field.                                              */
  #define MPC_REGION_CONFIG_READ_Msk (0x1UL << MPC_REGION_CONFIG_READ_Pos) /*!< Bit mask of READ field.                        */
  #define MPC_REGION_CONFIG_READ_Min (0x0UL)         /*!< Min enumerator value of READ field.                                  */
  #define MPC_REGION_CONFIG_READ_Max (0x1UL)         /*!< Max enumerator value of READ field.                                  */
  #define MPC_REGION_CONFIG_READ_NotAllowed (0x0UL)  /*!< Read access to region n is not allowed                               */
  #define MPC_REGION_CONFIG_READ_Allowed (0x1UL)     /*!< Read access to region n is allowed                                   */

/* WRITE @Bit 13 : Write access */
  #define MPC_REGION_CONFIG_WRITE_Pos (13UL)         /*!< Position of WRITE field.                                             */
  #define MPC_REGION_CONFIG_WRITE_Msk (0x1UL << MPC_REGION_CONFIG_WRITE_Pos) /*!< Bit mask of WRITE field.                     */
  #define MPC_REGION_CONFIG_WRITE_Min (0x0UL)        /*!< Min enumerator value of WRITE field.                                 */
  #define MPC_REGION_CONFIG_WRITE_Max (0x1UL)        /*!< Max enumerator value of WRITE field.                                 */
  #define MPC_REGION_CONFIG_WRITE_NotAllowed (0x0UL) /*!< Write access to region n is not allowed                              */
  #define MPC_REGION_CONFIG_WRITE_Allowed (0x1UL)    /*!< Write access to region n is allowed                                  */

/* EXECUTE @Bit 14 : Software execute */
  #define MPC_REGION_CONFIG_EXECUTE_Pos (14UL)       /*!< Position of EXECUTE field.                                           */
  #define MPC_REGION_CONFIG_EXECUTE_Msk (0x1UL << MPC_REGION_CONFIG_EXECUTE_Pos) /*!< Bit mask of EXECUTE field.               */
  #define MPC_REGION_CONFIG_EXECUTE_Min (0x0UL)      /*!< Min enumerator value of EXECUTE field.                               */
  #define MPC_REGION_CONFIG_EXECUTE_Max (0x1UL)      /*!< Max enumerator value of EXECUTE field.                               */
  #define MPC_REGION_CONFIG_EXECUTE_NotAllowed (0x0UL) /*!< Software execution from region n is not allowed                    */
  #define MPC_REGION_CONFIG_EXECUTE_Allowed (0x1UL)  /*!< Software execution from region n is allowed                          */

/* SECATTR @Bit 15 : Memory security mapping */
  #define MPC_REGION_CONFIG_SECATTR_Pos (15UL)       /*!< Position of SECATTR field.                                           */
  #define MPC_REGION_CONFIG_SECATTR_Msk (0x1UL << MPC_REGION_CONFIG_SECATTR_Pos) /*!< Bit mask of SECATTR field.               */
  #define MPC_REGION_CONFIG_SECATTR_Min (0x0UL)      /*!< Min enumerator value of SECATTR field.                               */
  #define MPC_REGION_CONFIG_SECATTR_Max (0x1UL)      /*!< Max enumerator value of SECATTR field.                               */
  #define MPC_REGION_CONFIG_SECATTR_Secure (0x1UL)   /*!< Memory is mapped in secure memory address space                      */
  #define MPC_REGION_CONFIG_SECATTR_NonSecure (0x0UL) /*!< Memory is mapped in non-secure memory address space                 */

/* OWNERID @Bits 16..19 : Region owner identifier. */
  #define MPC_REGION_CONFIG_OWNERID_Pos (16UL)       /*!< Position of OWNERID field.                                           */
  #define MPC_REGION_CONFIG_OWNERID_Msk (0xFUL << MPC_REGION_CONFIG_OWNERID_Pos) /*!< Bit mask of OWNERID field.               */


/* MPC_REGION_STARTADDR: Region n start address */
  #define MPC_REGION_STARTADDR_ResetValue (0x00000000UL) /*!< Reset value of STARTADDR register.                               */

/* STARTADDR @Bits 0..31 : Start address for memory region n */
  #define MPC_REGION_STARTADDR_STARTADDR_Pos (0UL)   /*!< Position of STARTADDR field.                                         */
  #define MPC_REGION_STARTADDR_STARTADDR_Msk (0xFFFFFFFFUL << MPC_REGION_STARTADDR_STARTADDR_Pos) /*!< Bit mask of STARTADDR
                                                                            field.*/


/* MPC_REGION_ADDRMASK: Select which bits of the incoming address are compared against the STARTADDR */
  #define MPC_REGION_ADDRMASK_ResetValue (0x00000000UL) /*!< Reset value of ADDRMASK register.                                 */

/* ADDRMASK @Bits 0..31 : Address mask for memory region n */
  #define MPC_REGION_ADDRMASK_ADDRMASK_Pos (0UL)     /*!< Position of ADDRMASK field.                                          */
  #define MPC_REGION_ADDRMASK_ADDRMASK_Msk (0xFFFFFFFFUL << MPC_REGION_ADDRMASK_ADDRMASK_Pos) /*!< Bit mask of ADDRMASK field. */


/* MPC_REGION_MASTERPORT: Region n local master enable */
  #define MPC_REGION_MASTERPORT_ResetValue (0x00000000UL) /*!< Reset value of MASTERPORT register.                             */

/* ENABLE0 @Bit 0 : Enable region n for master port 0 */
  #define MPC_REGION_MASTERPORT_ENABLE0_Pos (0UL)    /*!< Position of ENABLE0 field.                                           */
  #define MPC_REGION_MASTERPORT_ENABLE0_Msk (0x1UL << MPC_REGION_MASTERPORT_ENABLE0_Pos) /*!< Bit mask of ENABLE0 field.       */
  #define MPC_REGION_MASTERPORT_ENABLE0_Min (0x0UL)  /*!< Min enumerator value of ENABLE0 field.                               */
  #define MPC_REGION_MASTERPORT_ENABLE0_Max (0x1UL)  /*!< Max enumerator value of ENABLE0 field.                               */
  #define MPC_REGION_MASTERPORT_ENABLE0_Disable (0x0UL) /*!< Region n is disabled for master port 0                            */
  #define MPC_REGION_MASTERPORT_ENABLE0_Enable (0x1UL) /*!< Region n is enabled for master port 0                              */

/* ENABLE1 @Bit 1 : Enable region n for master port 1 */
  #define MPC_REGION_MASTERPORT_ENABLE1_Pos (1UL)    /*!< Position of ENABLE1 field.                                           */
  #define MPC_REGION_MASTERPORT_ENABLE1_Msk (0x1UL << MPC_REGION_MASTERPORT_ENABLE1_Pos) /*!< Bit mask of ENABLE1 field.       */
  #define MPC_REGION_MASTERPORT_ENABLE1_Min (0x0UL)  /*!< Min enumerator value of ENABLE1 field.                               */
  #define MPC_REGION_MASTERPORT_ENABLE1_Max (0x1UL)  /*!< Max enumerator value of ENABLE1 field.                               */
  #define MPC_REGION_MASTERPORT_ENABLE1_Disable (0x0UL) /*!< Region n is disabled for master port 1                            */
  #define MPC_REGION_MASTERPORT_ENABLE1_Enable (0x1UL) /*!< Region n is enabled for master port 1                              */

/* ENABLE2 @Bit 2 : Enable region n for master port 2 */
  #define MPC_REGION_MASTERPORT_ENABLE2_Pos (2UL)    /*!< Position of ENABLE2 field.                                           */
  #define MPC_REGION_MASTERPORT_ENABLE2_Msk (0x1UL << MPC_REGION_MASTERPORT_ENABLE2_Pos) /*!< Bit mask of ENABLE2 field.       */
  #define MPC_REGION_MASTERPORT_ENABLE2_Min (0x0UL)  /*!< Min enumerator value of ENABLE2 field.                               */
  #define MPC_REGION_MASTERPORT_ENABLE2_Max (0x1UL)  /*!< Max enumerator value of ENABLE2 field.                               */
  #define MPC_REGION_MASTERPORT_ENABLE2_Disable (0x0UL) /*!< Region n is disabled for master port 2                            */
  #define MPC_REGION_MASTERPORT_ENABLE2_Enable (0x1UL) /*!< Region n is enabled for master port 2                              */

