nrfconnect/sdk-hal_nordic/nrfx/mdk/nrf54l20_enga_types.h
/* NFCT_RXD_AMOUNT: Size of last incoming frame */
  #define NFCT_RXD_AMOUNT_ResetValue (0x00000000UL)  /*!< Reset value of AMOUNT register.                                      */

/* RXDATABITS @Bits 0..2 : Number of bits in the last byte in the frame, if less than 8 (including CRC, but excluding parity and
                           SoF/EoF framing). */

  #define NFCT_RXD_AMOUNT_RXDATABITS_Pos (0UL)       /*!< Position of RXDATABITS field.                                        */
  #define NFCT_RXD_AMOUNT_RXDATABITS_Msk (0x7UL << NFCT_RXD_AMOUNT_RXDATABITS_Pos) /*!< Bit mask of RXDATABITS field.          */

/* RXDATABYTES @Bits 3..11 : Number of complete bytes received in the frame (including CRC, but excluding parity and SoF/EoF
                             framing) */

  #define NFCT_RXD_AMOUNT_RXDATABYTES_Pos (3UL)      /*!< Position of RXDATABYTES field.                                       */
  #define NFCT_RXD_AMOUNT_RXDATABYTES_Msk (0x1FFUL << NFCT_RXD_AMOUNT_RXDATABYTES_Pos) /*!< Bit mask of RXDATABYTES field.     */



/* =================================================== Struct NFCT_NFCID1 ==================================================== */
/**
  * @brief NFCID1 [NFCT_NFCID1] (unspecified)
  */
typedef struct {
  __IOM uint32_t  LAST;                              /*!< (@ 0x00000000) Last NFCID1 part (4, 7 or 10 bytes ID)                */
  __IOM uint32_t  SECONDLAST;                        /*!< (@ 0x00000004) Second last NFCID1 part (7 or 10 bytes ID)            */
  __IOM uint32_t  THIRDLAST;                         /*!< (@ 0x00000008) Third last NFCID1 part (10 bytes ID)                  */
} NRF_NFCT_NFCID1_Type;                              /*!< Size = 12 (0x00C)                                                    */

/* NFCT_NFCID1_LAST: Last NFCID1 part (4, 7 or 10 bytes ID) */
  #define NFCT_NFCID1_LAST_ResetValue (0x00006363UL) /*!< Reset value of LAST register.                                        */

/* Z @Bits 0..7 : NFCID1 byte Z (very last byte sent) */
  #define NFCT_NFCID1_LAST_Z_Pos (0UL)               /*!< Position of Z field.                                                 */
  #define NFCT_NFCID1_LAST_Z_Msk (0xFFUL << NFCT_NFCID1_LAST_Z_Pos) /*!< Bit mask of Z field.                                  */

/* Y @Bits 8..15 : NFCID1 byte Y */
  #define NFCT_NFCID1_LAST_Y_Pos (8UL)               /*!< Position of Y field.                                                 */
  #define NFCT_NFCID1_LAST_Y_Msk (0xFFUL << NFCT_NFCID1_LAST_Y_Pos) /*!< Bit mask of Y field.                                  */

/* X @Bits 16..23 : NFCID1 byte X */
  #define NFCT_NFCID1_LAST_X_Pos (16UL)              /*!< Position of X field.                                                 */
  #define NFCT_NFCID1_LAST_X_Msk (0xFFUL << NFCT_NFCID1_LAST_X_Pos) /*!< Bit mask of X field.                                  */

/* W @Bits 24..31 : NFCID1 byte W */
  #define NFCT_NFCID1_LAST_W_Pos (24UL)              /*!< Position of W field.                                                 */
  #define NFCT_NFCID1_LAST_W_Msk (0xFFUL << NFCT_NFCID1_LAST_W_Pos) /*!< Bit mask of W field.                                  */


/* NFCT_NFCID1_SECONDLAST: Second last NFCID1 part (7 or 10 bytes ID) */
  #define NFCT_NFCID1_SECONDLAST_ResetValue (0x00000000UL) /*!< Reset value of SECONDLAST register.                            */

/* V @Bits 0..7 : NFCID1 byte V */
  #define NFCT_NFCID1_SECONDLAST_V_Pos (0UL)         /*!< Position of V field.                                                 */
  #define NFCT_NFCID1_SECONDLAST_V_Msk (0xFFUL << NFCT_NFCID1_SECONDLAST_V_Pos) /*!< Bit mask of V field.                      */

/* U @Bits 8..15 : NFCID1 byte U */
  #define NFCT_NFCID1_SECONDLAST_U_Pos (8UL)         /*!< Position of U field.                                                 */
  #define NFCT_NFCID1_SECONDLAST_U_Msk (0xFFUL << NFCT_NFCID1_SECONDLAST_U_Pos) /*!< Bit mask of U field.                      */

/* T @Bits 16..23 : NFCID1 byte T */
  #define NFCT_NFCID1_SECONDLAST_T_Pos (16UL)        /*!< Position of T field.                                                 */
  #define NFCT_NFCID1_SECONDLAST_T_Msk (0xFFUL << NFCT_NFCID1_SECONDLAST_T_Pos) /*!< Bit mask of T field.                      */


/* NFCT_NFCID1_THIRDLAST: Third last NFCID1 part (10 bytes ID) */
  #define NFCT_NFCID1_THIRDLAST_ResetValue (0x00000000UL) /*!< Reset value of THIRDLAST register.                              */

/* S @Bits 0..7 : NFCID1 byte S */
  #define NFCT_NFCID1_THIRDLAST_S_Pos (0UL)          /*!< Position of S field.                                                 */
  #define NFCT_NFCID1_THIRDLAST_S_Msk (0xFFUL << NFCT_NFCID1_THIRDLAST_S_Pos) /*!< Bit mask of S field.                        */

/* R @Bits 8..15 : NFCID1 byte R */
  #define NFCT_NFCID1_THIRDLAST_R_Pos (8UL)          /*!< Position of R field.                                                 */
  #define NFCT_NFCID1_THIRDLAST_R_Msk (0xFFUL << NFCT_NFCID1_THIRDLAST_R_Pos) /*!< Bit mask of R field.                        */

/* Q @Bits 16..23 : NFCID1 byte Q */
  #define NFCT_NFCID1_THIRDLAST_Q_Pos (16UL)         /*!< Position of Q field.                                                 */
  #define NFCT_NFCID1_THIRDLAST_Q_Msk (0xFFUL << NFCT_NFCID1_THIRDLAST_Q_Pos) /*!< Bit mask of Q field.                        */


/* ======================================================= Struct NFCT ======================================================= */
/**
  * @brief NFC-A compatible radio NFC-A compatible radio
  */
  typedef struct {                                   /*!< NFCT Structure                                                       */
    __OM uint32_t TASKS_ACTIVATE;                    /*!< (@ 0x00000000) Activate NFCT peripheral for incoming and outgoing
                                                                         frames, change state to activated*/
    __OM uint32_t TASKS_DISABLE;                     /*!< (@ 0x00000004) Disable NFCT peripheral                               */
    __OM uint32_t TASKS_SENSE;                       /*!< (@ 0x00000008) Enable NFC sense field mode, change state to sense
                                                                         mode*/
    __OM uint32_t TASKS_STARTTX;                     /*!< (@ 0x0000000C) Start transmission of an outgoing frame, change state
                                                                         to transmit*/
    __OM uint32_t TASKS_STOPTX;                      /*!< (@ 0x00000010) Stops an issued transmission of a frame               */
    __IM uint32_t RESERVED[2];
    __OM uint32_t TASKS_ENABLERXDATA;                /*!< (@ 0x0000001C) Initializes the EasyDMA for receive.                  */
    __IM uint32_t RESERVED1;
    __OM uint32_t TASKS_GOIDLE;                      /*!< (@ 0x00000024) Force state machine to IDLE state                     */
    __OM uint32_t TASKS_GOSLEEP;                     /*!< (@ 0x00000028) Force state machine to SLEEP_A state                  */
    __IM uint32_t RESERVED2[21];
    __IOM uint32_t SUBSCRIBE_ACTIVATE;               /*!< (@ 0x00000080) Subscribe configuration for task ACTIVATE             */
    __IOM uint32_t SUBSCRIBE_DISABLE;                /*!< (@ 0x00000084) Subscribe configuration for task DISABLE              */
    __IOM uint32_t SUBSCRIBE_SENSE;                  /*!< (@ 0x00000088) Subscribe configuration for task SENSE                */
    __IOM uint32_t SUBSCRIBE_STARTTX;                /*!< (@ 0x0000008C) Subscribe configuration for task STARTTX              */
    __IOM uint32_t SUBSCRIBE_STOPTX;                 /*!< (@ 0x00000090) Subscribe configuration for task STOPTX               */
    __IM uint32_t RESERVED3[2];
    __IOM uint32_t SUBSCRIBE_ENABLERXDATA;           /*!< (@ 0x0000009C) Subscribe configuration for task ENABLERXDATA         */
    __IM uint32_t RESERVED4;
    __IOM uint32_t SUBSCRIBE_GOIDLE;                 /*!< (@ 0x000000A4) Subscribe configuration for task GOIDLE               */
    __IOM uint32_t SUBSCRIBE_GOSLEEP;                /*!< (@ 0x000000A8) Subscribe configuration for task GOSLEEP              */
    __IM uint32_t RESERVED5[21];
    __IOM uint32_t EVENTS_READY;                     /*!< (@ 0x00000100) The NFCT peripheral is ready to receive and send
                                                                         frames*/
    __IOM uint32_t EVENTS_FIELDDETECTED;             /*!< (@ 0x00000104) Remote NFC field detected                             */
    __IOM uint32_t EVENTS_FIELDLOST;                 /*!< (@ 0x00000108) Remote NFC field lost                                 */
    __IOM uint32_t EVENTS_TXFRAMESTART;              /*!< (@ 0x0000010C) Marks the start of the first symbol of a transmitted
                                                                         frame*/
    __IOM uint32_t EVENTS_TXFRAMEEND;                /*!< (@ 0x00000110) Marks the end of the last transmitted on-air symbol of
                                                                         a frame*/
    __IOM uint32_t EVENTS_RXFRAMESTART;              /*!< (@ 0x00000114) Marks the end of the first symbol of a received frame */
    __IOM uint32_t EVENTS_RXFRAMEEND;                /*!< (@ 0x00000118) Received data has been checked (CRC, parity) and
                                                                         transferred to RAM, and EasyDMA has ended accessing the
                                                                         RX buffer*/
    __IOM uint32_t EVENTS_ERROR;                     /*!< (@ 0x0000011C) NFC error reported. The ERRORSTATUS register contains
                                                                         details on the source of the error.*/
    __IM uint32_t RESERVED6[2];
    __IOM uint32_t EVENTS_RXERROR;                   /*!< (@ 0x00000128) NFC RX frame error reported. The FRAMESTATUS.RX
                                                                         register contains details on the source of the error.*/
    __IOM uint32_t EVENTS_ENDRX;                     /*!< (@ 0x0000012C) RX buffer (as defined by PACKETPTR and MAXLEN) in Data
                                                                         RAM full.*/
    __IOM uint32_t EVENTS_ENDTX;                     /*!< (@ 0x00000130) Transmission of data in RAM has ended, and EasyDMA has
                                                                         ended accessing the TX buffer*/
    __IM uint32_t RESERVED7;
    __IOM uint32_t EVENTS_AUTOCOLRESSTARTED;         /*!< (@ 0x00000138) Auto collision resolution process has started         */
    __IM uint32_t RESERVED8[3];
    __IOM uint32_t EVENTS_COLLISION;                 /*!< (@ 0x00000148) NFC auto collision resolution error reported.         */
    __IOM uint32_t EVENTS_SELECTED;                  /*!< (@ 0x0000014C) NFC auto collision resolution successfully completed  */
    __IOM uint32_t EVENTS_STARTED;                   /*!< (@ 0x00000150) EasyDMA is ready to receive or send frames.           */
    __IM uint32_t RESERVED9[11];
    __IOM uint32_t PUBLISH_READY;                    /*!< (@ 0x00000180) Publish configuration for event READY                 */
    __IOM uint32_t PUBLISH_FIELDDETECTED;            /*!< (@ 0x00000184) Publish configuration for event FIELDDETECTED         */
    __IOM uint32_t PUBLISH_FIELDLOST;                /*!< (@ 0x00000188) Publish configuration for event FIELDLOST             */
    __IOM uint32_t PUBLISH_TXFRAMESTART;             /*!< (@ 0x0000018C) Publish configuration for event TXFRAMESTART          */
    __IOM uint32_t PUBLISH_TXFRAMEEND;               /*!< (@ 0x00000190) Publish configuration for event TXFRAMEEND            */
    __IOM uint32_t PUBLISH_RXFRAMESTART;             /*!< (@ 0x00000194) Publish configuration for event RXFRAMESTART          */
    __IOM uint32_t PUBLISH_RXFRAMEEND;               /*!< (@ 0x00000198) Publish configuration for event RXFRAMEEND            */
    __IOM uint32_t PUBLISH_ERROR;                    /*!< (@ 0x0000019C) Publish configuration for event ERROR                 */
    __IM uint32_t RESERVED10[2];
    __IOM uint32_t PUBLISH_RXERROR;                  /*!< (@ 0x000001A8) Publish configuration for event RXERROR               */
    __IOM uint32_t PUBLISH_ENDRX;                    /*!< (@ 0x000001AC) Publish configuration for event ENDRX                 */
    __IOM uint32_t PUBLISH_ENDTX;                    /*!< (@ 0x000001B0) Publish configuration for event ENDTX                 */
    __IM uint32_t RESERVED11;
    __IOM uint32_t PUBLISH_AUTOCOLRESSTARTED;        /*!< (@ 0x000001B8) Publish configuration for event AUTOCOLRESSTARTED     */
    __IM uint32_t RESERVED12[3];
    __IOM uint32_t PUBLISH_COLLISION;                /*!< (@ 0x000001C8) Publish configuration for event COLLISION             */
    __IOM uint32_t PUBLISH_SELECTED;                 /*!< (@ 0x000001CC) Publish configuration for event SELECTED              */
    __IOM uint32_t PUBLISH_STARTED;                  /*!< (@ 0x000001D0) Publish configuration for event STARTED               */
    __IM uint32_t RESERVED13[11];
    __IOM uint32_t SHORTS;                           /*!< (@ 0x00000200) Shortcuts between local events and tasks              */
    __IM uint32_t RESERVED14[63];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t RESERVED15[62];
    __IOM uint32_t ERRORSTATUS;                      /*!< (@ 0x00000404) NFC Error Status register                             */
    __IM uint32_t RESERVED16;
    __IOM NRF_NFCT_FRAMESTATUS_Type FRAMESTATUS;     /*!< (@ 0x0000040C) (unspecified)                                         */
    __IM uint32_t NFCTAGSTATE;                       /*!< (@ 0x00000410) Current operating state of NFC tag                    */
    __IM uint32_t RESERVED17[3];
    __IM uint32_t SLEEPSTATE;                        /*!< (@ 0x00000420) Sleep state during automatic collision resolution     */
    __IM uint32_t RESERVED18[6];
    __IM uint32_t FIELDPRESENT;                      /*!< (@ 0x0000043C) Indicates the presence or not of a valid field        */
    __IM uint32_t RESERVED19[49];
    __IOM uint32_t FRAMEDELAYMIN;                    /*!< (@ 0x00000504) Minimum frame delay                                   */
    __IOM uint32_t FRAMEDELAYMAX;                    /*!< (@ 0x00000508) Maximum frame delay                                   */
    __IOM uint32_t FRAMEDELAYMODE;                   /*!< (@ 0x0000050C) Configuration register for the Frame Delay Timer      */
    __IOM uint32_t PACKETPTR;                        /*!< (@ 0x00000510) Packet pointer for TXD and RXD data storage in Data
                                                                         RAM*/
    __IOM uint32_t MAXLEN;                           /*!< (@ 0x00000514) Size of the RAM buffer allocated to TXD and RXD data
                                                                         storage each*/
    __IOM NRF_NFCT_TXD_Type TXD;                     /*!< (@ 0x00000518) (unspecified)                                         */
    __IOM NRF_NFCT_RXD_Type RXD;                     /*!< (@ 0x00000520) (unspecified)                                         */
    __IM uint32_t RESERVED20;
    __IOM uint32_t MODULATIONCTRL;                   /*!< (@ 0x0000052C) Enables the modulation output to a GPIO pin which can
                                                                         be connected to a second external antenna.*/
    __IM uint32_t RESERVED21[2];
    __IOM uint32_t MODULATIONPSEL;                   /*!< (@ 0x00000538) Pin select for Modulation control                     */
    __IM uint32_t RESERVED22[5];
    __IOM uint32_t MODE;                             /*!< (@ 0x00000550) Configure EasyDMA mode                                */
    __IM uint32_t RESERVED23[15];
    __IOM NRF_NFCT_NFCID1_Type NFCID1;               /*!< (@ 0x00000590) (unspecified)                                         */
    __IOM uint32_t AUTOCOLRESCONFIG;                 /*!< (@ 0x0000059C) Controls the auto collision resolution function. This
                                                                         setting must be done before the NFCT peripheral is
                                                                         activated.*/
    __IOM uint32_t SENSRES;                          /*!< (@ 0x000005A0) NFC-A SENS_RES auto-response settings                 */
    __IOM uint32_t SELRES;                           /*!< (@ 0x000005A4) NFC-A SEL_RES auto-response settings                  */
    __IM uint32_t RESERVED24[75];
    __IOM uint32_t PADCONFIG;                        /*!< (@ 0x000006D4) NFC pad configuration                                 */
  } NRF_NFCT_Type;                                   /*!< Size = 1752 (0x6D8)                                                  */

/* NFCT_TASKS_ACTIVATE: Activate NFCT peripheral for incoming and outgoing frames, change state to activated */
  #define NFCT_TASKS_ACTIVATE_ResetValue (0x00000000UL) /*!< Reset value of TASKS_ACTIVATE register.                           */

/* TASKS_ACTIVATE @Bit 0 : Activate NFCT peripheral for incoming and outgoing frames, change state to activated */
  #define NFCT_TASKS_ACTIVATE_TASKS_ACTIVATE_Pos (0UL) /*!< Position of TASKS_ACTIVATE field.                                  */
  #define NFCT_TASKS_ACTIVATE_TASKS_ACTIVATE_Msk (0x1UL << NFCT_TASKS_ACTIVATE_TASKS_ACTIVATE_Pos) /*!< Bit mask of
                                                                            TASKS_ACTIVATE field.*/
  #define NFCT_TASKS_ACTIVATE_TASKS_ACTIVATE_Min (0x1UL) /*!< Min enumerator value of TASKS_ACTIVATE field.                    */
  #define NFCT_TASKS_ACTIVATE_TASKS_ACTIVATE_Max (0x1UL) /*!< Max enumerator value of TASKS_ACTIVATE field.                    */
  #define NFCT_TASKS_ACTIVATE_TASKS_ACTIVATE_Trigger (0x1UL) /*!< Trigger task                                                 */


/* NFCT_TASKS_DISABLE: Disable NFCT peripheral */
  #define NFCT_TASKS_DISABLE_ResetValue (0x00000000UL) /*!< Reset value of TASKS_DISABLE register.                             */

/* TASKS_DISABLE @Bit 0 : Disable NFCT peripheral */
  #define NFCT_TASKS_DISABLE_TASKS_DISABLE_Pos (0UL) /*!< Position of TASKS_DISABLE field.                                     */
  #define NFCT_TASKS_DISABLE_TASKS_DISABLE_Msk (0x1UL << NFCT_TASKS_DISABLE_TASKS_DISABLE_Pos) /*!< Bit mask of TASKS_DISABLE
                                                                            field.*/
  #define NFCT_TASKS_DISABLE_TASKS_DISABLE_Min (0x1UL) /*!< Min enumerator value of TASKS_DISABLE field.                       */
  #define NFCT_TASKS_DISABLE_TASKS_DISABLE_Max (0x1UL) /*!< Max enumerator value of TASKS_DISABLE field.                       */
  #define NFCT_TASKS_DISABLE_TASKS_DISABLE_Trigger (0x1UL) /*!< Trigger task                                                   */


/* NFCT_TASKS_SENSE: Enable NFC sense field mode, change state to sense mode */
  #define NFCT_TASKS_SENSE_ResetValue (0x00000000UL) /*!< Reset value of TASKS_SENSE register.                                 */

/* TASKS_SENSE @Bit 0 : Enable NFC sense field mode, change state to sense mode */
  #define NFCT_TASKS_SENSE_TASKS_SENSE_Pos (0UL)     /*!< Position of TASKS_SENSE field.                                       */
  #define NFCT_TASKS_SENSE_TASKS_SENSE_Msk (0x1UL << NFCT_TASKS_SENSE_TASKS_SENSE_Pos) /*!< Bit mask of TASKS_SENSE field.     */
  #define NFCT_TASKS_SENSE_TASKS_SENSE_Min (0x1UL)   /*!< Min enumerator value of TASKS_SENSE field.                           */
  #define NFCT_TASKS_SENSE_TASKS_SENSE_Max (0x1UL)   /*!< Max enumerator value of TASKS_SENSE field.                           */
  #define NFCT_TASKS_SENSE_TASKS_SENSE_Trigger (0x1UL) /*!< Trigger task                                                       */


/* NFCT_TASKS_STARTTX: Start transmission of an outgoing frame, change state to transmit */
  #define NFCT_TASKS_STARTTX_ResetValue (0x00000000UL) /*!< Reset value of TASKS_STARTTX register.                             */

/* TASKS_STARTTX @Bit 0 : Start transmission of an outgoing frame, change state to transmit */
  #define NFCT_TASKS_STARTTX_TASKS_STARTTX_Pos (0UL) /*!< Position of TASKS_STARTTX field.                                     */
  #define NFCT_TASKS_STARTTX_TASKS_STARTTX_Msk (0x1UL << NFCT_TASKS_STARTTX_TASKS_STARTTX_Pos) /*!< Bit mask of TASKS_STARTTX
                                                                            field.*/
  #define NFCT_TASKS_STARTTX_TASKS_STARTTX_Min (0x1UL) /*!< Min enumerator value of TASKS_STARTTX field.                       */
  #define NFCT_TASKS_STARTTX_TASKS_STARTTX_Max (0x1UL) /*!< Max enumerator value of TASKS_STARTTX field.                       */
  #define NFCT_TASKS_STARTTX_TASKS_STARTTX_Trigger (0x1UL) /*!< Trigger task                                                   */


/* NFCT_TASKS_STOPTX: Stops an issued transmission of a frame */
  #define NFCT_TASKS_STOPTX_ResetValue (0x00000000UL) /*!< Reset value of TASKS_STOPTX register.                               */

