nrfconnect/sdk-hal_nordic/nrfx/mdk/nrf54l20_enga_types.h
/* NFCT_SLEEPSTATE: Sleep state during automatic collision resolution */
  #define NFCT_SLEEPSTATE_ResetValue (0x00000000UL)  /*!< Reset value of SLEEPSTATE register.                                  */

/* SLEEPSTATE @Bit 0 : Reflects the sleep state during automatic collision resolution. Set to IDLE by a GOIDLE task. Set to
                       SLEEP_A when a valid SLEEP_REQ frame is received or by a GOSLEEP task. */

  #define NFCT_SLEEPSTATE_SLEEPSTATE_Pos (0UL)       /*!< Position of SLEEPSTATE field.                                        */
  #define NFCT_SLEEPSTATE_SLEEPSTATE_Msk (0x1UL << NFCT_SLEEPSTATE_SLEEPSTATE_Pos) /*!< Bit mask of SLEEPSTATE field.          */
  #define NFCT_SLEEPSTATE_SLEEPSTATE_Min (0x0UL)     /*!< Min enumerator value of SLEEPSTATE field.                            */
  #define NFCT_SLEEPSTATE_SLEEPSTATE_Max (0x1UL)     /*!< Max enumerator value of SLEEPSTATE field.                            */
  #define NFCT_SLEEPSTATE_SLEEPSTATE_Idle (0x0UL)    /*!< State is IDLE.                                                       */
  #define NFCT_SLEEPSTATE_SLEEPSTATE_SleepA (0x1UL)  /*!< State is SLEEP_A.                                                    */


/* NFCT_FIELDPRESENT: Indicates the presence or not of a valid field */
  #define NFCT_FIELDPRESENT_ResetValue (0x00000000UL) /*!< Reset value of FIELDPRESENT register.                               */

/* FIELDPRESENT @Bit 0 : Indicates if a valid field is present. Available only in the activated state. */
  #define NFCT_FIELDPRESENT_FIELDPRESENT_Pos (0UL)   /*!< Position of FIELDPRESENT field.                                      */
  #define NFCT_FIELDPRESENT_FIELDPRESENT_Msk (0x1UL << NFCT_FIELDPRESENT_FIELDPRESENT_Pos) /*!< Bit mask of FIELDPRESENT field.*/
  #define NFCT_FIELDPRESENT_FIELDPRESENT_Min (0x0UL) /*!< Min enumerator value of FIELDPRESENT field.                          */
  #define NFCT_FIELDPRESENT_FIELDPRESENT_Max (0x1UL) /*!< Max enumerator value of FIELDPRESENT field.                          */
  #define NFCT_FIELDPRESENT_FIELDPRESENT_NoField (0x0UL) /*!< No valid field detected                                          */
  #define NFCT_FIELDPRESENT_FIELDPRESENT_FieldPresent (0x1UL) /*!< Valid field detected                                        */

/* LOCKDETECT @Bit 1 : Indicates if the low level has locked to the field */
  #define NFCT_FIELDPRESENT_LOCKDETECT_Pos (1UL)     /*!< Position of LOCKDETECT field.                                        */
  #define NFCT_FIELDPRESENT_LOCKDETECT_Msk (0x1UL << NFCT_FIELDPRESENT_LOCKDETECT_Pos) /*!< Bit mask of LOCKDETECT field.      */
  #define NFCT_FIELDPRESENT_LOCKDETECT_Min (0x0UL)   /*!< Min enumerator value of LOCKDETECT field.                            */
  #define NFCT_FIELDPRESENT_LOCKDETECT_Max (0x1UL)   /*!< Max enumerator value of LOCKDETECT field.                            */
  #define NFCT_FIELDPRESENT_LOCKDETECT_NotLocked (0x0UL) /*!< Not locked to field                                              */
  #define NFCT_FIELDPRESENT_LOCKDETECT_Locked (0x1UL) /*!< Locked to field                                                     */


/* NFCT_FRAMEDELAYMIN: Minimum frame delay */
  #define NFCT_FRAMEDELAYMIN_ResetValue (0x00000480UL) /*!< Reset value of FRAMEDELAYMIN register.                             */

/* FRAMEDELAYMIN @Bits 0..15 : Minimum frame delay in number of 13.56 MHz clock cycles */
  #define NFCT_FRAMEDELAYMIN_FRAMEDELAYMIN_Pos (0UL) /*!< Position of FRAMEDELAYMIN field.                                     */
  #define NFCT_FRAMEDELAYMIN_FRAMEDELAYMIN_Msk (0xFFFFUL << NFCT_FRAMEDELAYMIN_FRAMEDELAYMIN_Pos) /*!< Bit mask of FRAMEDELAYMIN
                                                                            field.*/


/* NFCT_FRAMEDELAYMAX: Maximum frame delay */
  #define NFCT_FRAMEDELAYMAX_ResetValue (0x00001000UL) /*!< Reset value of FRAMEDELAYMAX register.                             */

/* FRAMEDELAYMAX @Bits 0..19 : Maximum frame delay in number of 13.56 MHz clock cycles */
  #define NFCT_FRAMEDELAYMAX_FRAMEDELAYMAX_Pos (0UL) /*!< Position of FRAMEDELAYMAX field.                                     */
  #define NFCT_FRAMEDELAYMAX_FRAMEDELAYMAX_Msk (0xFFFFFUL << NFCT_FRAMEDELAYMAX_FRAMEDELAYMAX_Pos) /*!< Bit mask of
                                                                            FRAMEDELAYMAX field.*/


/* NFCT_FRAMEDELAYMODE: Configuration register for the Frame Delay Timer */
  #define NFCT_FRAMEDELAYMODE_ResetValue (0x00000001UL) /*!< Reset value of FRAMEDELAYMODE register.                           */

/* FRAMEDELAYMODE @Bits 0..1 : Configuration register for the Frame Delay Timer */
  #define NFCT_FRAMEDELAYMODE_FRAMEDELAYMODE_Pos (0UL) /*!< Position of FRAMEDELAYMODE field.                                  */
  #define NFCT_FRAMEDELAYMODE_FRAMEDELAYMODE_Msk (0x3UL << NFCT_FRAMEDELAYMODE_FRAMEDELAYMODE_Pos) /*!< Bit mask of
                                                                            FRAMEDELAYMODE field.*/
  #define NFCT_FRAMEDELAYMODE_FRAMEDELAYMODE_Min (0x0UL) /*!< Min enumerator value of FRAMEDELAYMODE field.                    */
  #define NFCT_FRAMEDELAYMODE_FRAMEDELAYMODE_Max (0x3UL) /*!< Max enumerator value of FRAMEDELAYMODE field.                    */
  #define NFCT_FRAMEDELAYMODE_FRAMEDELAYMODE_FreeRun (0x0UL) /*!< Transmission is independent of frame timer and will start when
                                                                  the STARTTX task is triggered. No timeout.*/
  #define NFCT_FRAMEDELAYMODE_FRAMEDELAYMODE_Window (0x1UL) /*!< Frame is transmitted between FRAMEDELAYMIN and FRAMEDELAYMAX  */
  #define NFCT_FRAMEDELAYMODE_FRAMEDELAYMODE_ExactVal (0x2UL) /*!< Frame is transmitted exactly at FRAMEDELAYMAX               */
  #define NFCT_FRAMEDELAYMODE_FRAMEDELAYMODE_WindowGrid (0x3UL) /*!< Frame is transmitted on a bit grid between FRAMEDELAYMIN
                                                                     and FRAMEDELAYMAX*/


/* NFCT_PACKETPTR: Packet pointer for TXD and RXD data storage in Data RAM */
  #define NFCT_PACKETPTR_ResetValue (0x00000000UL)   /*!< Reset value of PACKETPTR register.                                   */

