nrfconnect/sdk-hal_nordic/nrfx/mdk/nrf54l20_enga_types.h
/* PTR @Bits 0..31 : Packet pointer for TXD and RXD data storage in Data RAM. This address is a byte-aligned RAM address. */
  #define NFCT_PACKETPTR_PTR_Pos (0UL)               /*!< Position of PTR field.                                               */
  #define NFCT_PACKETPTR_PTR_Msk (0xFFFFFFFFUL << NFCT_PACKETPTR_PTR_Pos) /*!< Bit mask of PTR field.                          */


/* NFCT_MAXLEN: Size of the RAM buffer allocated to TXD and RXD data storage each */
  #define NFCT_MAXLEN_ResetValue (0x00000000UL)      /*!< Reset value of MAXLEN register.                                      */

/* MAXLEN @Bits 0..8 : Size of the RAM buffer allocated to TXD and RXD data storage each */
  #define NFCT_MAXLEN_MAXLEN_Pos (0UL)               /*!< Position of MAXLEN field.                                            */
  #define NFCT_MAXLEN_MAXLEN_Msk (0x1FFUL << NFCT_MAXLEN_MAXLEN_Pos) /*!< Bit mask of MAXLEN field.                            */
  #define NFCT_MAXLEN_MAXLEN_Min (0x000UL)           /*!< Min value of MAXLEN field.                                           */
  #define NFCT_MAXLEN_MAXLEN_Max (0x101UL)           /*!< Max size of MAXLEN field.                                            */


/* NFCT_MODULATIONCTRL: Enables the modulation output to a GPIO pin which can be connected to a second external antenna. */
  #define NFCT_MODULATIONCTRL_ResetValue (0x00000001UL) /*!< Reset value of MODULATIONCTRL register.                           */

/* MODULATIONCTRL @Bits 0..1 : Configuration of modulation control. */
  #define NFCT_MODULATIONCTRL_MODULATIONCTRL_Pos (0UL) /*!< Position of MODULATIONCTRL field.                                  */
  #define NFCT_MODULATIONCTRL_MODULATIONCTRL_Msk (0x3UL << NFCT_MODULATIONCTRL_MODULATIONCTRL_Pos) /*!< Bit mask of
                                                                            MODULATIONCTRL field.*/
  #define NFCT_MODULATIONCTRL_MODULATIONCTRL_Min (0x0UL) /*!< Min enumerator value of MODULATIONCTRL field.                    */
  #define NFCT_MODULATIONCTRL_MODULATIONCTRL_Max (0x3UL) /*!< Max enumerator value of MODULATIONCTRL field.                    */
  #define NFCT_MODULATIONCTRL_MODULATIONCTRL_Invalid (0x0UL) /*!< Invalid, defaults to same behaviour as for Internal          */
  #define NFCT_MODULATIONCTRL_MODULATIONCTRL_Internal (0x1UL) /*!< Use internal modulator only                                 */
  #define NFCT_MODULATIONCTRL_MODULATIONCTRL_ModToGpio (0x2UL) /*!< Output digital modulation signal to a GPIO pin.            */
  #define NFCT_MODULATIONCTRL_MODULATIONCTRL_InternalAndModToGpio (0x3UL) /*!< Use internal modulator and output digital
                                                                            modulation signal to a GPIO pin.*/


/* NFCT_MODULATIONPSEL: Pin select for Modulation control */
  #define NFCT_MODULATIONPSEL_ResetValue (0xFFFFFFFFUL) /*!< Reset value of MODULATIONPSEL register.                           */

/* PIN @Bits 0..4 : Pin number */
  #define NFCT_MODULATIONPSEL_PIN_Pos (0UL)          /*!< Position of PIN field.                                               */
  #define NFCT_MODULATIONPSEL_PIN_Msk (0x1FUL << NFCT_MODULATIONPSEL_PIN_Pos) /*!< Bit mask of PIN field.                      */
  #define NFCT_MODULATIONPSEL_PIN_Min (0x00UL)       /*!< Min value of PIN field.                                              */
  #define NFCT_MODULATIONPSEL_PIN_Max (0x1FUL)       /*!< Max size of PIN field.                                               */

/* PORT @Bits 5..6 : Port number */
  #define NFCT_MODULATIONPSEL_PORT_Pos (5UL)         /*!< Position of PORT field.                                              */
  #define NFCT_MODULATIONPSEL_PORT_Msk (0x3UL << NFCT_MODULATIONPSEL_PORT_Pos) /*!< Bit mask of PORT field.                    */
  #define NFCT_MODULATIONPSEL_PORT_Min (0x0UL)       /*!< Min value of PORT field.                                             */
  #define NFCT_MODULATIONPSEL_PORT_Max (0x3UL)       /*!< Max size of PORT field.                                              */

/* CONNECT @Bit 31 : Connection */
  #define NFCT_MODULATIONPSEL_CONNECT_Pos (31UL)     /*!< Position of CONNECT field.                                           */
  #define NFCT_MODULATIONPSEL_CONNECT_Msk (0x1UL << NFCT_MODULATIONPSEL_CONNECT_Pos) /*!< Bit mask of CONNECT field.           */
  #define NFCT_MODULATIONPSEL_CONNECT_Min (0x0UL)    /*!< Min enumerator value of CONNECT field.                               */
  #define NFCT_MODULATIONPSEL_CONNECT_Max (0x1UL)    /*!< Max enumerator value of CONNECT field.                               */
  #define NFCT_MODULATIONPSEL_CONNECT_Disconnected (0x1UL) /*!< Disconnect                                                     */
  #define NFCT_MODULATIONPSEL_CONNECT_Connected (0x0UL) /*!< Connect                                                           */


/* NFCT_MODE: Configure EasyDMA mode */
  #define NFCT_MODE_ResetValue (0x00000001UL)        /*!< Reset value of MODE register.                                        */

/* LPOP @Bits 0..1 : Enable low-power operation, or use low-latency */
  #define NFCT_MODE_LPOP_Pos (0UL)                   /*!< Position of LPOP field.                                              */
  #define NFCT_MODE_LPOP_Msk (0x3UL << NFCT_MODE_LPOP_Pos) /*!< Bit mask of LPOP field.                                        */
  #define NFCT_MODE_LPOP_Min (0x0UL)                 /*!< Min enumerator value of LPOP field.                                  */
  #define NFCT_MODE_LPOP_Max (0x3UL)                 /*!< Max enumerator value of LPOP field.                                  */
  #define NFCT_MODE_LPOP_LowLat (0x0UL)              /*!< Low-latency operation                                                */
  #define NFCT_MODE_LPOP_LowPower (0x1UL)            /*!< Low-power operation                                                  */
  #define NFCT_MODE_LPOP_FullLowPower (0x3UL)        /*!< Full Low-power operation                                             */


/* NFCT_AUTOCOLRESCONFIG: Controls the auto collision resolution function. This setting must be done before the NFCT peripheral
                           is activated. */

  #define NFCT_AUTOCOLRESCONFIG_ResetValue (0x00000002UL) /*!< Reset value of AUTOCOLRESCONFIG register.                       */

