nrfconnect/sdk-hal_nordic/nrfx/mdk/nrf54l20_enga_types.h
/* OPERATION @Bit 0 : Mono or stereo operation */
  #define PDM_MODE_OPERATION_Pos (0UL)               /*!< Position of OPERATION field.                                         */
  #define PDM_MODE_OPERATION_Msk (0x1UL << PDM_MODE_OPERATION_Pos) /*!< Bit mask of OPERATION field.                           */
  #define PDM_MODE_OPERATION_Min (0x0UL)             /*!< Min enumerator value of OPERATION field.                             */
  #define PDM_MODE_OPERATION_Max (0x1UL)             /*!< Max enumerator value of OPERATION field.                             */
  #define PDM_MODE_OPERATION_Stereo (0x0UL)          /*!< Sample and store one pair (left + right) of 16-bit samples per RAM
                                                          word R=[31:16]; L=[15:0]*/
  #define PDM_MODE_OPERATION_Mono (0x1UL)            /*!< Sample and store two successive left samples (16 bits each) per RAM
                                                          word L1=[31:16]; L0=[15:0]*/

/* EDGE @Bit 1 : Defines on which PDM_CLK edge left (or mono) is sampled. */
  #define PDM_MODE_EDGE_Pos (1UL)                    /*!< Position of EDGE field.                                              */
  #define PDM_MODE_EDGE_Msk (0x1UL << PDM_MODE_EDGE_Pos) /*!< Bit mask of EDGE field.                                          */
  #define PDM_MODE_EDGE_Min (0x0UL)                  /*!< Min enumerator value of EDGE field.                                  */
  #define PDM_MODE_EDGE_Max (0x1UL)                  /*!< Max enumerator value of EDGE field.                                  */
  #define PDM_MODE_EDGE_LeftFalling (0x0UL)          /*!< Left (or mono) is sampled on falling edge of PDM_CLK                 */
  #define PDM_MODE_EDGE_LeftRising (0x1UL)           /*!< Left (or mono) is sampled on rising edge of PDM_CLK                  */


/* PDM_GAINL: Left output gain adjustment */
  #define PDM_GAINL_ResetValue (0x00000028UL)        /*!< Reset value of GAINL register.                                       */

/* GAINL @Bits 0..6 : Left output gain adjustment, in 0.5 dB steps, around the default module gain (see electrical parameters)
                      0x00 -20 dB gain adjust 0x01 -19.5 dB gain adjust (...) 0x27 -0.5 dB gain adjust 0x28 0 dB gain adjust
                      0x29 +0.5 dB gain adjust (...) 0x4F +19.5 dB gain adjust 0x50 +20 dB gain adjust */

  #define PDM_GAINL_GAINL_Pos (0UL)                  /*!< Position of GAINL field.                                             */
  #define PDM_GAINL_GAINL_Msk (0x7FUL << PDM_GAINL_GAINL_Pos) /*!< Bit mask of GAINL field.                                    */
  #define PDM_GAINL_GAINL_Min (0x0UL)                /*!< Min enumerator value of GAINL field.                                 */
  #define PDM_GAINL_GAINL_Max (0x50UL)               /*!< Max enumerator value of GAINL field.                                 */
  #define PDM_GAINL_GAINL_MinGain (0x00UL)           /*!< -20 dB gain adjustment (minimum)                                     */
  #define PDM_GAINL_GAINL_DefaultGain (0x28UL)       /*!< 0 dB gain adjustment                                                 */
  #define PDM_GAINL_GAINL_MaxGain (0x50UL)           /*!< +20 dB gain adjustment (maximum)                                     */


/* PDM_GAINR: Right output gain adjustment */
  #define PDM_GAINR_ResetValue (0x00000028UL)        /*!< Reset value of GAINR register.                                       */

/* GAINR @Bits 0..6 : Right output gain adjustment, in 0.5 dB steps, around the default module gain (see electrical parameters)
                      */

  #define PDM_GAINR_GAINR_Pos (0UL)                  /*!< Position of GAINR field.                                             */
  #define PDM_GAINR_GAINR_Msk (0x7FUL << PDM_GAINR_GAINR_Pos) /*!< Bit mask of GAINR field.                                    */
  #define PDM_GAINR_GAINR_Min (0x0UL)                /*!< Min enumerator value of GAINR field.                                 */
  #define PDM_GAINR_GAINR_Max (0x50UL)               /*!< Max enumerator value of GAINR field.                                 */
  #define PDM_GAINR_GAINR_MinGain (0x00UL)           /*!< -20 dB gain adjustment (minimum)                                     */
  #define PDM_GAINR_GAINR_DefaultGain (0x28UL)       /*!< 0 dB gain adjustment                                                 */
  #define PDM_GAINR_GAINR_MaxGain (0x50UL)           /*!< +20 dB gain adjustment (maximum)                                     */


/* PDM_RATIO: Selects the decimation ratio between PDM_CLK and output sample rate. Change PRESCALER accordingly. */
  #define PDM_RATIO_ResetValue (0x00000002UL)        /*!< Reset value of RATIO register.                                       */

/* RATIO @Bits 0..2 : Selects the decimation ratio between PDM_CLK and output sample rate */
  #define PDM_RATIO_RATIO_Pos (0UL)                  /*!< Position of RATIO field.                                             */
  #define PDM_RATIO_RATIO_Msk (0x7UL << PDM_RATIO_RATIO_Pos) /*!< Bit mask of RATIO field.                                     */
  #define PDM_RATIO_RATIO_Min (0x0UL)                /*!< Min enumerator value of RATIO field.                                 */
  #define PDM_RATIO_RATIO_Max (0x7UL)                /*!< Max enumerator value of RATIO field.                                 */
  #define PDM_RATIO_RATIO_Ratio32 (0x0UL)            /*!< Ratio of 32                                                          */
  #define PDM_RATIO_RATIO_Ratio48 (0x1UL)            /*!< Ratio of 48                                                          */
  #define PDM_RATIO_RATIO_Ratio50 (0x2UL)            /*!< Ratio of 50                                                          */
  #define PDM_RATIO_RATIO_Ratio64 (0x3UL)            /*!< Ratio of 64                                                          */
  #define PDM_RATIO_RATIO_Ratio80 (0x4UL)            /*!< Ratio of 80                                                          */
  #define PDM_RATIO_RATIO_Ratio96 (0x5UL)            /*!< Ratio of 96                                                          */
  #define PDM_RATIO_RATIO_Ratio100 (0x6UL)           /*!< Ratio of 100                                                         */
  #define PDM_RATIO_RATIO_Ratio128 (0x7UL)           /*!< Ratio of 128                                                         */


/* PDM_PRESCALER: The prescaler is used to set the PDM frequency */
  #define PDM_PRESCALER_ResetValue (0x00000004UL)    /*!< Reset value of PRESCALER register.                                   */

/* DIVISOR @Bits 0..31 : Core clock to PDM divisor */
  #define PDM_PRESCALER_DIVISOR_Pos (0UL)            /*!< Position of DIVISOR field.                                           */
  #define PDM_PRESCALER_DIVISOR_Msk (0xFFFFFFFFUL << PDM_PRESCALER_DIVISOR_Pos) /*!< Bit mask of DIVISOR field.                */
  #define PDM_PRESCALER_DIVISOR_Min (0x00000004UL)   /*!< Min value of DIVISOR field.                                          */
  #define PDM_PRESCALER_DIVISOR_Max (0x0000007EUL)   /*!< Max size of DIVISOR field.                                           */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           POWER                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ====================================================== Struct POWER ======================================================= */
/**
  * @brief Power control
  */
  typedef struct {                                   /*!< POWER Structure                                                      */
    __IM uint32_t RESERVED[12];
    __OM uint32_t TASKS_CONSTLAT;                    /*!< (@ 0x00000030) Enable Constant Latency mode                          */
    __OM uint32_t TASKS_LOWPWR;                      /*!< (@ 0x00000034) Enable Low-power mode (variable latency)              */
    __IM uint32_t RESERVED1[30];
    __IOM uint32_t SUBSCRIBE_CONSTLAT;               /*!< (@ 0x000000B0) Subscribe configuration for task CONSTLAT             */
    __IOM uint32_t SUBSCRIBE_LOWPWR;                 /*!< (@ 0x000000B4) Subscribe configuration for task LOWPWR               */
    __IM uint32_t RESERVED2[30];
    __IOM uint32_t EVENTS_POFWARN;                   /*!< (@ 0x00000130) Power failure warning                                 */
    __IOM uint32_t EVENTS_SLEEPENTER;                /*!< (@ 0x00000134) CPU entered WFI/WFE sleep                             */
    __IOM uint32_t EVENTS_SLEEPEXIT;                 /*!< (@ 0x00000138) CPU exited WFI/WFE sleep                              */
    __IM uint32_t RESERVED3[29];
    __IOM uint32_t PUBLISH_POFWARN;                  /*!< (@ 0x000001B0) Publish configuration for event POFWARN               */
    __IOM uint32_t PUBLISH_SLEEPENTER;               /*!< (@ 0x000001B4) Publish configuration for event SLEEPENTER            */
    __IOM uint32_t PUBLISH_SLEEPEXIT;                /*!< (@ 0x000001B8) Publish configuration for event SLEEPEXIT             */
    __IM uint32_t RESERVED4[81];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t RESERVED5[125];
    __IOM uint32_t GPREGRET[2];                      /*!< (@ 0x00000500) General purpose retention register                    */
    __IM uint32_t RESERVED6[2];
    __IM uint32_t CONSTLATSTAT;                      /*!< (@ 0x00000510) Status of constant latency                            */
  } NRF_POWER_Type;                                  /*!< Size = 1300 (0x514)                                                  */

/* POWER_TASKS_CONSTLAT: Enable Constant Latency mode */
  #define POWER_TASKS_CONSTLAT_ResetValue (0x00000000UL) /*!< Reset value of TASKS_CONSTLAT register.                          */

/* TASKS_CONSTLAT @Bit 0 : Enable Constant Latency mode */
  #define POWER_TASKS_CONSTLAT_TASKS_CONSTLAT_Pos (0UL) /*!< Position of TASKS_CONSTLAT field.                                 */
  #define POWER_TASKS_CONSTLAT_TASKS_CONSTLAT_Msk (0x1UL << POWER_TASKS_CONSTLAT_TASKS_CONSTLAT_Pos) /*!< Bit mask of
                                                                            TASKS_CONSTLAT field.*/
  #define POWER_TASKS_CONSTLAT_TASKS_CONSTLAT_Min (0x1UL) /*!< Min enumerator value of TASKS_CONSTLAT field.                   */
  #define POWER_TASKS_CONSTLAT_TASKS_CONSTLAT_Max (0x1UL) /*!< Max enumerator value of TASKS_CONSTLAT field.                   */
  #define POWER_TASKS_CONSTLAT_TASKS_CONSTLAT_Trigger (0x1UL) /*!< Trigger task                                                */


