nrfconnect/sdk-hal_nordic/nrfx/mdk/nrf54l20_enga_types.h
/* POWER_EVENTS_SLEEPEXIT: CPU exited WFI/WFE sleep */
  #define POWER_EVENTS_SLEEPEXIT_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_SLEEPEXIT register.                      */

/* EVENTS_SLEEPEXIT @Bit 0 : CPU exited WFI/WFE sleep */
  #define POWER_EVENTS_SLEEPEXIT_EVENTS_SLEEPEXIT_Pos (0UL) /*!< Position of EVENTS_SLEEPEXIT field.                           */
  #define POWER_EVENTS_SLEEPEXIT_EVENTS_SLEEPEXIT_Msk (0x1UL << POWER_EVENTS_SLEEPEXIT_EVENTS_SLEEPEXIT_Pos) /*!< Bit mask of
                                                                            EVENTS_SLEEPEXIT field.*/
  #define POWER_EVENTS_SLEEPEXIT_EVENTS_SLEEPEXIT_Min (0x0UL) /*!< Min enumerator value of EVENTS_SLEEPEXIT field.             */
  #define POWER_EVENTS_SLEEPEXIT_EVENTS_SLEEPEXIT_Max (0x1UL) /*!< Max enumerator value of EVENTS_SLEEPEXIT field.             */
  #define POWER_EVENTS_SLEEPEXIT_EVENTS_SLEEPEXIT_NotGenerated (0x0UL) /*!< Event not generated                                */
  #define POWER_EVENTS_SLEEPEXIT_EVENTS_SLEEPEXIT_Generated (0x1UL) /*!< Event generated                                       */


/* POWER_PUBLISH_POFWARN: Publish configuration for event POFWARN */
  #define POWER_PUBLISH_POFWARN_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_POFWARN register.                        */

/* CHIDX @Bits 0..7 : DPPI channel that event POFWARN will publish to */
  #define POWER_PUBLISH_POFWARN_CHIDX_Pos (0UL)      /*!< Position of CHIDX field.                                             */
  #define POWER_PUBLISH_POFWARN_CHIDX_Msk (0xFFUL << POWER_PUBLISH_POFWARN_CHIDX_Pos) /*!< Bit mask of CHIDX field.            */
  #define POWER_PUBLISH_POFWARN_CHIDX_Min (0x00UL)   /*!< Min value of CHIDX field.                                            */
  #define POWER_PUBLISH_POFWARN_CHIDX_Max (0xFFUL)   /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define POWER_PUBLISH_POFWARN_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define POWER_PUBLISH_POFWARN_EN_Msk (0x1UL << POWER_PUBLISH_POFWARN_EN_Pos) /*!< Bit mask of EN field.                      */
  #define POWER_PUBLISH_POFWARN_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define POWER_PUBLISH_POFWARN_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define POWER_PUBLISH_POFWARN_EN_Disabled (0x0UL)  /*!< Disable publishing                                                   */
  #define POWER_PUBLISH_POFWARN_EN_Enabled (0x1UL)   /*!< Enable publishing                                                    */


/* POWER_PUBLISH_SLEEPENTER: Publish configuration for event SLEEPENTER */
  #define POWER_PUBLISH_SLEEPENTER_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_SLEEPENTER register.                  */

/* CHIDX @Bits 0..7 : DPPI channel that event SLEEPENTER will publish to */
  #define POWER_PUBLISH_SLEEPENTER_CHIDX_Pos (0UL)   /*!< Position of CHIDX field.                                             */
  #define POWER_PUBLISH_SLEEPENTER_CHIDX_Msk (0xFFUL << POWER_PUBLISH_SLEEPENTER_CHIDX_Pos) /*!< Bit mask of CHIDX field.      */
  #define POWER_PUBLISH_SLEEPENTER_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                           */
  #define POWER_PUBLISH_SLEEPENTER_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                            */

/* EN @Bit 31 : (unspecified) */
  #define POWER_PUBLISH_SLEEPENTER_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define POWER_PUBLISH_SLEEPENTER_EN_Msk (0x1UL << POWER_PUBLISH_SLEEPENTER_EN_Pos) /*!< Bit mask of EN field.                */
  #define POWER_PUBLISH_SLEEPENTER_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define POWER_PUBLISH_SLEEPENTER_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define POWER_PUBLISH_SLEEPENTER_EN_Disabled (0x0UL) /*!< Disable publishing                                                 */
  #define POWER_PUBLISH_SLEEPENTER_EN_Enabled (0x1UL) /*!< Enable publishing                                                   */


/* POWER_PUBLISH_SLEEPEXIT: Publish configuration for event SLEEPEXIT */
  #define POWER_PUBLISH_SLEEPEXIT_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_SLEEPEXIT register.                    */

/* CHIDX @Bits 0..7 : DPPI channel that event SLEEPEXIT will publish to */
  #define POWER_PUBLISH_SLEEPEXIT_CHIDX_Pos (0UL)    /*!< Position of CHIDX field.                                             */
  #define POWER_PUBLISH_SLEEPEXIT_CHIDX_Msk (0xFFUL << POWER_PUBLISH_SLEEPEXIT_CHIDX_Pos) /*!< Bit mask of CHIDX field.        */
  #define POWER_PUBLISH_SLEEPEXIT_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                            */
  #define POWER_PUBLISH_SLEEPEXIT_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define POWER_PUBLISH_SLEEPEXIT_EN_Pos (31UL)      /*!< Position of EN field.                                                */
  #define POWER_PUBLISH_SLEEPEXIT_EN_Msk (0x1UL << POWER_PUBLISH_SLEEPEXIT_EN_Pos) /*!< Bit mask of EN field.                  */
  #define POWER_PUBLISH_SLEEPEXIT_EN_Min (0x0UL)     /*!< Min enumerator value of EN field.                                    */
  #define POWER_PUBLISH_SLEEPEXIT_EN_Max (0x1UL)     /*!< Max enumerator value of EN field.                                    */
  #define POWER_PUBLISH_SLEEPEXIT_EN_Disabled (0x0UL) /*!< Disable publishing                                                  */
  #define POWER_PUBLISH_SLEEPEXIT_EN_Enabled (0x1UL) /*!< Enable publishing                                                    */


/* POWER_INTEN: Enable or disable interrupt */
  #define POWER_INTEN_ResetValue (0x00000000UL)      /*!< Reset value of INTEN register.                                       */

/* POFWARN @Bit 12 : Enable or disable interrupt for event POFWARN */
  #define POWER_INTEN_POFWARN_Pos (12UL)             /*!< Position of POFWARN field.                                           */
  #define POWER_INTEN_POFWARN_Msk (0x1UL << POWER_INTEN_POFWARN_Pos) /*!< Bit mask of POFWARN field.                           */
  #define POWER_INTEN_POFWARN_Min (0x0UL)            /*!< Min enumerator value of POFWARN field.                               */
  #define POWER_INTEN_POFWARN_Max (0x1UL)            /*!< Max enumerator value of POFWARN field.                               */
  #define POWER_INTEN_POFWARN_Disabled (0x0UL)       /*!< Disable                                                              */
  #define POWER_INTEN_POFWARN_Enabled (0x1UL)        /*!< Enable                                                               */

/* SLEEPENTER @Bit 13 : Enable or disable interrupt for event SLEEPENTER */
  #define POWER_INTEN_SLEEPENTER_Pos (13UL)          /*!< Position of SLEEPENTER field.                                        */
  #define POWER_INTEN_SLEEPENTER_Msk (0x1UL << POWER_INTEN_SLEEPENTER_Pos) /*!< Bit mask of SLEEPENTER field.                  */
  #define POWER_INTEN_SLEEPENTER_Min (0x0UL)         /*!< Min enumerator value of SLEEPENTER field.                            */
  #define POWER_INTEN_SLEEPENTER_Max (0x1UL)         /*!< Max enumerator value of SLEEPENTER field.                            */
  #define POWER_INTEN_SLEEPENTER_Disabled (0x0UL)    /*!< Disable                                                              */
  #define POWER_INTEN_SLEEPENTER_Enabled (0x1UL)     /*!< Enable                                                               */

/* SLEEPEXIT @Bit 14 : Enable or disable interrupt for event SLEEPEXIT */
  #define POWER_INTEN_SLEEPEXIT_Pos (14UL)           /*!< Position of SLEEPEXIT field.                                         */
  #define POWER_INTEN_SLEEPEXIT_Msk (0x1UL << POWER_INTEN_SLEEPEXIT_Pos) /*!< Bit mask of SLEEPEXIT field.                     */
  #define POWER_INTEN_SLEEPEXIT_Min (0x0UL)          /*!< Min enumerator value of SLEEPEXIT field.                             */
  #define POWER_INTEN_SLEEPEXIT_Max (0x1UL)          /*!< Max enumerator value of SLEEPEXIT field.                             */
  #define POWER_INTEN_SLEEPEXIT_Disabled (0x0UL)     /*!< Disable                                                              */
  #define POWER_INTEN_SLEEPEXIT_Enabled (0x1UL)      /*!< Enable                                                               */


/* POWER_INTENSET: Enable interrupt */
  #define POWER_INTENSET_ResetValue (0x00000000UL)   /*!< Reset value of INTENSET register.                                    */

/* POFWARN @Bit 12 : Write '1' to enable interrupt for event POFWARN */
  #define POWER_INTENSET_POFWARN_Pos (12UL)          /*!< Position of POFWARN field.                                           */
  #define POWER_INTENSET_POFWARN_Msk (0x1UL << POWER_INTENSET_POFWARN_Pos) /*!< Bit mask of POFWARN field.                     */
  #define POWER_INTENSET_POFWARN_Min (0x0UL)         /*!< Min enumerator value of POFWARN field.                               */
  #define POWER_INTENSET_POFWARN_Max (0x1UL)         /*!< Max enumerator value of POFWARN field.                               */
  #define POWER_INTENSET_POFWARN_Set (0x1UL)         /*!< Enable                                                               */
  #define POWER_INTENSET_POFWARN_Disabled (0x0UL)    /*!< Read: Disabled                                                       */
  #define POWER_INTENSET_POFWARN_Enabled (0x1UL)     /*!< Read: Enabled                                                        */

/* SLEEPENTER @Bit 13 : Write '1' to enable interrupt for event SLEEPENTER */
  #define POWER_INTENSET_SLEEPENTER_Pos (13UL)       /*!< Position of SLEEPENTER field.                                        */
  #define POWER_INTENSET_SLEEPENTER_Msk (0x1UL << POWER_INTENSET_SLEEPENTER_Pos) /*!< Bit mask of SLEEPENTER field.            */
  #define POWER_INTENSET_SLEEPENTER_Min (0x0UL)      /*!< Min enumerator value of SLEEPENTER field.                            */
  #define POWER_INTENSET_SLEEPENTER_Max (0x1UL)      /*!< Max enumerator value of SLEEPENTER field.                            */
  #define POWER_INTENSET_SLEEPENTER_Set (0x1UL)      /*!< Enable                                                               */
  #define POWER_INTENSET_SLEEPENTER_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define POWER_INTENSET_SLEEPENTER_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* SLEEPEXIT @Bit 14 : Write '1' to enable interrupt for event SLEEPEXIT */
  #define POWER_INTENSET_SLEEPEXIT_Pos (14UL)        /*!< Position of SLEEPEXIT field.                                         */
  #define POWER_INTENSET_SLEEPEXIT_Msk (0x1UL << POWER_INTENSET_SLEEPEXIT_Pos) /*!< Bit mask of SLEEPEXIT field.               */
  #define POWER_INTENSET_SLEEPEXIT_Min (0x0UL)       /*!< Min enumerator value of SLEEPEXIT field.                             */
  #define POWER_INTENSET_SLEEPEXIT_Max (0x1UL)       /*!< Max enumerator value of SLEEPEXIT field.                             */
  #define POWER_INTENSET_SLEEPEXIT_Set (0x1UL)       /*!< Enable                                                               */
  #define POWER_INTENSET_SLEEPEXIT_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define POWER_INTENSET_SLEEPEXIT_Enabled (0x1UL)   /*!< Read: Enabled                                                        */


