nrfconnect/sdk-hal_nordic/nrfx/mdk/nrf54l20_enga_types.h
/* ADDRESS_RSSISTART @Bit 4 : Shortcut between event ADDRESS and task RSSISTART */
  #define RADIO_SHORTS_ADDRESS_RSSISTART_Pos (4UL)   /*!< Position of ADDRESS_RSSISTART field.                                 */
  #define RADIO_SHORTS_ADDRESS_RSSISTART_Msk (0x1UL << RADIO_SHORTS_ADDRESS_RSSISTART_Pos) /*!< Bit mask of ADDRESS_RSSISTART
                                                                            field.*/
  #define RADIO_SHORTS_ADDRESS_RSSISTART_Min (0x0UL) /*!< Min enumerator value of ADDRESS_RSSISTART field.                     */
  #define RADIO_SHORTS_ADDRESS_RSSISTART_Max (0x1UL) /*!< Max enumerator value of ADDRESS_RSSISTART field.                     */
  #define RADIO_SHORTS_ADDRESS_RSSISTART_Disabled (0x0UL) /*!< Disable shortcut                                                */
  #define RADIO_SHORTS_ADDRESS_RSSISTART_Enabled (0x1UL) /*!< Enable shortcut                                                  */

/* END_START @Bit 5 : Shortcut between event END and task START */
  #define RADIO_SHORTS_END_START_Pos (5UL)           /*!< Position of END_START field.                                         */
  #define RADIO_SHORTS_END_START_Msk (0x1UL << RADIO_SHORTS_END_START_Pos) /*!< Bit mask of END_START field.                   */
  #define RADIO_SHORTS_END_START_Min (0x0UL)         /*!< Min enumerator value of END_START field.                             */
  #define RADIO_SHORTS_END_START_Max (0x1UL)         /*!< Max enumerator value of END_START field.                             */
  #define RADIO_SHORTS_END_START_Disabled (0x0UL)    /*!< Disable shortcut                                                     */
  #define RADIO_SHORTS_END_START_Enabled (0x1UL)     /*!< Enable shortcut                                                      */

/* ADDRESS_BCSTART @Bit 6 : Shortcut between event ADDRESS and task BCSTART */
  #define RADIO_SHORTS_ADDRESS_BCSTART_Pos (6UL)     /*!< Position of ADDRESS_BCSTART field.                                   */
  #define RADIO_SHORTS_ADDRESS_BCSTART_Msk (0x1UL << RADIO_SHORTS_ADDRESS_BCSTART_Pos) /*!< Bit mask of ADDRESS_BCSTART field. */
  #define RADIO_SHORTS_ADDRESS_BCSTART_Min (0x0UL)   /*!< Min enumerator value of ADDRESS_BCSTART field.                       */
  #define RADIO_SHORTS_ADDRESS_BCSTART_Max (0x1UL)   /*!< Max enumerator value of ADDRESS_BCSTART field.                       */
  #define RADIO_SHORTS_ADDRESS_BCSTART_Disabled (0x0UL) /*!< Disable shortcut                                                  */
  #define RADIO_SHORTS_ADDRESS_BCSTART_Enabled (0x1UL) /*!< Enable shortcut                                                    */

/* RXREADY_CCASTART @Bit 10 : Shortcut between event RXREADY and task CCASTART */
  #define RADIO_SHORTS_RXREADY_CCASTART_Pos (10UL)   /*!< Position of RXREADY_CCASTART field.                                  */
  #define RADIO_SHORTS_RXREADY_CCASTART_Msk (0x1UL << RADIO_SHORTS_RXREADY_CCASTART_Pos) /*!< Bit mask of RXREADY_CCASTART
                                                                            field.*/
  #define RADIO_SHORTS_RXREADY_CCASTART_Min (0x0UL)  /*!< Min enumerator value of RXREADY_CCASTART field.                      */
  #define RADIO_SHORTS_RXREADY_CCASTART_Max (0x1UL)  /*!< Max enumerator value of RXREADY_CCASTART field.                      */
  #define RADIO_SHORTS_RXREADY_CCASTART_Disabled (0x0UL) /*!< Disable shortcut                                                 */
  #define RADIO_SHORTS_RXREADY_CCASTART_Enabled (0x1UL) /*!< Enable shortcut                                                   */

/* CCAIDLE_TXEN @Bit 11 : Shortcut between event CCAIDLE and task TXEN */
  #define RADIO_SHORTS_CCAIDLE_TXEN_Pos (11UL)       /*!< Position of CCAIDLE_TXEN field.                                      */
  #define RADIO_SHORTS_CCAIDLE_TXEN_Msk (0x1UL << RADIO_SHORTS_CCAIDLE_TXEN_Pos) /*!< Bit mask of CCAIDLE_TXEN field.          */
  #define RADIO_SHORTS_CCAIDLE_TXEN_Min (0x0UL)      /*!< Min enumerator value of CCAIDLE_TXEN field.                          */
  #define RADIO_SHORTS_CCAIDLE_TXEN_Max (0x1UL)      /*!< Max enumerator value of CCAIDLE_TXEN field.                          */
  #define RADIO_SHORTS_CCAIDLE_TXEN_Disabled (0x0UL) /*!< Disable shortcut                                                     */
  #define RADIO_SHORTS_CCAIDLE_TXEN_Enabled (0x1UL)  /*!< Enable shortcut                                                      */

/* CCABUSY_DISABLE @Bit 12 : Shortcut between event CCABUSY and task DISABLE */
  #define RADIO_SHORTS_CCABUSY_DISABLE_Pos (12UL)    /*!< Position of CCABUSY_DISABLE field.                                   */
  #define RADIO_SHORTS_CCABUSY_DISABLE_Msk (0x1UL << RADIO_SHORTS_CCABUSY_DISABLE_Pos) /*!< Bit mask of CCABUSY_DISABLE field. */
  #define RADIO_SHORTS_CCABUSY_DISABLE_Min (0x0UL)   /*!< Min enumerator value of CCABUSY_DISABLE field.                       */
  #define RADIO_SHORTS_CCABUSY_DISABLE_Max (0x1UL)   /*!< Max enumerator value of CCABUSY_DISABLE field.                       */
  #define RADIO_SHORTS_CCABUSY_DISABLE_Disabled (0x0UL) /*!< Disable shortcut                                                  */
  #define RADIO_SHORTS_CCABUSY_DISABLE_Enabled (0x1UL) /*!< Enable shortcut                                                    */

/* FRAMESTART_BCSTART @Bit 13 : Shortcut between event FRAMESTART and task BCSTART */
  #define RADIO_SHORTS_FRAMESTART_BCSTART_Pos (13UL) /*!< Position of FRAMESTART_BCSTART field.                                */
  #define RADIO_SHORTS_FRAMESTART_BCSTART_Msk (0x1UL << RADIO_SHORTS_FRAMESTART_BCSTART_Pos) /*!< Bit mask of FRAMESTART_BCSTART
                                                                            field.*/
  #define RADIO_SHORTS_FRAMESTART_BCSTART_Min (0x0UL) /*!< Min enumerator value of FRAMESTART_BCSTART field.                   */
  #define RADIO_SHORTS_FRAMESTART_BCSTART_Max (0x1UL) /*!< Max enumerator value of FRAMESTART_BCSTART field.                   */
  #define RADIO_SHORTS_FRAMESTART_BCSTART_Disabled (0x0UL) /*!< Disable shortcut                                               */
  #define RADIO_SHORTS_FRAMESTART_BCSTART_Enabled (0x1UL) /*!< Enable shortcut                                                 */

