nrfconnect/sdk-hal_nordic/nrfx/mdk/nrf54l20_enga_types.h
/* EVENTS_ACCESSERROR @Bit 0 : RRAM access error */
  #define RRAMC_EVENTS_ACCESSERROR_EVENTS_ACCESSERROR_Pos (0UL) /*!< Position of EVENTS_ACCESSERROR field.                     */
  #define RRAMC_EVENTS_ACCESSERROR_EVENTS_ACCESSERROR_Msk (0x1UL << RRAMC_EVENTS_ACCESSERROR_EVENTS_ACCESSERROR_Pos) /*!< Bit
                                                                            mask of EVENTS_ACCESSERROR field.*/
  #define RRAMC_EVENTS_ACCESSERROR_EVENTS_ACCESSERROR_Min (0x0UL) /*!< Min enumerator value of EVENTS_ACCESSERROR field.       */
  #define RRAMC_EVENTS_ACCESSERROR_EVENTS_ACCESSERROR_Max (0x1UL) /*!< Max enumerator value of EVENTS_ACCESSERROR field.       */
  #define RRAMC_EVENTS_ACCESSERROR_EVENTS_ACCESSERROR_NotGenerated (0x0UL) /*!< Event not generated                            */
  #define RRAMC_EVENTS_ACCESSERROR_EVENTS_ACCESSERROR_Generated (0x1UL) /*!< Event generated                                   */


/* RRAMC_EVENTS_ECCERROR: Uncorrectable ECC error detected */
  #define RRAMC_EVENTS_ECCERROR_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_ECCERROR register.                        */

/* EVENTS_ECCERROR @Bit 0 : Uncorrectable ECC error detected */
  #define RRAMC_EVENTS_ECCERROR_EVENTS_ECCERROR_Pos (0UL) /*!< Position of EVENTS_ECCERROR field.                              */
  #define RRAMC_EVENTS_ECCERROR_EVENTS_ECCERROR_Msk (0x1UL << RRAMC_EVENTS_ECCERROR_EVENTS_ECCERROR_Pos) /*!< Bit mask of
                                                                            EVENTS_ECCERROR field.*/
  #define RRAMC_EVENTS_ECCERROR_EVENTS_ECCERROR_Min (0x0UL) /*!< Min enumerator value of EVENTS_ECCERROR field.                */
  #define RRAMC_EVENTS_ECCERROR_EVENTS_ECCERROR_Max (0x1UL) /*!< Max enumerator value of EVENTS_ECCERROR field.                */
  #define RRAMC_EVENTS_ECCERROR_EVENTS_ECCERROR_NotGenerated (0x0UL) /*!< Event not generated                                  */
  #define RRAMC_EVENTS_ECCERROR_EVENTS_ECCERROR_Generated (0x1UL) /*!< Event generated                                         */


/* RRAMC_PUBLISH_WOKENUP: Publish configuration for event WOKENUP */
  #define RRAMC_PUBLISH_WOKENUP_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_WOKENUP register.                        */

/* CHIDX @Bits 0..7 : DPPI channel that event WOKENUP will publish to */
  #define RRAMC_PUBLISH_WOKENUP_CHIDX_Pos (0UL)      /*!< Position of CHIDX field.                                             */
  #define RRAMC_PUBLISH_WOKENUP_CHIDX_Msk (0xFFUL << RRAMC_PUBLISH_WOKENUP_CHIDX_Pos) /*!< Bit mask of CHIDX field.            */
  #define RRAMC_PUBLISH_WOKENUP_CHIDX_Min (0x00UL)   /*!< Min value of CHIDX field.                                            */
  #define RRAMC_PUBLISH_WOKENUP_CHIDX_Max (0xFFUL)   /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define RRAMC_PUBLISH_WOKENUP_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define RRAMC_PUBLISH_WOKENUP_EN_Msk (0x1UL << RRAMC_PUBLISH_WOKENUP_EN_Pos) /*!< Bit mask of EN field.                      */
  #define RRAMC_PUBLISH_WOKENUP_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define RRAMC_PUBLISH_WOKENUP_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define RRAMC_PUBLISH_WOKENUP_EN_Disabled (0x0UL)  /*!< Disable publishing                                                   */
  #define RRAMC_PUBLISH_WOKENUP_EN_Enabled (0x1UL)   /*!< Enable publishing                                                    */


/* RRAMC_INTEN: Enable or disable interrupt */
  #define RRAMC_INTEN_ResetValue (0x00000000UL)      /*!< Reset value of INTEN register.                                       */

/* WOKENUP @Bit 0 : Enable or disable interrupt for event WOKENUP */
  #define RRAMC_INTEN_WOKENUP_Pos (0UL)              /*!< Position of WOKENUP field.                                           */
  #define RRAMC_INTEN_WOKENUP_Msk (0x1UL << RRAMC_INTEN_WOKENUP_Pos) /*!< Bit mask of WOKENUP field.                           */
  #define RRAMC_INTEN_WOKENUP_Min (0x0UL)            /*!< Min enumerator value of WOKENUP field.                               */
  #define RRAMC_INTEN_WOKENUP_Max (0x1UL)            /*!< Max enumerator value of WOKENUP field.                               */
  #define RRAMC_INTEN_WOKENUP_Disabled (0x0UL)       /*!< Disable                                                              */
  #define RRAMC_INTEN_WOKENUP_Enabled (0x1UL)        /*!< Enable                                                               */

/* READY @Bit 1 : Enable or disable interrupt for event READY */
  #define RRAMC_INTEN_READY_Pos (1UL)                /*!< Position of READY field.                                             */
  #define RRAMC_INTEN_READY_Msk (0x1UL << RRAMC_INTEN_READY_Pos) /*!< Bit mask of READY field.                                 */
  #define RRAMC_INTEN_READY_Min (0x0UL)              /*!< Min enumerator value of READY field.                                 */
  #define RRAMC_INTEN_READY_Max (0x1UL)              /*!< Max enumerator value of READY field.                                 */
  #define RRAMC_INTEN_READY_Disabled (0x0UL)         /*!< Disable                                                              */
  #define RRAMC_INTEN_READY_Enabled (0x1UL)          /*!< Enable                                                               */

/* READYNEXT @Bit 2 : Enable or disable interrupt for event READYNEXT */
  #define RRAMC_INTEN_READYNEXT_Pos (2UL)            /*!< Position of READYNEXT field.                                         */
  #define RRAMC_INTEN_READYNEXT_Msk (0x1UL << RRAMC_INTEN_READYNEXT_Pos) /*!< Bit mask of READYNEXT field.                     */
  #define RRAMC_INTEN_READYNEXT_Min (0x0UL)          /*!< Min enumerator value of READYNEXT field.                             */
  #define RRAMC_INTEN_READYNEXT_Max (0x1UL)          /*!< Max enumerator value of READYNEXT field.                             */
  #define RRAMC_INTEN_READYNEXT_Disabled (0x0UL)     /*!< Disable                                                              */
  #define RRAMC_INTEN_READYNEXT_Enabled (0x1UL)      /*!< Enable                                                               */

