nrfconnect/sdk-hal_nordic/nrfx/mdk/nrf54l20_enga_types.h
/* ================================================ Struct SPIS_EVENTS_DMA_TX ================================================ */
/**
  * @brief TX [SPIS_EVENTS_DMA_TX] Peripheral events.
  */
typedef struct {
  __IOM uint32_t  END;                               /*!< (@ 0x00000000) Generated after all MAXCNT bytes have been transferred*/
  __IOM uint32_t  READY;                             /*!< (@ 0x00000004) Generated when EasyDMA has buffered the .PTR and
                                                                         .MAXCNT registers for the channel, allowing them to be
                                                                         written to prepare for the next sequence.*/
  __IOM uint32_t  BUSERROR;                          /*!< (@ 0x00000008) An error occured during the bus transfer.             */
} NRF_SPIS_EVENTS_DMA_TX_Type;                       /*!< Size = 12 (0x00C)                                                    */

/* SPIS_EVENTS_DMA_TX_END: Generated after all MAXCNT bytes have been transferred */
  #define SPIS_EVENTS_DMA_TX_END_ResetValue (0x00000000UL) /*!< Reset value of END register.                                   */

/* END @Bit 0 : Generated after all MAXCNT bytes have been transferred */
  #define SPIS_EVENTS_DMA_TX_END_END_Pos (0UL)       /*!< Position of END field.                                               */
  #define SPIS_EVENTS_DMA_TX_END_END_Msk (0x1UL << SPIS_EVENTS_DMA_TX_END_END_Pos) /*!< Bit mask of END field.                 */
  #define SPIS_EVENTS_DMA_TX_END_END_Min (0x0UL)     /*!< Min enumerator value of END field.                                   */
  #define SPIS_EVENTS_DMA_TX_END_END_Max (0x1UL)     /*!< Max enumerator value of END field.                                   */
  #define SPIS_EVENTS_DMA_TX_END_END_NotGenerated (0x0UL) /*!< Event not generated                                             */
  #define SPIS_EVENTS_DMA_TX_END_END_Generated (0x1UL) /*!< Event generated                                                    */


/* SPIS_EVENTS_DMA_TX_READY: Generated when EasyDMA has buffered the .PTR and .MAXCNT registers for the channel, allowing them
                              to be written to prepare for the next sequence. */

  #define SPIS_EVENTS_DMA_TX_READY_ResetValue (0x00000000UL) /*!< Reset value of READY register.                               */

/* READY @Bit 0 : Generated when EasyDMA has buffered the .PTR and .MAXCNT registers for the channel, allowing them to be
                  written to prepare for the next sequence. */

  #define SPIS_EVENTS_DMA_TX_READY_READY_Pos (0UL)   /*!< Position of READY field.                                             */
  #define SPIS_EVENTS_DMA_TX_READY_READY_Msk (0x1UL << SPIS_EVENTS_DMA_TX_READY_READY_Pos) /*!< Bit mask of READY field.       */
  #define SPIS_EVENTS_DMA_TX_READY_READY_Min (0x0UL) /*!< Min enumerator value of READY field.                                 */
  #define SPIS_EVENTS_DMA_TX_READY_READY_Max (0x1UL) /*!< Max enumerator value of READY field.                                 */
  #define SPIS_EVENTS_DMA_TX_READY_READY_NotGenerated (0x0UL) /*!< Event not generated                                         */
  #define SPIS_EVENTS_DMA_TX_READY_READY_Generated (0x1UL) /*!< Event generated                                                */


/* SPIS_EVENTS_DMA_TX_BUSERROR: An error occured during the bus transfer. */
  #define SPIS_EVENTS_DMA_TX_BUSERROR_ResetValue (0x00000000UL) /*!< Reset value of BUSERROR register.                         */

/* BUSERROR @Bit 0 : An error occured during the bus transfer. */
  #define SPIS_EVENTS_DMA_TX_BUSERROR_BUSERROR_Pos (0UL) /*!< Position of BUSERROR field.                                      */
  #define SPIS_EVENTS_DMA_TX_BUSERROR_BUSERROR_Msk (0x1UL << SPIS_EVENTS_DMA_TX_BUSERROR_BUSERROR_Pos) /*!< Bit mask of BUSERROR
                                                                            field.*/
  #define SPIS_EVENTS_DMA_TX_BUSERROR_BUSERROR_Min (0x0UL) /*!< Min enumerator value of BUSERROR field.                        */
  #define SPIS_EVENTS_DMA_TX_BUSERROR_BUSERROR_Max (0x1UL) /*!< Max enumerator value of BUSERROR field.                        */
  #define SPIS_EVENTS_DMA_TX_BUSERROR_BUSERROR_NotGenerated (0x0UL) /*!< Event not generated                                   */
  #define SPIS_EVENTS_DMA_TX_BUSERROR_BUSERROR_Generated (0x1UL) /*!< Event generated                                          */



/* ================================================= Struct SPIS_EVENTS_DMA ================================================== */
/**
  * @brief EVENTS_DMA [SPIS_EVENTS_DMA] Peripheral events.
  */
typedef struct {
  __IOM NRF_SPIS_EVENTS_DMA_RX_Type RX;              /*!< (@ 0x00000000) Peripheral events.                                    */
  __IOM NRF_SPIS_EVENTS_DMA_TX_Type TX;              /*!< (@ 0x0000001C) Peripheral events.                                    */
} NRF_SPIS_EVENTS_DMA_Type;                          /*!< Size = 40 (0x028)                                                    */


/* =============================================== Struct SPIS_PUBLISH_DMA_RX ================================================ */
/**
  * @brief RX [SPIS_PUBLISH_DMA_RX] Publish configuration for events
  */
typedef struct {
  __IOM uint32_t  END;                               /*!< (@ 0x00000000) Publish configuration for event END                   */
  __IOM uint32_t  READY;                             /*!< (@ 0x00000004) Publish configuration for event READY                 */
  __IOM uint32_t  BUSERROR;                          /*!< (@ 0x00000008) Publish configuration for event BUSERROR              */
  __IOM uint32_t  MATCH[4];                          /*!< (@ 0x0000000C) Publish configuration for event MATCH[n]              */
} NRF_SPIS_PUBLISH_DMA_RX_Type;                      /*!< Size = 28 (0x01C)                                                    */

/* SPIS_PUBLISH_DMA_RX_END: Publish configuration for event END */
  #define SPIS_PUBLISH_DMA_RX_END_ResetValue (0x00000000UL) /*!< Reset value of END register.                                  */

