nrfconnect/sdk-hal_nordic/nrfx/mdk/nrf54l20_enga_types.h
/* LOCK @Bit 8 : LOCK feature */
  #define SPU_FEATURE_GPIOTE_CH_LOCK_Pos (8UL)       /*!< Position of LOCK field.                                              */
  #define SPU_FEATURE_GPIOTE_CH_LOCK_Msk (0x1UL << SPU_FEATURE_GPIOTE_CH_LOCK_Pos) /*!< Bit mask of LOCK field.                */
  #define SPU_FEATURE_GPIOTE_CH_LOCK_Min (0x0UL)     /*!< Min enumerator value of LOCK field.                                  */
  #define SPU_FEATURE_GPIOTE_CH_LOCK_Max (0x1UL)     /*!< Max enumerator value of LOCK field.                                  */
  #define SPU_FEATURE_GPIOTE_CH_LOCK_Unlocked (0x0UL) /*!< Feature permissions can be updated                                  */
  #define SPU_FEATURE_GPIOTE_CH_LOCK_Locked (0x1UL)  /*!< Feature permissions can not be changed until the next reset          */


/* SPU_FEATURE_GPIOTE_INTERRUPT: Configuration of features for interrupt o of GPIOTE[n] */
  #define SPU_FEATURE_GPIOTE_INTERRUPT_MaxCount (8UL) /*!< Max size of INTERRUPT[8] array.                                     */
  #define SPU_FEATURE_GPIOTE_INTERRUPT_MaxIndex (7UL) /*!< Max index of INTERRUPT[8] array.                                    */
  #define SPU_FEATURE_GPIOTE_INTERRUPT_MinIndex (0UL) /*!< Min index of INTERRUPT[8] array.                                    */
  #define SPU_FEATURE_GPIOTE_INTERRUPT_ResetValue (0x00100010UL) /*!< Reset value of INTERRUPT[8] register.                    */

/* SECATTR @Bit 4 : SECATTR feature */
  #define SPU_FEATURE_GPIOTE_INTERRUPT_SECATTR_Pos (4UL) /*!< Position of SECATTR field.                                       */
  #define SPU_FEATURE_GPIOTE_INTERRUPT_SECATTR_Msk (0x1UL << SPU_FEATURE_GPIOTE_INTERRUPT_SECATTR_Pos) /*!< Bit mask of SECATTR
                                                                            field.*/
  #define SPU_FEATURE_GPIOTE_INTERRUPT_SECATTR_Min (0x0UL) /*!< Min enumerator value of SECATTR field.                         */
  #define SPU_FEATURE_GPIOTE_INTERRUPT_SECATTR_Max (0x1UL) /*!< Max enumerator value of SECATTR field.                         */
  #define SPU_FEATURE_GPIOTE_INTERRUPT_SECATTR_NonSecure (0x0UL) /*!< Feature is available for non-secure usage                */
  #define SPU_FEATURE_GPIOTE_INTERRUPT_SECATTR_Secure (0x1UL) /*!< Feature is reserved for secure usage                        */

/* LOCK @Bit 8 : LOCK feature */
  #define SPU_FEATURE_GPIOTE_INTERRUPT_LOCK_Pos (8UL) /*!< Position of LOCK field.                                             */
  #define SPU_FEATURE_GPIOTE_INTERRUPT_LOCK_Msk (0x1UL << SPU_FEATURE_GPIOTE_INTERRUPT_LOCK_Pos) /*!< Bit mask of LOCK field.  */
  #define SPU_FEATURE_GPIOTE_INTERRUPT_LOCK_Min (0x0UL) /*!< Min enumerator value of LOCK field.                               */
  #define SPU_FEATURE_GPIOTE_INTERRUPT_LOCK_Max (0x1UL) /*!< Max enumerator value of LOCK field.                               */
  #define SPU_FEATURE_GPIOTE_INTERRUPT_LOCK_Unlocked (0x0UL) /*!< Feature permissions can be updated                           */
  #define SPU_FEATURE_GPIOTE_INTERRUPT_LOCK_Locked (0x1UL) /*!< Feature permissions can not be changed until the next reset    */



/* ================================================= Struct SPU_FEATURE_GPIO ================================================= */
/**
  * @brief GPIO [SPU_FEATURE_GPIO] (unspecified)
  */
typedef struct {
  __IOM uint32_t  PIN[32];                           /*!< (@ 0x00000000) Configuration of features for GPIO[n] PIN[o]          */
} NRF_SPU_FEATURE_GPIO_Type;                         /*!< Size = 128 (0x080)                                                   */
  #define SPU_FEATURE_GPIO_MaxCount (4UL)            /*!< Size of GPIO[4] array.                                               */
  #define SPU_FEATURE_GPIO_MaxIndex (3UL)            /*!< Max index of GPIO[4] array.                                          */
  #define SPU_FEATURE_GPIO_MinIndex (0UL)            /*!< Min index of GPIO[4] array.                                          */

/* SPU_FEATURE_GPIO_PIN: Configuration of features for GPIO[n] PIN[o] */
  #define SPU_FEATURE_GPIO_PIN_MaxCount (32UL)       /*!< Max size of PIN[32] array.                                           */
  #define SPU_FEATURE_GPIO_PIN_MaxIndex (31UL)       /*!< Max index of PIN[32] array.                                          */
  #define SPU_FEATURE_GPIO_PIN_MinIndex (0UL)        /*!< Min index of PIN[32] array.                                          */
  #define SPU_FEATURE_GPIO_PIN_ResetValue (0x00100010UL) /*!< Reset value of PIN[32] register.                                 */

/* SECATTR @Bit 4 : SECATTR feature */
  #define SPU_FEATURE_GPIO_PIN_SECATTR_Pos (4UL)     /*!< Position of SECATTR field.                                           */
  #define SPU_FEATURE_GPIO_PIN_SECATTR_Msk (0x1UL << SPU_FEATURE_GPIO_PIN_SECATTR_Pos) /*!< Bit mask of SECATTR field.         */
  #define SPU_FEATURE_GPIO_PIN_SECATTR_Min (0x0UL)   /*!< Min enumerator value of SECATTR field.                               */
  #define SPU_FEATURE_GPIO_PIN_SECATTR_Max (0x1UL)   /*!< Max enumerator value of SECATTR field.                               */
  #define SPU_FEATURE_GPIO_PIN_SECATTR_NonSecure (0x0UL) /*!< Feature is available for non-secure usage                        */
  #define SPU_FEATURE_GPIO_PIN_SECATTR_Secure (0x1UL) /*!< Feature is reserved for secure usage                                */

/* LOCK @Bit 8 : LOCK feature */
  #define SPU_FEATURE_GPIO_PIN_LOCK_Pos (8UL)        /*!< Position of LOCK field.                                              */
  #define SPU_FEATURE_GPIO_PIN_LOCK_Msk (0x1UL << SPU_FEATURE_GPIO_PIN_LOCK_Pos) /*!< Bit mask of LOCK field.                  */
  #define SPU_FEATURE_GPIO_PIN_LOCK_Min (0x0UL)      /*!< Min enumerator value of LOCK field.                                  */
  #define SPU_FEATURE_GPIO_PIN_LOCK_Max (0x1UL)      /*!< Max enumerator value of LOCK field.                                  */
  #define SPU_FEATURE_GPIO_PIN_LOCK_Unlocked (0x0UL) /*!< Feature permissions can be updated                                   */
  #define SPU_FEATURE_GPIO_PIN_LOCK_Locked (0x1UL)   /*!< Feature permissions can not be changed until the next reset          */



