nrfconnect/sdk-hal_nordic/nrfx/mdk/nrf54l20_enga_types.h
/* TDM_EVENTS_STOPPED: Transfer stopped. */
  #define TDM_EVENTS_STOPPED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_STOPPED register.                            */

/* EVENTS_STOPPED @Bit 0 : Transfer stopped. */
  #define TDM_EVENTS_STOPPED_EVENTS_STOPPED_Pos (0UL) /*!< Position of EVENTS_STOPPED field.                                   */
  #define TDM_EVENTS_STOPPED_EVENTS_STOPPED_Msk (0x1UL << TDM_EVENTS_STOPPED_EVENTS_STOPPED_Pos) /*!< Bit mask of EVENTS_STOPPED
                                                                            field.*/
  #define TDM_EVENTS_STOPPED_EVENTS_STOPPED_Min (0x0UL) /*!< Min enumerator value of EVENTS_STOPPED field.                     */
  #define TDM_EVENTS_STOPPED_EVENTS_STOPPED_Max (0x1UL) /*!< Max enumerator value of EVENTS_STOPPED field.                     */
  #define TDM_EVENTS_STOPPED_EVENTS_STOPPED_NotGenerated (0x0UL) /*!< Event not generated                                      */
  #define TDM_EVENTS_STOPPED_EVENTS_STOPPED_Generated (0x1UL) /*!< Event generated                                             */


/* TDM_EVENTS_ABORTED: Transfer aborted. */
  #define TDM_EVENTS_ABORTED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_ABORTED register.                            */

/* EVENTS_ABORTED @Bit 0 : Transfer aborted. */
  #define TDM_EVENTS_ABORTED_EVENTS_ABORTED_Pos (0UL) /*!< Position of EVENTS_ABORTED field.                                   */
  #define TDM_EVENTS_ABORTED_EVENTS_ABORTED_Msk (0x1UL << TDM_EVENTS_ABORTED_EVENTS_ABORTED_Pos) /*!< Bit mask of EVENTS_ABORTED
                                                                            field.*/
  #define TDM_EVENTS_ABORTED_EVENTS_ABORTED_Min (0x0UL) /*!< Min enumerator value of EVENTS_ABORTED field.                     */
  #define TDM_EVENTS_ABORTED_EVENTS_ABORTED_Max (0x1UL) /*!< Max enumerator value of EVENTS_ABORTED field.                     */
  #define TDM_EVENTS_ABORTED_EVENTS_ABORTED_NotGenerated (0x0UL) /*!< Event not generated                                      */
  #define TDM_EVENTS_ABORTED_EVENTS_ABORTED_Generated (0x1UL) /*!< Event generated                                             */


/* TDM_EVENTS_TXPTRUPD: The TDX.PTR register has been copied to internal double-buffers. When TDM is started and TX is enabled,
                         this event will be generated for every RXTXD.MAXCNT words that are sent on the SDOUT pin. */

  #define TDM_EVENTS_TXPTRUPD_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_TXPTRUPD register.                          */

/* EVENTS_TXPTRUPD @Bit 0 : The TDX.PTR register has been copied to internal double-buffers. When TDM is started and TX is
                            enabled, this event will be generated for every RXTXD.MAXCNT words that are sent on the SDOUT pin. */

  #define TDM_EVENTS_TXPTRUPD_EVENTS_TXPTRUPD_Pos (0UL) /*!< Position of EVENTS_TXPTRUPD field.                                */
  #define TDM_EVENTS_TXPTRUPD_EVENTS_TXPTRUPD_Msk (0x1UL << TDM_EVENTS_TXPTRUPD_EVENTS_TXPTRUPD_Pos) /*!< Bit mask of
                                                                            EVENTS_TXPTRUPD field.*/
  #define TDM_EVENTS_TXPTRUPD_EVENTS_TXPTRUPD_Min (0x0UL) /*!< Min enumerator value of EVENTS_TXPTRUPD field.                  */
  #define TDM_EVENTS_TXPTRUPD_EVENTS_TXPTRUPD_Max (0x1UL) /*!< Max enumerator value of EVENTS_TXPTRUPD field.                  */
  #define TDM_EVENTS_TXPTRUPD_EVENTS_TXPTRUPD_NotGenerated (0x0UL) /*!< Event not generated                                    */
  #define TDM_EVENTS_TXPTRUPD_EVENTS_TXPTRUPD_Generated (0x1UL) /*!< Event generated                                           */


/* TDM_EVENTS_MAXCNT: MAXCNT block event, generated on the active edge of FSYNC of every MAXCNT block */
  #define TDM_EVENTS_MAXCNT_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_MAXCNT register.                              */

/* EVENTS_MAXCNT @Bit 0 : MAXCNT block event, generated on the active edge of FSYNC of every MAXCNT block */
  #define TDM_EVENTS_MAXCNT_EVENTS_MAXCNT_Pos (0UL)  /*!< Position of EVENTS_MAXCNT field.                                     */
  #define TDM_EVENTS_MAXCNT_EVENTS_MAXCNT_Msk (0x1UL << TDM_EVENTS_MAXCNT_EVENTS_MAXCNT_Pos) /*!< Bit mask of EVENTS_MAXCNT
                                                                            field.*/
  #define TDM_EVENTS_MAXCNT_EVENTS_MAXCNT_Min (0x0UL) /*!< Min enumerator value of EVENTS_MAXCNT field.                        */
  #define TDM_EVENTS_MAXCNT_EVENTS_MAXCNT_Max (0x1UL) /*!< Max enumerator value of EVENTS_MAXCNT field.                        */
  #define TDM_EVENTS_MAXCNT_EVENTS_MAXCNT_NotGenerated (0x0UL) /*!< Event not generated                                        */
  #define TDM_EVENTS_MAXCNT_EVENTS_MAXCNT_Generated (0x1UL) /*!< Event generated                                               */


/* TDM_PUBLISH_RXPTRUPD: Publish configuration for event RXPTRUPD */
  #define TDM_PUBLISH_RXPTRUPD_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_RXPTRUPD register.                        */

/* CHIDX @Bits 0..7 : DPPI channel that event RXPTRUPD will publish to */
  #define TDM_PUBLISH_RXPTRUPD_CHIDX_Pos (0UL)       /*!< Position of CHIDX field.                                             */
  #define TDM_PUBLISH_RXPTRUPD_CHIDX_Msk (0xFFUL << TDM_PUBLISH_RXPTRUPD_CHIDX_Pos) /*!< Bit mask of CHIDX field.              */
  #define TDM_PUBLISH_RXPTRUPD_CHIDX_Min (0x00UL)    /*!< Min value of CHIDX field.                                            */
  #define TDM_PUBLISH_RXPTRUPD_CHIDX_Max (0xFFUL)    /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define TDM_PUBLISH_RXPTRUPD_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define TDM_PUBLISH_RXPTRUPD_EN_Msk (0x1UL << TDM_PUBLISH_RXPTRUPD_EN_Pos) /*!< Bit mask of EN field.                        */
  #define TDM_PUBLISH_RXPTRUPD_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define TDM_PUBLISH_RXPTRUPD_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define TDM_PUBLISH_RXPTRUPD_EN_Disabled (0x0UL)   /*!< Disable publishing                                                   */
  #define TDM_PUBLISH_RXPTRUPD_EN_Enabled (0x1UL)    /*!< Enable publishing                                                    */


/* TDM_PUBLISH_STOPPED: Publish configuration for event STOPPED */
  #define TDM_PUBLISH_STOPPED_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_STOPPED register.                          */

/* CHIDX @Bits 0..7 : DPPI channel that event STOPPED will publish to */
  #define TDM_PUBLISH_STOPPED_CHIDX_Pos (0UL)        /*!< Position of CHIDX field.                                             */
  #define TDM_PUBLISH_STOPPED_CHIDX_Msk (0xFFUL << TDM_PUBLISH_STOPPED_CHIDX_Pos) /*!< Bit mask of CHIDX field.                */
  #define TDM_PUBLISH_STOPPED_CHIDX_Min (0x00UL)     /*!< Min value of CHIDX field.                                            */
  #define TDM_PUBLISH_STOPPED_CHIDX_Max (0xFFUL)     /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define TDM_PUBLISH_STOPPED_EN_Pos (31UL)          /*!< Position of EN field.                                                */
  #define TDM_PUBLISH_STOPPED_EN_Msk (0x1UL << TDM_PUBLISH_STOPPED_EN_Pos) /*!< Bit mask of EN field.                          */
  #define TDM_PUBLISH_STOPPED_EN_Min (0x0UL)         /*!< Min enumerator value of EN field.                                    */
  #define TDM_PUBLISH_STOPPED_EN_Max (0x1UL)         /*!< Max enumerator value of EN field.                                    */
  #define TDM_PUBLISH_STOPPED_EN_Disabled (0x0UL)    /*!< Disable publishing                                                   */
  #define TDM_PUBLISH_STOPPED_EN_Enabled (0x1UL)     /*!< Enable publishing                                                    */


/* TDM_PUBLISH_ABORTED: Publish configuration for event ABORTED */
  #define TDM_PUBLISH_ABORTED_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_ABORTED register.                          */

/* CHIDX @Bits 0..7 : DPPI channel that event ABORTED will publish to */
  #define TDM_PUBLISH_ABORTED_CHIDX_Pos (0UL)        /*!< Position of CHIDX field.                                             */
  #define TDM_PUBLISH_ABORTED_CHIDX_Msk (0xFFUL << TDM_PUBLISH_ABORTED_CHIDX_Pos) /*!< Bit mask of CHIDX field.                */
  #define TDM_PUBLISH_ABORTED_CHIDX_Min (0x00UL)     /*!< Min value of CHIDX field.                                            */
  #define TDM_PUBLISH_ABORTED_CHIDX_Max (0xFFUL)     /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define TDM_PUBLISH_ABORTED_EN_Pos (31UL)          /*!< Position of EN field.                                                */
  #define TDM_PUBLISH_ABORTED_EN_Msk (0x1UL << TDM_PUBLISH_ABORTED_EN_Pos) /*!< Bit mask of EN field.                          */
  #define TDM_PUBLISH_ABORTED_EN_Min (0x0UL)         /*!< Min enumerator value of EN field.                                    */
  #define TDM_PUBLISH_ABORTED_EN_Max (0x1UL)         /*!< Max enumerator value of EN field.                                    */
  #define TDM_PUBLISH_ABORTED_EN_Disabled (0x0UL)    /*!< Disable publishing                                                   */
  #define TDM_PUBLISH_ABORTED_EN_Enabled (0x1UL)     /*!< Enable publishing                                                    */


/* TDM_PUBLISH_TXPTRUPD: Publish configuration for event TXPTRUPD */
  #define TDM_PUBLISH_TXPTRUPD_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_TXPTRUPD register.                        */

/* CHIDX @Bits 0..7 : DPPI channel that event TXPTRUPD will publish to */
  #define TDM_PUBLISH_TXPTRUPD_CHIDX_Pos (0UL)       /*!< Position of CHIDX field.                                             */
  #define TDM_PUBLISH_TXPTRUPD_CHIDX_Msk (0xFFUL << TDM_PUBLISH_TXPTRUPD_CHIDX_Pos) /*!< Bit mask of CHIDX field.              */
  #define TDM_PUBLISH_TXPTRUPD_CHIDX_Min (0x00UL)    /*!< Min value of CHIDX field.                                            */
  #define TDM_PUBLISH_TXPTRUPD_CHIDX_Max (0xFFUL)    /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define TDM_PUBLISH_TXPTRUPD_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define TDM_PUBLISH_TXPTRUPD_EN_Msk (0x1UL << TDM_PUBLISH_TXPTRUPD_EN_Pos) /*!< Bit mask of EN field.                        */
  #define TDM_PUBLISH_TXPTRUPD_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define TDM_PUBLISH_TXPTRUPD_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define TDM_PUBLISH_TXPTRUPD_EN_Disabled (0x0UL)   /*!< Disable publishing                                                   */
  #define TDM_PUBLISH_TXPTRUPD_EN_Enabled (0x1UL)    /*!< Enable publishing                                                    */


