nrfconnect/sdk-hal_nordic/nrfx/mdk/nrf54l20_enga_types.h
/* COMPARE4 @Bit 20 : Enable or disable interrupt for event COMPARE[4] */
  #define TIMER_INTEN_COMPARE4_Pos (20UL)            /*!< Position of COMPARE4 field.                                          */
  #define TIMER_INTEN_COMPARE4_Msk (0x1UL << TIMER_INTEN_COMPARE4_Pos) /*!< Bit mask of COMPARE4 field.                        */
  #define TIMER_INTEN_COMPARE4_Min (0x0UL)           /*!< Min enumerator value of COMPARE4 field.                              */
  #define TIMER_INTEN_COMPARE4_Max (0x1UL)           /*!< Max enumerator value of COMPARE4 field.                              */
  #define TIMER_INTEN_COMPARE4_Disabled (0x0UL)      /*!< Disable                                                              */
  #define TIMER_INTEN_COMPARE4_Enabled (0x1UL)       /*!< Enable                                                               */

/* COMPARE5 @Bit 21 : Enable or disable interrupt for event COMPARE[5] */
  #define TIMER_INTEN_COMPARE5_Pos (21UL)            /*!< Position of COMPARE5 field.                                          */
  #define TIMER_INTEN_COMPARE5_Msk (0x1UL << TIMER_INTEN_COMPARE5_Pos) /*!< Bit mask of COMPARE5 field.                        */
  #define TIMER_INTEN_COMPARE5_Min (0x0UL)           /*!< Min enumerator value of COMPARE5 field.                              */
  #define TIMER_INTEN_COMPARE5_Max (0x1UL)           /*!< Max enumerator value of COMPARE5 field.                              */
  #define TIMER_INTEN_COMPARE5_Disabled (0x0UL)      /*!< Disable                                                              */
  #define TIMER_INTEN_COMPARE5_Enabled (0x1UL)       /*!< Enable                                                               */

/* COMPARE6 @Bit 22 : Enable or disable interrupt for event COMPARE[6] */
  #define TIMER_INTEN_COMPARE6_Pos (22UL)            /*!< Position of COMPARE6 field.                                          */
  #define TIMER_INTEN_COMPARE6_Msk (0x1UL << TIMER_INTEN_COMPARE6_Pos) /*!< Bit mask of COMPARE6 field.                        */
  #define TIMER_INTEN_COMPARE6_Min (0x0UL)           /*!< Min enumerator value of COMPARE6 field.                              */
  #define TIMER_INTEN_COMPARE6_Max (0x1UL)           /*!< Max enumerator value of COMPARE6 field.                              */
  #define TIMER_INTEN_COMPARE6_Disabled (0x0UL)      /*!< Disable                                                              */
  #define TIMER_INTEN_COMPARE6_Enabled (0x1UL)       /*!< Enable                                                               */

/* COMPARE7 @Bit 23 : Enable or disable interrupt for event COMPARE[7] */
  #define TIMER_INTEN_COMPARE7_Pos (23UL)            /*!< Position of COMPARE7 field.                                          */
  #define TIMER_INTEN_COMPARE7_Msk (0x1UL << TIMER_INTEN_COMPARE7_Pos) /*!< Bit mask of COMPARE7 field.                        */
  #define TIMER_INTEN_COMPARE7_Min (0x0UL)           /*!< Min enumerator value of COMPARE7 field.                              */
  #define TIMER_INTEN_COMPARE7_Max (0x1UL)           /*!< Max enumerator value of COMPARE7 field.                              */
  #define TIMER_INTEN_COMPARE7_Disabled (0x0UL)      /*!< Disable                                                              */
  #define TIMER_INTEN_COMPARE7_Enabled (0x1UL)       /*!< Enable                                                               */


/* TIMER_INTENSET: Enable interrupt */
  #define TIMER_INTENSET_ResetValue (0x00000000UL)   /*!< Reset value of INTENSET register.                                    */

/* COMPARE0 @Bit 16 : Write '1' to enable interrupt for event COMPARE[0] */
  #define TIMER_INTENSET_COMPARE0_Pos (16UL)         /*!< Position of COMPARE0 field.                                          */
  #define TIMER_INTENSET_COMPARE0_Msk (0x1UL << TIMER_INTENSET_COMPARE0_Pos) /*!< Bit mask of COMPARE0 field.                  */
  #define TIMER_INTENSET_COMPARE0_Min (0x0UL)        /*!< Min enumerator value of COMPARE0 field.                              */
  #define TIMER_INTENSET_COMPARE0_Max (0x1UL)        /*!< Max enumerator value of COMPARE0 field.                              */
  #define TIMER_INTENSET_COMPARE0_Set (0x1UL)        /*!< Enable                                                               */
  #define TIMER_INTENSET_COMPARE0_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define TIMER_INTENSET_COMPARE0_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* COMPARE1 @Bit 17 : Write '1' to enable interrupt for event COMPARE[1] */
  #define TIMER_INTENSET_COMPARE1_Pos (17UL)         /*!< Position of COMPARE1 field.                                          */
  #define TIMER_INTENSET_COMPARE1_Msk (0x1UL << TIMER_INTENSET_COMPARE1_Pos) /*!< Bit mask of COMPARE1 field.                  */
  #define TIMER_INTENSET_COMPARE1_Min (0x0UL)        /*!< Min enumerator value of COMPARE1 field.                              */
  #define TIMER_INTENSET_COMPARE1_Max (0x1UL)        /*!< Max enumerator value of COMPARE1 field.                              */
  #define TIMER_INTENSET_COMPARE1_Set (0x1UL)        /*!< Enable                                                               */
  #define TIMER_INTENSET_COMPARE1_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define TIMER_INTENSET_COMPARE1_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* COMPARE2 @Bit 18 : Write '1' to enable interrupt for event COMPARE[2] */
  #define TIMER_INTENSET_COMPARE2_Pos (18UL)         /*!< Position of COMPARE2 field.                                          */
  #define TIMER_INTENSET_COMPARE2_Msk (0x1UL << TIMER_INTENSET_COMPARE2_Pos) /*!< Bit mask of COMPARE2 field.                  */
  #define TIMER_INTENSET_COMPARE2_Min (0x0UL)        /*!< Min enumerator value of COMPARE2 field.                              */
  #define TIMER_INTENSET_COMPARE2_Max (0x1UL)        /*!< Max enumerator value of COMPARE2 field.                              */
  #define TIMER_INTENSET_COMPARE2_Set (0x1UL)        /*!< Enable                                                               */
  #define TIMER_INTENSET_COMPARE2_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define TIMER_INTENSET_COMPARE2_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* COMPARE3 @Bit 19 : Write '1' to enable interrupt for event COMPARE[3] */
  #define TIMER_INTENSET_COMPARE3_Pos (19UL)         /*!< Position of COMPARE3 field.                                          */
  #define TIMER_INTENSET_COMPARE3_Msk (0x1UL << TIMER_INTENSET_COMPARE3_Pos) /*!< Bit mask of COMPARE3 field.                  */
  #define TIMER_INTENSET_COMPARE3_Min (0x0UL)        /*!< Min enumerator value of COMPARE3 field.                              */
  #define TIMER_INTENSET_COMPARE3_Max (0x1UL)        /*!< Max enumerator value of COMPARE3 field.                              */
  #define TIMER_INTENSET_COMPARE3_Set (0x1UL)        /*!< Enable                                                               */
  #define TIMER_INTENSET_COMPARE3_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define TIMER_INTENSET_COMPARE3_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

/* COMPARE4 @Bit 20 : Write '1' to enable interrupt for event COMPARE[4] */
  #define TIMER_INTENSET_COMPARE4_Pos (20UL)         /*!< Position of COMPARE4 field.                                          */
  #define TIMER_INTENSET_COMPARE4_Msk (0x1UL << TIMER_INTENSET_COMPARE4_Pos) /*!< Bit mask of COMPARE4 field.                  */
  #define TIMER_INTENSET_COMPARE4_Min (0x0UL)        /*!< Min enumerator value of COMPARE4 field.                              */
  #define TIMER_INTENSET_COMPARE4_Max (0x1UL)        /*!< Max enumerator value of COMPARE4 field.                              */
  #define TIMER_INTENSET_COMPARE4_Set (0x1UL)        /*!< Enable                                                               */
  #define TIMER_INTENSET_COMPARE4_Disabled (0x0UL)   /*!< Read: Disabled                                                       */
  #define TIMER_INTENSET_COMPARE4_Enabled (0x1UL)    /*!< Read: Enabled                                                        */

