nrfconnect/sdk-hal_nordic/nrfx/mdk/nrf54l20_enga_types.h
/* PRESCALER @Bits 0..3 : Prescaler value */
  #define TIMER_PRESCALER_PRESCALER_Pos (0UL)        /*!< Position of PRESCALER field.                                         */
  #define TIMER_PRESCALER_PRESCALER_Msk (0xFUL << TIMER_PRESCALER_PRESCALER_Pos) /*!< Bit mask of PRESCALER field.             */
  #define TIMER_PRESCALER_PRESCALER_Min (0x0UL)      /*!< Min value of PRESCALER field.                                        */
  #define TIMER_PRESCALER_PRESCALER_Max (0x9UL)      /*!< Max size of PRESCALER field.                                         */


/* TIMER_CC: Capture/Compare register n */
  #define TIMER_CC_MaxCount (8UL)                    /*!< Max size of CC[8] array.                                             */
  #define TIMER_CC_MaxIndex (7UL)                    /*!< Max index of CC[8] array.                                            */
  #define TIMER_CC_MinIndex (0UL)                    /*!< Min index of CC[8] array.                                            */
  #define TIMER_CC_ResetValue (0x00000000UL)         /*!< Reset value of CC[8] register.                                       */

/* CC @Bits 0..31 : Capture/Compare value */
  #define TIMER_CC_CC_Pos (0UL)                      /*!< Position of CC field.                                                */
  #define TIMER_CC_CC_Msk (0xFFFFFFFFUL << TIMER_CC_CC_Pos) /*!< Bit mask of CC field.                                         */


/* TIMER_ONESHOTEN: Enable one-shot operation for Capture/Compare channel n */
  #define TIMER_ONESHOTEN_MaxCount (8UL)             /*!< Max size of ONESHOTEN[8] array.                                      */
  #define TIMER_ONESHOTEN_MaxIndex (7UL)             /*!< Max index of ONESHOTEN[8] array.                                     */
  #define TIMER_ONESHOTEN_MinIndex (0UL)             /*!< Min index of ONESHOTEN[8] array.                                     */
  #define TIMER_ONESHOTEN_ResetValue (0x00000000UL)  /*!< Reset value of ONESHOTEN[8] register.                                */

/* ONESHOTEN @Bit 0 : Enable one-shot operation */
  #define TIMER_ONESHOTEN_ONESHOTEN_Pos (0UL)        /*!< Position of ONESHOTEN field.                                         */
  #define TIMER_ONESHOTEN_ONESHOTEN_Msk (0x1UL << TIMER_ONESHOTEN_ONESHOTEN_Pos) /*!< Bit mask of ONESHOTEN field.             */
  #define TIMER_ONESHOTEN_ONESHOTEN_Min (0x0UL)      /*!< Min enumerator value of ONESHOTEN field.                             */
  #define TIMER_ONESHOTEN_ONESHOTEN_Max (0x1UL)      /*!< Max enumerator value of ONESHOTEN field.                             */
  #define TIMER_ONESHOTEN_ONESHOTEN_Disable (0x0UL)  /*!< Disable one-shot operation                                           */
  #define TIMER_ONESHOTEN_ONESHOTEN_Enable (0x1UL)   /*!< Enable one-shot operation                                            */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           TPIU                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ======================================================= Struct TPIU ======================================================= */
/**
  * @brief Trace Port Interface Unit
  */
  typedef struct {                                   /*!< TPIU Structure                                                       */
    __IOM uint32_t SUPPORTEDPORTSIZES;               /*!< (@ 0x00000000) Each bit location is a single port size that is
                                                                         supported on the device.*/
    __IOM uint32_t CURRENTPORTSIZE;                  /*!< (@ 0x00000004) Each bit location is a single port size. One bit can be
                                                                         set, and indicates the current port size.*/
    __IM uint32_t RESERVED[62];
    __IOM uint32_t SUPPORTEDTRIGGERMODES;            /*!< (@ 0x00000100) The Supported_trigger_modes register indicates the
                                                                         implemented trigger counter multipliers and other
                                                                         supported features of the trigger system.*/
    __IOM uint32_t TRIGGERCOUNTERVALUE;              /*!< (@ 0x00000104) The Trigger_counter_value register enables delaying the
                                                                         indication of triggers to any external connected trace
                                                                         capture or storage devices.*/
    __IOM uint32_t TRIGGERMULTIPLIER;                /*!< (@ 0x00000108) The Trigger_multiplier register contains the selectors
                                                                         for the trigger counter multiplier.*/
    __IM uint32_t RESERVED1[61];
    __IOM uint32_t SUPPPORTEDTESTPATTERNMODES;       /*!< (@ 0x00000200) The Supported_test_pattern_modes register provides a
                                                                         set of known bit sequences or patterns that can be
                                                                         output over the trace port and can be detected by the
                                                                         TPA or other associated trace capture device.*/
    __IOM uint32_t CURRENTTESTPATTERNMODES;          /*!< (@ 0x00000204) Current_test_pattern_mode indicates the current test
                                                                         pattern or mode selected.*/
    __IOM uint32_t TPRCR;                            /*!< (@ 0x00000208) The TPRCR register is an 8-bit counter start value that
                                                                         is decremented. A write sets the initial counter value
                                                                         and a read returns the programmed value.*/
    __IM uint32_t RESERVED2[61];
    __IOM uint32_t FFSR;                             /*!< (@ 0x00000300) The FFSR register indicates the current status of the
                                                                         formatter and flush features available in the TPIU.*/
    __IOM uint32_t FFCR;                             /*!< (@ 0x00000304) The FFCR register controls the generation of stop,
                                                                         trigger, and flush events.*/
    __IOM uint32_t FSCR;                             /*!< (@ 0x00000308) The FSCR register enables the frequency of
                                                                         synchronization information to be optimized to suit the
                                                                         Trace Port Analyzer (TPA) capture buffer size.*/
    __IM uint32_t RESERVED3[61];
    __IOM uint32_t EXTCTLINPORT;                     /*!< (@ 0x00000400) Two ports can be used as a control and feedback
                                                                         mechanism for any serializers, pin sharing
                                                                         multiplexers, or other solutions that might be added to
                                                                         the trace output pins either for pin control or a
                                                                         high-speed trace port solution.*/
    __IOM uint32_t EXTCTLOUTPORT;                    /*!< (@ 0x00000404) Two ports can be used as a control and feedback
                                                                         mechanism for any serializers, pin sharing
                                                                         multiplexers, or other solutions that might be added to
                                                                         the trace output pins either for pin control or a high
                                                                         speed trace port solution. These ports are raw register
                                                                         banks that sample or export the corresponding external
                                                                         pins.*/
    __IM uint32_t RESERVED4[695];
    __IOM uint32_t ITTRFLINACK;                      /*!< (@ 0x00000EE4) The ITTRFLINACK register enables control of the
                                                                         triginack and flushinack outputs from the TPIU.*/
    __IOM uint32_t ITTRFLIN;                         /*!< (@ 0x00000EE8) The ITTRFLIN register contains the values of the
                                                                         flushin and trigin inputs to the TPIU.*/
    __IOM uint32_t ITATBDATA0;                       /*!< (@ 0x00000EEC) The ITATBDATA0 register contains the value of the
                                                                         atdatas inputs to the TPIU. The values are valid only
                                                                         when atvalids is HIGH.*/
    __IOM uint32_t ITATBCTR2;                        /*!< (@ 0x00000EF0) Enables control of the atreadys and afvalids outputs of
                                                                         the TPIU.*/
    __IOM uint32_t ITATBCTR1;                        /*!< (@ 0x00000EF4) The ITATBCTR1 register contains the value of the atids
                                                                         input to the TPIU. This is only valid when atvalids is
                                                                         HIGH.*/
    __IOM uint32_t ITATBCTR0;                        /*!< (@ 0x00000EF8) The ITATBCTR0 register captures the values of the
                                                                         atvalids, afreadys, and atbytess inputs to the TPIU. To
                                                                         ensure the integration registers work correctly in a
                                                                         system, the value of atbytess is only valid when
                                                                         atvalids, bit[0], is HIGH.*/
    __IM uint32_t RESERVED5;
    __IOM uint32_t ITCTRL;                           /*!< (@ 0x00000F00) Used to enable topology detection. This register
                                                                         enables the component to switch from a functional mode,
                                                                         the default behavior, to integration mode where the
                                                                         inputs and outputs of the component can be directly
                                                                         controlled for integration testing and topology
                                                                         solving.*/
    __IM uint32_t RESERVED6[39];
    __IOM uint32_t CLAIMSET;                         /*!< (@ 0x00000FA0) Software can use the claim tag to coordinate
                                                                         application and debugger access to trace unit
                                                                         functionality. The claim tags have no effect on the
                                                                         operation of the component. The CLAIMSET register sets
                                                                         bits in the claim tag, and determines the number of
                                                                         claim bits implemented.*/
    __IOM uint32_t CLAIMCLR;                         /*!< (@ 0x00000FA4) Software can use the claim tag to coordinate
                                                                         application and debugger access to trace unit
                                                                         functionality. The claim tags have no effect on the
                                                                         operation of the component. The CLAIMCLR register sets
                                                                         the bits in the claim tag to 0 and determines the
                                                                         current value of the claim tag.*/
    __IM uint32_t RESERVED7[2];
    __IOM uint32_t LAR;                              /*!< (@ 0x00000FB0) This is used to enable write access to device
                                                                         registers.*/
    __IOM uint32_t LSR;                              /*!< (@ 0x00000FB4) This indicates the status of the lock control
                                                                         mechanism. This lock prevents accidental writes by code
                                                                         under debug. Accesses to the extended stimulus port
                                                                         registers are not affected by the lock mechanism. This
                                                                         register must always be present although there might
                                                                         not be any lock access control mechanism. The lock
                                                                         mechanism, where present and locked, must block write
                                                                         accesses to any control register, except the Lock
                                                                         Access Register. For most components this covers all
                                                                         registers except for the Lock Access Register.*/
    __IOM uint32_t AUTHSTATUS;                       /*!< (@ 0x00000FB8) Indicates the current level of tracing permitted by the
                                                                         system*/
    __IM uint32_t RESERVED8[3];
    __IM uint32_t DEVID;                             /*!< (@ 0x00000FC8) Indicates the capabilities of the component.          */
    __IM uint32_t DEVTYPE;                           /*!< (@ 0x00000FCC) The DEVTYPE register provides a debugger with
                                                                         information about the component when the Part Number
                                                                         field is not recognized. The debugger can then report
                                                                         this information.*/
    __IOM uint32_t PIDR4;                            /*!< (@ 0x00000FD0) Coresight peripheral identification registers.        */
    __IM uint32_t RESERVED9[3];
    __IOM uint32_t PIDR0;                            /*!< (@ 0x00000FE0) Coresight peripheral identification registers.        */
    __IOM uint32_t PIDR1;                            /*!< (@ 0x00000FE4) Coresight peripheral identification registers.        */
    __IOM uint32_t PIDR2;                            /*!< (@ 0x00000FE8) Coresight peripheral identification registers.        */
    __IOM uint32_t PIDR3;                            /*!< (@ 0x00000FEC) Coresight peripheral identification registers.        */
    __IOM uint32_t CIDR0;                            /*!< (@ 0x00000FF0) Coresight component identification registers.         */
    __IOM uint32_t CIDR1;                            /*!< (@ 0x00000FF4) Coresight component identification registers.         */
    __IOM uint32_t CIDR2;                            /*!< (@ 0x00000FF8) Coresight component identification registers.         */
    __IOM uint32_t CIDR3;                            /*!< (@ 0x00000FFC) Coresight component identification registers.         */
  } NRF_TPIU_Type;                                   /*!< Size = 4096 (0x1000)                                                 */

/* TPIU_SUPPORTEDPORTSIZES: Each bit location is a single port size that is supported on the device. */
  #define TPIU_SUPPORTEDPORTSIZES_ResetValue (0x00000000UL) /*!< Reset value of SUPPORTEDPORTSIZES register.                   */

