nrfconnect/sdk-hal_nordic/nrfx/mdk/nrf54l20_enga_types.h
/* PORT_SIZE_8 @Bit 7 : Indicates whether the TPIU supports port size of 8-bit. */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_8_Pos (7UL) /*!< Position of PORT_SIZE_8 field.                                    */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_8_Msk (0x1UL << TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_8_Pos) /*!< Bit mask of
                                                                            PORT_SIZE_8 field.*/
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_8_Min (0x0UL) /*!< Min enumerator value of PORT_SIZE_8 field.                      */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_8_Max (0x1UL) /*!< Max enumerator value of PORT_SIZE_8 field.                      */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_8_NotSupported (0x0UL) /*!< Port size 8 is not supported.                          */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_8_Supported (0x1UL) /*!< Port size 8 is supported.                                 */

/* PORT_SIZE_9 @Bit 8 : Indicates whether the TPIU supports port size of 9-bit. */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_9_Pos (8UL) /*!< Position of PORT_SIZE_9 field.                                    */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_9_Msk (0x1UL << TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_9_Pos) /*!< Bit mask of
                                                                            PORT_SIZE_9 field.*/
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_9_Min (0x0UL) /*!< Min enumerator value of PORT_SIZE_9 field.                      */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_9_Max (0x1UL) /*!< Max enumerator value of PORT_SIZE_9 field.                      */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_9_NotSupported (0x0UL) /*!< Port size 9 is not supported.                          */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_9_Supported (0x1UL) /*!< Port size 9 is supported.                                 */

/* PORT_SIZE_10 @Bit 9 : Indicates whether the TPIU supports port size of 10-bit. */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_10_Pos (9UL) /*!< Position of PORT_SIZE_10 field.                                  */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_10_Msk (0x1UL << TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_10_Pos) /*!< Bit mask of
                                                                            PORT_SIZE_10 field.*/
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_10_Min (0x0UL) /*!< Min enumerator value of PORT_SIZE_10 field.                    */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_10_Max (0x1UL) /*!< Max enumerator value of PORT_SIZE_10 field.                    */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_10_NotSupported (0x0UL) /*!< Port size 10 is not supported.                        */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_10_Supported (0x1UL) /*!< Port size 10 is supported.                               */

/* PORT_SIZE_11 @Bit 10 : Indicates whether the TPIU supports port size of 11-bit. */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_11_Pos (10UL) /*!< Position of PORT_SIZE_11 field.                                 */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_11_Msk (0x1UL << TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_11_Pos) /*!< Bit mask of
                                                                            PORT_SIZE_11 field.*/
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_11_Min (0x0UL) /*!< Min enumerator value of PORT_SIZE_11 field.                    */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_11_Max (0x1UL) /*!< Max enumerator value of PORT_SIZE_11 field.                    */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_11_NotSupported (0x0UL) /*!< Port size 11 is not supported.                        */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_11_Supported (0x1UL) /*!< Port size 11 is supported.                               */

/* PORT_SIZE_12 @Bit 11 : Indicates whether the TPIU supports port size of 12-bit. */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_12_Pos (11UL) /*!< Position of PORT_SIZE_12 field.                                 */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_12_Msk (0x1UL << TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_12_Pos) /*!< Bit mask of
                                                                            PORT_SIZE_12 field.*/
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_12_Min (0x0UL) /*!< Min enumerator value of PORT_SIZE_12 field.                    */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_12_Max (0x1UL) /*!< Max enumerator value of PORT_SIZE_12 field.                    */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_12_NotSupported (0x0UL) /*!< Port size 12 is not supported.                        */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_12_Supported (0x1UL) /*!< Port size 12 is supported.                               */

/* PORT_SIZE_13 @Bit 12 : Indicates whether the TPIU supports port size of 13-bit. */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_13_Pos (12UL) /*!< Position of PORT_SIZE_13 field.                                 */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_13_Msk (0x1UL << TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_13_Pos) /*!< Bit mask of
                                                                            PORT_SIZE_13 field.*/
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_13_Min (0x0UL) /*!< Min enumerator value of PORT_SIZE_13 field.                    */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_13_Max (0x1UL) /*!< Max enumerator value of PORT_SIZE_13 field.                    */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_13_NotSupported (0x0UL) /*!< Port size 13 is not supported.                        */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_13_Supported (0x1UL) /*!< Port size 13 is supported.                               */

/* PORT_SIZE_14 @Bit 13 : Indicates whether the TPIU supports port size of 14-bit. */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_14_Pos (13UL) /*!< Position of PORT_SIZE_14 field.                                 */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_14_Msk (0x1UL << TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_14_Pos) /*!< Bit mask of
                                                                            PORT_SIZE_14 field.*/
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_14_Min (0x0UL) /*!< Min enumerator value of PORT_SIZE_14 field.                    */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_14_Max (0x1UL) /*!< Max enumerator value of PORT_SIZE_14 field.                    */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_14_NotSupported (0x0UL) /*!< Port size 14 is not supported.                        */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_14_Supported (0x1UL) /*!< Port size 14 is supported.                               */

/* PORT_SIZE_15 @Bit 14 : Indicates whether the TPIU supports port size of 15-bit. */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_15_Pos (14UL) /*!< Position of PORT_SIZE_15 field.                                 */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_15_Msk (0x1UL << TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_15_Pos) /*!< Bit mask of
                                                                            PORT_SIZE_15 field.*/
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_15_Min (0x0UL) /*!< Min enumerator value of PORT_SIZE_15 field.                    */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_15_Max (0x1UL) /*!< Max enumerator value of PORT_SIZE_15 field.                    */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_15_NotSupported (0x0UL) /*!< Port size 15 is not supported.                        */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_15_Supported (0x1UL) /*!< Port size 15 is supported.                               */

/* PORT_SIZE_16 @Bit 15 : Indicates whether the TPIU supports port size of 16-bit. */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_16_Pos (15UL) /*!< Position of PORT_SIZE_16 field.                                 */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_16_Msk (0x1UL << TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_16_Pos) /*!< Bit mask of
                                                                            PORT_SIZE_16 field.*/
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_16_Min (0x0UL) /*!< Min enumerator value of PORT_SIZE_16 field.                    */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_16_Max (0x1UL) /*!< Max enumerator value of PORT_SIZE_16 field.                    */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_16_NotSupported (0x0UL) /*!< Port size 16 is not supported.                        */
  #define TPIU_SUPPORTEDPORTSIZES_PORT_SIZE_16_Supported (0x1UL) /*!< Port size 16 is supported.                               */

