nrfconnect/sdk-hal_nordic/nrfx/mdk/nrf54l20_enga_types.h
/* TRIGEVT @Bit 9 : Indicates a trigger on a trigger event. */
  #define TPIU_FFCR_TRIGEVT_Pos (9UL)                /*!< Position of TRIGEVT field.                                           */
  #define TPIU_FFCR_TRIGEVT_Msk (0x1UL << TPIU_FFCR_TRIGEVT_Pos) /*!< Bit mask of TRIGEVT field.                               */
  #define TPIU_FFCR_TRIGEVT_Min (0x0UL)              /*!< Min enumerator value of TRIGEVT field.                               */
  #define TPIU_FFCR_TRIGEVT_Max (0x1UL)              /*!< Max enumerator value of TRIGEVT field.                               */
  #define TPIU_FFCR_TRIGEVT_Disabled (0x0UL)         /*!< The formatting feature is disabled.                                  */
  #define TPIU_FFCR_TRIGEVT_Enabled (0x1UL)          /*!< The formatting feature is enabled.                                   */

/* TRIGFL @Bit 10 : Indicates a trigger when flush completion on afreadys is returned. */
  #define TPIU_FFCR_TRIGFL_Pos (10UL)                /*!< Position of TRIGFL field.                                            */
  #define TPIU_FFCR_TRIGFL_Msk (0x1UL << TPIU_FFCR_TRIGFL_Pos) /*!< Bit mask of TRIGFL field.                                  */
  #define TPIU_FFCR_TRIGFL_Min (0x0UL)               /*!< Min enumerator value of TRIGFL field.                                */
  #define TPIU_FFCR_TRIGFL_Max (0x1UL)               /*!< Max enumerator value of TRIGFL field.                                */
  #define TPIU_FFCR_TRIGFL_Disabled (0x0UL)          /*!< The formatting feature is disabled.                                  */
  #define TPIU_FFCR_TRIGFL_Enabled (0x1UL)           /*!< The formatting feature is enabled.                                   */

/* STOPFL @Bit 12 : Forces the FIFO to drain off any part-completed packets. */
  #define TPIU_FFCR_STOPFL_Pos (12UL)                /*!< Position of STOPFL field.                                            */
  #define TPIU_FFCR_STOPFL_Msk (0x1UL << TPIU_FFCR_STOPFL_Pos) /*!< Bit mask of STOPFL field.                                  */
  #define TPIU_FFCR_STOPFL_Min (0x0UL)               /*!< Min enumerator value of STOPFL field.                                */
  #define TPIU_FFCR_STOPFL_Max (0x1UL)               /*!< Max enumerator value of STOPFL field.                                */
  #define TPIU_FFCR_STOPFL_Disabled (0x0UL)          /*!< The formatting feature is disabled.                                  */
  #define TPIU_FFCR_STOPFL_Enabled (0x1UL)           /*!< The formatting feature is enabled.                                   */

/* STOPTRIG @Bit 13 : Stops the formatter after a trigger event is observed. Reset to disabled or 0. */
  #define TPIU_FFCR_STOPTRIG_Pos (13UL)              /*!< Position of STOPTRIG field.                                          */
  #define TPIU_FFCR_STOPTRIG_Msk (0x1UL << TPIU_FFCR_STOPTRIG_Pos) /*!< Bit mask of STOPTRIG field.                            */
  #define TPIU_FFCR_STOPTRIG_Min (0x0UL)             /*!< Min enumerator value of STOPTRIG field.                              */
  #define TPIU_FFCR_STOPTRIG_Max (0x1UL)             /*!< Max enumerator value of STOPTRIG field.                              */
  #define TPIU_FFCR_STOPTRIG_Disabled (0x0UL)        /*!< The formatting feature is disabled.                                  */
  #define TPIU_FFCR_STOPTRIG_Enabled (0x1UL)         /*!< The formatting feature is enabled.                                   */


/* TPIU_FSCR: The FSCR register enables the frequency of synchronization information to be optimized to suit the Trace Port
               Analyzer (TPA) capture buffer size. */

  #define TPIU_FSCR_ResetValue (0x00000000UL)        /*!< Reset value of FSCR register.                                        */

/* CYCCOUNT @Bits 0..11 : 12-bit counter reload value. Indicates the number of complete frames between full synchronization
                          packets. */

  #define TPIU_FSCR_CYCCOUNT_Pos (0UL)               /*!< Position of CYCCOUNT field.                                          */
  #define TPIU_FSCR_CYCCOUNT_Msk (0xFFFUL << TPIU_FSCR_CYCCOUNT_Pos) /*!< Bit mask of CYCCOUNT field.                          */
  #define TPIU_FSCR_CYCCOUNT_Min (0x000UL)           /*!< Min value of CYCCOUNT field.                                         */
  #define TPIU_FSCR_CYCCOUNT_Max (0x400UL)           /*!< Max size of CYCCOUNT field.                                          */


/* TPIU_EXTCTLINPORT: Two ports can be used as a control and feedback mechanism for any serializers, pin sharing multiplexers,
                       or other solutions that might be added to the trace output pins either for pin control or a high-speed
                       trace port solution. */

  #define TPIU_EXTCTLINPORT_ResetValue (0x00000000UL) /*!< Reset value of EXTCTLINPORT register.                               */

/* EXTCTLIN0 @Bit 0 : EXTCTL inputs. */
  #define TPIU_EXTCTLINPORT_EXTCTLIN0_Pos (0UL)      /*!< Position of EXTCTLIN0 field.                                         */
  #define TPIU_EXTCTLINPORT_EXTCTLIN0_Msk (0x1UL << TPIU_EXTCTLINPORT_EXTCTLIN0_Pos) /*!< Bit mask of EXTCTLIN0 field.         */
  #define TPIU_EXTCTLINPORT_EXTCTLIN0_Min (0x0UL)    /*!< Min enumerator value of EXTCTLIN0 field.                             */
  #define TPIU_EXTCTLINPORT_EXTCTLIN0_Max (0x1UL)    /*!< Max enumerator value of EXTCTLIN0 field.                             */
  #define TPIU_EXTCTLINPORT_EXTCTLIN0_Low (0x0UL)    /*!< Input EXTCTL0 is low.                                                */
  #define TPIU_EXTCTLINPORT_EXTCTLIN0_High (0x1UL)   /*!< Input EXTCTL0 is high.                                               */

/* EXTCTLIN1 @Bit 1 : EXTCTL inputs. */
  #define TPIU_EXTCTLINPORT_EXTCTLIN1_Pos (1UL)      /*!< Position of EXTCTLIN1 field.                                         */
  #define TPIU_EXTCTLINPORT_EXTCTLIN1_Msk (0x1UL << TPIU_EXTCTLINPORT_EXTCTLIN1_Pos) /*!< Bit mask of EXTCTLIN1 field.         */
  #define TPIU_EXTCTLINPORT_EXTCTLIN1_Min (0x0UL)    /*!< Min enumerator value of EXTCTLIN1 field.                             */
  #define TPIU_EXTCTLINPORT_EXTCTLIN1_Max (0x1UL)    /*!< Max enumerator value of EXTCTLIN1 field.                             */
  #define TPIU_EXTCTLINPORT_EXTCTLIN1_Low (0x0UL)    /*!< Input EXTCTL1 is low.                                                */
  #define TPIU_EXTCTLINPORT_EXTCTLIN1_High (0x1UL)   /*!< Input EXTCTL1 is high.                                               */

/* EXTCTLIN2 @Bit 2 : EXTCTL inputs. */
  #define TPIU_EXTCTLINPORT_EXTCTLIN2_Pos (2UL)      /*!< Position of EXTCTLIN2 field.                                         */
  #define TPIU_EXTCTLINPORT_EXTCTLIN2_Msk (0x1UL << TPIU_EXTCTLINPORT_EXTCTLIN2_Pos) /*!< Bit mask of EXTCTLIN2 field.         */
  #define TPIU_EXTCTLINPORT_EXTCTLIN2_Min (0x0UL)    /*!< Min enumerator value of EXTCTLIN2 field.                             */
  #define TPIU_EXTCTLINPORT_EXTCTLIN2_Max (0x1UL)    /*!< Max enumerator value of EXTCTLIN2 field.                             */
  #define TPIU_EXTCTLINPORT_EXTCTLIN2_Low (0x0UL)    /*!< Input EXTCTL2 is low.                                                */
  #define TPIU_EXTCTLINPORT_EXTCTLIN2_High (0x1UL)   /*!< Input EXTCTL2 is high.                                               */

/* EXTCTLIN3 @Bit 3 : EXTCTL inputs. */
  #define TPIU_EXTCTLINPORT_EXTCTLIN3_Pos (3UL)      /*!< Position of EXTCTLIN3 field.                                         */
  #define TPIU_EXTCTLINPORT_EXTCTLIN3_Msk (0x1UL << TPIU_EXTCTLINPORT_EXTCTLIN3_Pos) /*!< Bit mask of EXTCTLIN3 field.         */
  #define TPIU_EXTCTLINPORT_EXTCTLIN3_Min (0x0UL)    /*!< Min enumerator value of EXTCTLIN3 field.                             */
  #define TPIU_EXTCTLINPORT_EXTCTLIN3_Max (0x1UL)    /*!< Max enumerator value of EXTCTLIN3 field.                             */
  #define TPIU_EXTCTLINPORT_EXTCTLIN3_Low (0x0UL)    /*!< Input EXTCTL3 is low.                                                */
  #define TPIU_EXTCTLINPORT_EXTCTLIN3_High (0x1UL)   /*!< Input EXTCTL3 is high.                                               */

/* EXTCTLIN4 @Bit 4 : EXTCTL inputs. */
  #define TPIU_EXTCTLINPORT_EXTCTLIN4_Pos (4UL)      /*!< Position of EXTCTLIN4 field.                                         */
  #define TPIU_EXTCTLINPORT_EXTCTLIN4_Msk (0x1UL << TPIU_EXTCTLINPORT_EXTCTLIN4_Pos) /*!< Bit mask of EXTCTLIN4 field.         */
  #define TPIU_EXTCTLINPORT_EXTCTLIN4_Min (0x0UL)    /*!< Min enumerator value of EXTCTLIN4 field.                             */
  #define TPIU_EXTCTLINPORT_EXTCTLIN4_Max (0x1UL)    /*!< Max enumerator value of EXTCTLIN4 field.                             */
  #define TPIU_EXTCTLINPORT_EXTCTLIN4_Low (0x0UL)    /*!< Input EXTCTL4 is low.                                                */
  #define TPIU_EXTCTLINPORT_EXTCTLIN4_High (0x1UL)   /*!< Input EXTCTL4 is high.                                               */

/* EXTCTLIN5 @Bit 5 : EXTCTL inputs. */
  #define TPIU_EXTCTLINPORT_EXTCTLIN5_Pos (5UL)      /*!< Position of EXTCTLIN5 field.                                         */
  #define TPIU_EXTCTLINPORT_EXTCTLIN5_Msk (0x1UL << TPIU_EXTCTLINPORT_EXTCTLIN5_Pos) /*!< Bit mask of EXTCTLIN5 field.         */
  #define TPIU_EXTCTLINPORT_EXTCTLIN5_Min (0x0UL)    /*!< Min enumerator value of EXTCTLIN5 field.                             */
  #define TPIU_EXTCTLINPORT_EXTCTLIN5_Max (0x1UL)    /*!< Max enumerator value of EXTCTLIN5 field.                             */
  #define TPIU_EXTCTLINPORT_EXTCTLIN5_Low (0x0UL)    /*!< Input EXTCTL5 is low.                                                */
  #define TPIU_EXTCTLINPORT_EXTCTLIN5_High (0x1UL)   /*!< Input EXTCTL5 is high.                                               */

/* EXTCTLIN6 @Bit 6 : EXTCTL inputs. */
  #define TPIU_EXTCTLINPORT_EXTCTLIN6_Pos (6UL)      /*!< Position of EXTCTLIN6 field.                                         */
  #define TPIU_EXTCTLINPORT_EXTCTLIN6_Msk (0x1UL << TPIU_EXTCTLINPORT_EXTCTLIN6_Pos) /*!< Bit mask of EXTCTLIN6 field.         */
  #define TPIU_EXTCTLINPORT_EXTCTLIN6_Min (0x0UL)    /*!< Min enumerator value of EXTCTLIN6 field.                             */
  #define TPIU_EXTCTLINPORT_EXTCTLIN6_Max (0x1UL)    /*!< Max enumerator value of EXTCTLIN6 field.                             */
  #define TPIU_EXTCTLINPORT_EXTCTLIN6_Low (0x0UL)    /*!< Input EXTCTL6 is low.                                                */
  #define TPIU_EXTCTLINPORT_EXTCTLIN6_High (0x1UL)   /*!< Input EXTCTL6 is high.                                               */

/* EXTCTLIN7 @Bit 7 : EXTCTL inputs. */
  #define TPIU_EXTCTLINPORT_EXTCTLIN7_Pos (7UL)      /*!< Position of EXTCTLIN7 field.                                         */
  #define TPIU_EXTCTLINPORT_EXTCTLIN7_Msk (0x1UL << TPIU_EXTCTLINPORT_EXTCTLIN7_Pos) /*!< Bit mask of EXTCTLIN7 field.         */
  #define TPIU_EXTCTLINPORT_EXTCTLIN7_Min (0x0UL)    /*!< Min enumerator value of EXTCTLIN7 field.                             */
  #define TPIU_EXTCTLINPORT_EXTCTLIN7_Max (0x1UL)    /*!< Max enumerator value of EXTCTLIN7 field.                             */
  #define TPIU_EXTCTLINPORT_EXTCTLIN7_Low (0x0UL)    /*!< Input EXTCTL7 is low.                                                */
  #define TPIU_EXTCTLINPORT_EXTCTLIN7_High (0x1UL)   /*!< Input EXTCTL7 is high.                                               */


