nrfconnect/sdk-hal_nordic/nrfx/mdk/nrf54l20_enga_types.h
/* EXTCTLOUT7 @Bit 7 : EXTCTL outputs. */
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT7_Pos (7UL)    /*!< Position of EXTCTLOUT7 field.                                        */
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT7_Msk (0x1UL << TPIU_EXTCTLOUTPORT_EXTCTLOUT7_Pos) /*!< Bit mask of EXTCTLOUT7 field.    */
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT7_Min (0x0UL)  /*!< Min enumerator value of EXTCTLOUT7 field.                            */
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT7_Max (0x1UL)  /*!< Max enumerator value of EXTCTLOUT7 field.                            */
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT7_Low (0x0UL)  /*!< Output EXTCTL7 is low.                                               */
  #define TPIU_EXTCTLOUTPORT_EXTCTLOUT7_High (0x1UL) /*!< Output EXTCTL7 is high.                                              */


/* TPIU_ITTRFLINACK: The ITTRFLINACK register enables control of the triginack and flushinack outputs from the TPIU. */
  #define TPIU_ITTRFLINACK_ResetValue (0x00000000UL) /*!< Reset value of ITTRFLINACK register.                                 */

/* TRIGINACK @Bit 0 : Sets the value of triginack. */
  #define TPIU_ITTRFLINACK_TRIGINACK_Pos (0UL)       /*!< Position of TRIGINACK field.                                         */
  #define TPIU_ITTRFLINACK_TRIGINACK_Msk (0x1UL << TPIU_ITTRFLINACK_TRIGINACK_Pos) /*!< Bit mask of TRIGINACK field.           */
  #define TPIU_ITTRFLINACK_TRIGINACK_Min (0x0UL)     /*!< Min enumerator value of TRIGINACK field.                             */
  #define TPIU_ITTRFLINACK_TRIGINACK_Max (0x1UL)     /*!< Max enumerator value of TRIGINACK field.                             */
  #define TPIU_ITTRFLINACK_TRIGINACK_Low (0x0UL)     /*!< Pin is logic 0.                                                      */
  #define TPIU_ITTRFLINACK_TRIGINACK_High (0x1UL)    /*!< Pin is logic 1.                                                      */

/* FLUSHINACK @Bit 1 : Sets the value of flushinack. */
  #define TPIU_ITTRFLINACK_FLUSHINACK_Pos (1UL)      /*!< Position of FLUSHINACK field.                                        */
  #define TPIU_ITTRFLINACK_FLUSHINACK_Msk (0x1UL << TPIU_ITTRFLINACK_FLUSHINACK_Pos) /*!< Bit mask of FLUSHINACK field.        */
  #define TPIU_ITTRFLINACK_FLUSHINACK_Min (0x0UL)    /*!< Min enumerator value of FLUSHINACK field.                            */
  #define TPIU_ITTRFLINACK_FLUSHINACK_Max (0x1UL)    /*!< Max enumerator value of FLUSHINACK field.                            */
  #define TPIU_ITTRFLINACK_FLUSHINACK_Low (0x0UL)    /*!< Pin is logic 0.                                                      */
  #define TPIU_ITTRFLINACK_FLUSHINACK_High (0x1UL)   /*!< Pin is logic 1.                                                      */


/* TPIU_ITTRFLIN: The ITTRFLIN register contains the values of the flushin and trigin inputs to the TPIU. */
  #define TPIU_ITTRFLIN_ResetValue (0x00000000UL)    /*!< Reset value of ITTRFLIN register.                                    */

/* TRIGIN @Bit 0 : Reads the value of trigin. */
  #define TPIU_ITTRFLIN_TRIGIN_Pos (0UL)             /*!< Position of TRIGIN field.                                            */
  #define TPIU_ITTRFLIN_TRIGIN_Msk (0x1UL << TPIU_ITTRFLIN_TRIGIN_Pos) /*!< Bit mask of TRIGIN field.                          */
  #define TPIU_ITTRFLIN_TRIGIN_Min (0x0UL)           /*!< Min enumerator value of TRIGIN field.                                */
  #define TPIU_ITTRFLIN_TRIGIN_Max (0x1UL)           /*!< Max enumerator value of TRIGIN field.                                */
  #define TPIU_ITTRFLIN_TRIGIN_Low (0x0UL)           /*!< Pin is logic 0.                                                      */
  #define TPIU_ITTRFLIN_TRIGIN_High (0x1UL)          /*!< Pin is logic 1.                                                      */

/* FLUSHIN @Bit 1 : Reads the value of flushin. */
  #define TPIU_ITTRFLIN_FLUSHIN_Pos (1UL)            /*!< Position of FLUSHIN field.                                           */
  #define TPIU_ITTRFLIN_FLUSHIN_Msk (0x1UL << TPIU_ITTRFLIN_FLUSHIN_Pos) /*!< Bit mask of FLUSHIN field.                       */
  #define TPIU_ITTRFLIN_FLUSHIN_Min (0x0UL)          /*!< Min enumerator value of FLUSHIN field.                               */
  #define TPIU_ITTRFLIN_FLUSHIN_Max (0x1UL)          /*!< Max enumerator value of FLUSHIN field.                               */
  #define TPIU_ITTRFLIN_FLUSHIN_Low (0x0UL)          /*!< Pin is logic 0.                                                      */
  #define TPIU_ITTRFLIN_FLUSHIN_High (0x1UL)         /*!< Pin is logic 1.                                                      */


/* TPIU_ITATBDATA0: The ITATBDATA0 register contains the value of the atdatas inputs to the TPIU. The values are valid only when
                     atvalids is HIGH. */

  #define TPIU_ITATBDATA0_ResetValue (0x00000000UL)  /*!< Reset value of ITATBDATA0 register.                                  */

/* ATDATA0 @Bit 0 : A read access returns the value of a pin on atdatas_x of the enabled port. A write access writes to the
                    corresponding atdatam pin of the enabled port. */

  #define TPIU_ITATBDATA0_ATDATA0_Pos (0UL)          /*!< Position of ATDATA0 field.                                           */
  #define TPIU_ITATBDATA0_ATDATA0_Msk (0x1UL << TPIU_ITATBDATA0_ATDATA0_Pos) /*!< Bit mask of ATDATA0 field.                   */
  #define TPIU_ITATBDATA0_ATDATA0_Min (0x0UL)        /*!< Min enumerator value of ATDATA0 field.                               */
  #define TPIU_ITATBDATA0_ATDATA0_Max (0x1UL)        /*!< Max enumerator value of ATDATA0 field.                               */
  #define TPIU_ITATBDATA0_ATDATA0_Low (0x0UL)        /*!< Pin is logic 0.                                                      */
  #define TPIU_ITATBDATA0_ATDATA0_High (0x1UL)       /*!< Pin is logic 1.                                                      */

/* ATDATA1 @Bit 1 : A read access returns the value of a pin on atdatas_x of the enabled port. A write access writes to the
                    corresponding atdatam pin of the enabled port. */

  #define TPIU_ITATBDATA0_ATDATA1_Pos (1UL)          /*!< Position of ATDATA1 field.                                           */
  #define TPIU_ITATBDATA0_ATDATA1_Msk (0x1UL << TPIU_ITATBDATA0_ATDATA1_Pos) /*!< Bit mask of ATDATA1 field.                   */
  #define TPIU_ITATBDATA0_ATDATA1_Min (0x0UL)        /*!< Min enumerator value of ATDATA1 field.                               */
  #define TPIU_ITATBDATA0_ATDATA1_Max (0x1UL)        /*!< Max enumerator value of ATDATA1 field.                               */
  #define TPIU_ITATBDATA0_ATDATA1_Low (0x0UL)        /*!< Pin is logic 0.                                                      */
  #define TPIU_ITATBDATA0_ATDATA1_High (0x1UL)       /*!< Pin is logic 1.                                                      */

