nrfconnect/sdk-hal_nordic/nrfx/mdk/nrf54l20_enga_types.h
/* NSNID @Bits 2..3 : Non-secure Non-Invasive Debug */
  #define TPIU_AUTHSTATUS_NSNID_Pos (2UL)            /*!< Position of NSNID field.                                             */
  #define TPIU_AUTHSTATUS_NSNID_Msk (0x3UL << TPIU_AUTHSTATUS_NSNID_Pos) /*!< Bit mask of NSNID field.                         */
  #define TPIU_AUTHSTATUS_NSNID_Min (0x0UL)          /*!< Min enumerator value of NSNID field.                                 */
  #define TPIU_AUTHSTATUS_NSNID_Max (0x1UL)          /*!< Max enumerator value of NSNID field.                                 */
  #define TPIU_AUTHSTATUS_NSNID_NotImplemented (0x0UL) /*!< The feature is not implemented.                                    */
  #define TPIU_AUTHSTATUS_NSNID_Implemented (0x1UL)  /*!< The feature is implemented.                                          */

/* SID @Bits 4..5 : Secure Invasive Debug */
  #define TPIU_AUTHSTATUS_SID_Pos (4UL)              /*!< Position of SID field.                                               */
  #define TPIU_AUTHSTATUS_SID_Msk (0x3UL << TPIU_AUTHSTATUS_SID_Pos) /*!< Bit mask of SID field.                               */
  #define TPIU_AUTHSTATUS_SID_Min (0x0UL)            /*!< Min enumerator value of SID field.                                   */
  #define TPIU_AUTHSTATUS_SID_Max (0x1UL)            /*!< Max enumerator value of SID field.                                   */
  #define TPIU_AUTHSTATUS_SID_NotImplemented (0x0UL) /*!< The feature is not implemented.                                      */
  #define TPIU_AUTHSTATUS_SID_Implemented (0x1UL)    /*!< The feature is implemented.                                          */

/* SNID @Bits 6..7 : Secure Non-Invasive Debug */
  #define TPIU_AUTHSTATUS_SNID_Pos (6UL)             /*!< Position of SNID field.                                              */
  #define TPIU_AUTHSTATUS_SNID_Msk (0x3UL << TPIU_AUTHSTATUS_SNID_Pos) /*!< Bit mask of SNID field.                            */
  #define TPIU_AUTHSTATUS_SNID_Min (0x0UL)           /*!< Min enumerator value of SNID field.                                  */
  #define TPIU_AUTHSTATUS_SNID_Max (0x1UL)           /*!< Max enumerator value of SNID field.                                  */
  #define TPIU_AUTHSTATUS_SNID_NotImplemented (0x0UL) /*!< The feature is not implemented.                                     */
  #define TPIU_AUTHSTATUS_SNID_Implemented (0x1UL)   /*!< The feature is implemented.                                          */


/* TPIU_DEVID: Indicates the capabilities of the component. */
  #define TPIU_DEVID_ResetValue (0x00000000UL)       /*!< Reset value of DEVID register.                                       */

/* MUXNUM @Bits 0..4 : Indicates the hidden level of input multiplexing. When non-zero, this value indicates the type of
                       multiplexing on the input to the ATB. Currently only 0x00 is supported, that is, no multiplexing is
                       present. This value helps detect the ATB structure. */

  #define TPIU_DEVID_MUXNUM_Pos (0UL)                /*!< Position of MUXNUM field.                                            */
  #define TPIU_DEVID_MUXNUM_Msk (0x1FUL << TPIU_DEVID_MUXNUM_Pos) /*!< Bit mask of MUXNUM field.                               */

/* CLKRELAT @Bit 5 : Indicates the relationship between atclk and traceclkin. */
  #define TPIU_DEVID_CLKRELAT_Pos (5UL)              /*!< Position of CLKRELAT field.                                          */
  #define TPIU_DEVID_CLKRELAT_Msk (0x1UL << TPIU_DEVID_CLKRELAT_Pos) /*!< Bit mask of CLKRELAT field.                          */
  #define TPIU_DEVID_CLKRELAT_Min (0x0UL)            /*!< Min enumerator value of CLKRELAT field.                              */
  #define TPIU_DEVID_CLKRELAT_Max (0x1UL)            /*!< Max enumerator value of CLKRELAT field.                              */
  #define TPIU_DEVID_CLKRELAT_Synchronous (0x0UL)    /*!< atclk and traceclkin are synchronous.                                */
  #define TPIU_DEVID_CLKRELAT_ASynchronous (0x1UL)   /*!< atclk and traceclkin are asynchronous.                               */

/* FIFOSIZE @Bits 6..8 : FIFO size in powers of 2. */
  #define TPIU_DEVID_FIFOSIZE_Pos (6UL)              /*!< Position of FIFOSIZE field.                                          */
  #define TPIU_DEVID_FIFOSIZE_Msk (0x7UL << TPIU_DEVID_FIFOSIZE_Pos) /*!< Bit mask of FIFOSIZE field.                          */
  #define TPIU_DEVID_FIFOSIZE_Min (0x2UL)            /*!< Min enumerator value of FIFOSIZE field.                              */
  #define TPIU_DEVID_FIFOSIZE_Max (0x2UL)            /*!< Max enumerator value of FIFOSIZE field.                              */
  #define TPIU_DEVID_FIFOSIZE_Entries4 (0x2UL)       /*!< FIFO size of 4 entries, that is, 16 bytes.                           */

/* TCLKDATA @Bit 9 : Indicates whether trace clock plus data is supported. */
  #define TPIU_DEVID_TCLKDATA_Pos (9UL)              /*!< Position of TCLKDATA field.                                          */
  #define TPIU_DEVID_TCLKDATA_Msk (0x1UL << TPIU_DEVID_TCLKDATA_Pos) /*!< Bit mask of TCLKDATA field.                          */
  #define TPIU_DEVID_TCLKDATA_Min (0x0UL)            /*!< Min enumerator value of TCLKDATA field.                              */
  #define TPIU_DEVID_TCLKDATA_Max (0x1UL)            /*!< Max enumerator value of TCLKDATA field.                              */
  #define TPIU_DEVID_TCLKDATA_Supported (0x0UL)      /*!< Trace clock and data is supported.                                   */
  #define TPIU_DEVID_TCLKDATA_NotSupported (0x1UL)   /*!< Trace clock and data is not supported.                               */

/* SWOMAN @Bit 10 : Indicates whether Serial Wire Output, Manchester encoded format, is supported. */
  #define TPIU_DEVID_SWOMAN_Pos (10UL)               /*!< Position of SWOMAN field.                                            */
  #define TPIU_DEVID_SWOMAN_Msk (0x1UL << TPIU_DEVID_SWOMAN_Pos) /*!< Bit mask of SWOMAN field.                                */
  #define TPIU_DEVID_SWOMAN_Min (0x0UL)              /*!< Min enumerator value of SWOMAN field.                                */
  #define TPIU_DEVID_SWOMAN_Max (0x1UL)              /*!< Max enumerator value of SWOMAN field.                                */
  #define TPIU_DEVID_SWOMAN_NotSupported (0x0UL)     /*!< Serial Wire Output, Manchester encoded format, is not supported.     */
  #define TPIU_DEVID_SWOMAN_Supported (0x1UL)        /*!< Serial Wire Output, Manchester encoded format, is supported.         */

/* SWOUARTNRZ @Bit 11 : Indicates whether Serial Wire Output, UART or NRZ, is supported. */
  #define TPIU_DEVID_SWOUARTNRZ_Pos (11UL)           /*!< Position of SWOUARTNRZ field.                                        */
  #define TPIU_DEVID_SWOUARTNRZ_Msk (0x1UL << TPIU_DEVID_SWOUARTNRZ_Pos) /*!< Bit mask of SWOUARTNRZ field.                    */
  #define TPIU_DEVID_SWOUARTNRZ_Min (0x0UL)          /*!< Min enumerator value of SWOUARTNRZ field.                            */
  #define TPIU_DEVID_SWOUARTNRZ_Max (0x1UL)          /*!< Max enumerator value of SWOUARTNRZ field.                            */
  #define TPIU_DEVID_SWOUARTNRZ_NotSupported (0x0UL) /*!< Serial Wire Output, UART or NRZ, is not supported.                   */
  #define TPIU_DEVID_SWOUARTNRZ_Supported (0x1UL)    /*!< Serial Wire Output, UART or NRZ, is supported.                       */


