nrfconnect/sdk-hal_nordic/nrfx/mdk/nrf54l20_enga_types.h
/* FRAMETIMEOUT @Bit 29 : Write '1' to disable interrupt for event FRAMETIMEOUT */
  #define UARTE_INTENCLR_FRAMETIMEOUT_Pos (29UL)     /*!< Position of FRAMETIMEOUT field.                                      */
  #define UARTE_INTENCLR_FRAMETIMEOUT_Msk (0x1UL << UARTE_INTENCLR_FRAMETIMEOUT_Pos) /*!< Bit mask of FRAMETIMEOUT field.      */
  #define UARTE_INTENCLR_FRAMETIMEOUT_Min (0x0UL)    /*!< Min enumerator value of FRAMETIMEOUT field.                          */
  #define UARTE_INTENCLR_FRAMETIMEOUT_Max (0x1UL)    /*!< Max enumerator value of FRAMETIMEOUT field.                          */
  #define UARTE_INTENCLR_FRAMETIMEOUT_Clear (0x1UL)  /*!< Disable                                                              */
  #define UARTE_INTENCLR_FRAMETIMEOUT_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define UARTE_INTENCLR_FRAMETIMEOUT_Enabled (0x1UL) /*!< Read: Enabled                                                       */


/* UARTE_ERRORSRC: Error source */
  #define UARTE_ERRORSRC_ResetValue (0x00000000UL)   /*!< Reset value of ERRORSRC register.                                    */

/* OVERRUN @Bit 0 : Overrun error */
  #define UARTE_ERRORSRC_OVERRUN_Pos (0UL)           /*!< Position of OVERRUN field.                                           */
  #define UARTE_ERRORSRC_OVERRUN_Msk (0x1UL << UARTE_ERRORSRC_OVERRUN_Pos) /*!< Bit mask of OVERRUN field.                     */
  #define UARTE_ERRORSRC_OVERRUN_Min (0x0UL)         /*!< Min enumerator value of OVERRUN field.                               */
  #define UARTE_ERRORSRC_OVERRUN_Max (0x1UL)         /*!< Max enumerator value of OVERRUN field.                               */
  #define UARTE_ERRORSRC_OVERRUN_NotPresent (0x0UL)  /*!< Read: error not present                                              */
  #define UARTE_ERRORSRC_OVERRUN_Present (0x1UL)     /*!< Read: error present                                                  */

/* PARITY @Bit 1 : Parity error */
  #define UARTE_ERRORSRC_PARITY_Pos (1UL)            /*!< Position of PARITY field.                                            */
  #define UARTE_ERRORSRC_PARITY_Msk (0x1UL << UARTE_ERRORSRC_PARITY_Pos) /*!< Bit mask of PARITY field.                        */
  #define UARTE_ERRORSRC_PARITY_Min (0x0UL)          /*!< Min enumerator value of PARITY field.                                */
  #define UARTE_ERRORSRC_PARITY_Max (0x1UL)          /*!< Max enumerator value of PARITY field.                                */
  #define UARTE_ERRORSRC_PARITY_NotPresent (0x0UL)   /*!< Read: error not present                                              */
  #define UARTE_ERRORSRC_PARITY_Present (0x1UL)      /*!< Read: error present                                                  */

/* FRAMING @Bit 2 : Framing error occurred */
  #define UARTE_ERRORSRC_FRAMING_Pos (2UL)           /*!< Position of FRAMING field.                                           */
  #define UARTE_ERRORSRC_FRAMING_Msk (0x1UL << UARTE_ERRORSRC_FRAMING_Pos) /*!< Bit mask of FRAMING field.                     */
  #define UARTE_ERRORSRC_FRAMING_Min (0x0UL)         /*!< Min enumerator value of FRAMING field.                               */
  #define UARTE_ERRORSRC_FRAMING_Max (0x1UL)         /*!< Max enumerator value of FRAMING field.                               */
  #define UARTE_ERRORSRC_FRAMING_NotPresent (0x0UL)  /*!< Read: error not present                                              */
  #define UARTE_ERRORSRC_FRAMING_Present (0x1UL)     /*!< Read: error present                                                  */

/* BREAK @Bit 3 : Break condition */
  #define UARTE_ERRORSRC_BREAK_Pos (3UL)             /*!< Position of BREAK field.                                             */
  #define UARTE_ERRORSRC_BREAK_Msk (0x1UL << UARTE_ERRORSRC_BREAK_Pos) /*!< Bit mask of BREAK field.                           */
  #define UARTE_ERRORSRC_BREAK_Min (0x0UL)           /*!< Min enumerator value of BREAK field.                                 */
  #define UARTE_ERRORSRC_BREAK_Max (0x1UL)           /*!< Max enumerator value of BREAK field.                                 */
  #define UARTE_ERRORSRC_BREAK_NotPresent (0x0UL)    /*!< Read: error not present                                              */
  #define UARTE_ERRORSRC_BREAK_Present (0x1UL)       /*!< Read: error present                                                  */


/* UARTE_ENABLE: Enable UART */
  #define UARTE_ENABLE_ResetValue (0x00000000UL)     /*!< Reset value of ENABLE register.                                      */

/* ENABLE @Bits 0..3 : Enable or disable UARTE */
  #define UARTE_ENABLE_ENABLE_Pos (0UL)              /*!< Position of ENABLE field.                                            */
  #define UARTE_ENABLE_ENABLE_Msk (0xFUL << UARTE_ENABLE_ENABLE_Pos) /*!< Bit mask of ENABLE field.                            */
  #define UARTE_ENABLE_ENABLE_Min (0x0UL)            /*!< Min enumerator value of ENABLE field.                                */
  #define UARTE_ENABLE_ENABLE_Max (0x8UL)            /*!< Max enumerator value of ENABLE field.                                */
  #define UARTE_ENABLE_ENABLE_Disabled (0x0UL)       /*!< Disable UARTE                                                        */
  #define UARTE_ENABLE_ENABLE_Enabled (0x8UL)        /*!< Enable UARTE                                                         */


/* UARTE_BAUDRATE: Baud rate. Accuracy depends on the HFCLK source selected. */
  #define UARTE_BAUDRATE_ResetValue (0x04000000UL)   /*!< Reset value of BAUDRATE register.                                    */

/* BAUDRATE @Bits 0..31 : Baud rate */
  #define UARTE_BAUDRATE_BAUDRATE_Pos (0UL)          /*!< Position of BAUDRATE field.                                          */
  #define UARTE_BAUDRATE_BAUDRATE_Msk (0xFFFFFFFFUL << UARTE_BAUDRATE_BAUDRATE_Pos) /*!< Bit mask of BAUDRATE field.           */
  #define UARTE_BAUDRATE_BAUDRATE_Min (0x4F000UL)    /*!< Min enumerator value of BAUDRATE field.                              */
  #define UARTE_BAUDRATE_BAUDRATE_Max (0x10000000UL) /*!< Max enumerator value of BAUDRATE field.                              */
  #define UARTE_BAUDRATE_BAUDRATE_Baud1200 (0x0004F000UL) /*!< 1200 baud (actual rate: 1205) when UARTE has 16 MHz peripheral
                                                               clock frequency*/
  #define UARTE_BAUDRATE_BAUDRATE_Baud2400 (0x0009D000UL) /*!< 2400 baud (actual rate: 2396) when UARTE has 16 MHz peripheral
                                                               clock frequency*/
  #define UARTE_BAUDRATE_BAUDRATE_Baud4800 (0x0013B000UL) /*!< 4800 baud (actual rate: 4808) when UARTE has 16 MHz peripheral
                                                               clock frequency*/
  #define UARTE_BAUDRATE_BAUDRATE_Baud9600 (0x00275000UL) /*!< 9600 baud (actual rate: 9598) when UARTE has 16 MHz peripheral
                                                               clock frequency*/
  #define UARTE_BAUDRATE_BAUDRATE_Baud14400 (0x003AF000UL) /*!< 14400 baud (actual rate: 14401) when UARTE has 16 MHz peripheral
                                                                clock frequency*/
  #define UARTE_BAUDRATE_BAUDRATE_Baud19200 (0x004EA000UL) /*!< 19200 baud (actual rate: 19208) when UARTE has 16 MHz peripheral
                                                                clock frequency*/
  #define UARTE_BAUDRATE_BAUDRATE_Baud28800 (0x0075C000UL) /*!< 28800 baud (actual rate: 28777) when UARTE has 16 MHz peripheral
                                                                clock frequency*/
  #define UARTE_BAUDRATE_BAUDRATE_Baud31250 (0x00800000UL) /*!< 31250 baud when UARTE has 16 MHz peripheral clock frequency    */
  #define UARTE_BAUDRATE_BAUDRATE_Baud38400 (0x009D0000UL) /*!< 38400 baud (actual rate: 38369) when UARTE has 16 MHz peripheral
                                                                clock frequency*/
  #define UARTE_BAUDRATE_BAUDRATE_Baud56000 (0x00E50000UL) /*!< 56000 baud (actual rate: 55944) when UARTE has 16 MHz peripheral
                                                                clock frequency*/
  #define UARTE_BAUDRATE_BAUDRATE_Baud57600 (0x00EB0000UL) /*!< 57600 baud (actual rate: 57554) when UARTE has 16 MHz peripheral
                                                                clock frequency*/
  #define UARTE_BAUDRATE_BAUDRATE_Baud76800 (0x013A9000UL) /*!< 76800 baud (actual rate: 76923) when UARTE has 16 MHz peripheral
                                                                clock frequency*/
  #define UARTE_BAUDRATE_BAUDRATE_Baud115200 (0x01D60000UL) /*!< 115200 baud (actual rate: 115108) when UARTE has 16 MHz
                                                                 peripheral clock frequency*/
  #define UARTE_BAUDRATE_BAUDRATE_Baud230400 (0x03B00000UL) /*!< 230400 baud (actual rate: 231884) when UARTE has 16 MHz
                                                                 peripheral clock frequency*/
  #define UARTE_BAUDRATE_BAUDRATE_Baud250000 (0x04000000UL) /*!< 250000 baud when UARTE has 16 MHz peripheral clock frequency  */
  #define UARTE_BAUDRATE_BAUDRATE_Baud460800 (0x07400000UL) /*!< 460800 baud (actual rate: 457143) when UARTE has 16 MHz
                                                                 peripheral clock frequency*/
  #define UARTE_BAUDRATE_BAUDRATE_Baud921600 (0x0F000000UL) /*!< 921600 baud (actual rate: 941176) when UARTE has 16 MHz
                                                                 peripheral clock frequency*/
  #define UARTE_BAUDRATE_BAUDRATE_Baud1M (0x10000000UL) /*!< 1 megabaud when UARTE has 16 MHz peripheral clock frequency       */


/* UARTE_CONFIG: Configuration of parity, hardware flow control, framesize, and packet timeout. */
  #define UARTE_CONFIG_ResetValue (0x00001000UL)     /*!< Reset value of CONFIG register.                                      */

/* HWFC @Bit 0 : Hardware flow control */
  #define UARTE_CONFIG_HWFC_Pos (0UL)                /*!< Position of HWFC field.                                              */
  #define UARTE_CONFIG_HWFC_Msk (0x1UL << UARTE_CONFIG_HWFC_Pos) /*!< Bit mask of HWFC field.                                  */
  #define UARTE_CONFIG_HWFC_Min (0x0UL)              /*!< Min enumerator value of HWFC field.                                  */
  #define UARTE_CONFIG_HWFC_Max (0x1UL)              /*!< Max enumerator value of HWFC field.                                  */
  #define UARTE_CONFIG_HWFC_Disabled (0x0UL)         /*!< Disabled                                                             */
  #define UARTE_CONFIG_HWFC_Enabled (0x1UL)          /*!< Enabled                                                              */

