nrfconnect/sdk-hal_nordic/nrfx/mdk/nrf54l20_enga_types.h
/* SLEEPM0 @Bit 26 : (unspecified) */
  #define USBHS_PHY_OVERRIDEVALUES_SLEEPM0_Pos (26UL) /*!< Position of SLEEPM0 field.                                          */
  #define USBHS_PHY_OVERRIDEVALUES_SLEEPM0_Msk (0x1UL << USBHS_PHY_OVERRIDEVALUES_SLEEPM0_Pos) /*!< Bit mask of SLEEPM0 field. */

/* VBUSVALID @Bit 30 : Signals to the PHY that VBUS is valid, and enables the pull-up resistor on D+ */
  #define USBHS_PHY_OVERRIDEVALUES_VBUSVALID_Pos (30UL) /*!< Position of VBUSVALID field.                                      */
  #define USBHS_PHY_OVERRIDEVALUES_VBUSVALID_Msk (0x1UL << USBHS_PHY_OVERRIDEVALUES_VBUSVALID_Pos) /*!< Bit mask of VBUSVALID
                                                                            field.*/
  #define USBHS_PHY_OVERRIDEVALUES_VBUSVALID_Min (0x0UL) /*!< Min enumerator value of VBUSVALID field.                         */
  #define USBHS_PHY_OVERRIDEVALUES_VBUSVALID_Max (0x1UL) /*!< Max enumerator value of VBUSVALID field.                         */
  #define USBHS_PHY_OVERRIDEVALUES_VBUSVALID_Valid (0x1UL) /*!< VBUS is valid, and the pull up resistor on D+ is enabled       */
  #define USBHS_PHY_OVERRIDEVALUES_VBUSVALID_NotValid (0x0UL) /*!< VBUS is not valid, and the pull up resistor on D+ is
                                                                   disabled.*/


/* USBHS_PHY_RTUNE: The RTUNE mode is an alternative method for calibrating the DP and DM 45-Ohm source impedance. */
  #define USBHS_PHY_RTUNE_ResetValue (0x0000000FUL)  /*!< Reset value of RTUNE register.                                       */

/* RTUNESEL @Bit 0 : This signal selects the tuning method for the high-speed DP and DM source impedance of the USBHS. */
  #define USBHS_PHY_RTUNE_RTUNESEL_Pos (0UL)         /*!< Position of RTUNESEL field.                                          */
  #define USBHS_PHY_RTUNE_RTUNESEL_Msk (0x1UL << USBHS_PHY_RTUNE_RTUNESEL_Pos) /*!< Bit mask of RTUNESEL field.                */
  #define USBHS_PHY_RTUNE_RTUNESEL_Min (0x0UL)       /*!< Min enumerator value of RTUNESEL field.                              */
  #define USBHS_PHY_RTUNE_RTUNESEL_Max (0x1UL)       /*!< Max enumerator value of RTUNESEL field.                              */
  #define USBHS_PHY_RTUNE_RTUNESEL_TXRTUNE (0x1UL)   /*!< The TXRTUNE pin, external resistor REXT, and resulting internal
                                                          digital calibration code are used for tuning the high-speed source
                                                          impedance.*/
  #define USBHS_PHY_RTUNE_RTUNESEL_RTUNE (0x0UL)     /*!< The RCALCODE value is used for tuning the high-speed source
                                                          impedance.*/

/* RCALCODE @Bits 1..4 : This signal is used to tune the internal 200 ohm resistor or the USBHS DP and DM high-speed source
                         impedance. */

  #define USBHS_PHY_RTUNE_RCALCODE_Pos (1UL)         /*!< Position of RCALCODE field.                                          */
  #define USBHS_PHY_RTUNE_RCALCODE_Msk (0xFUL << USBHS_PHY_RTUNE_RCALCODE_Pos) /*!< Bit mask of RCALCODE field.                */


/* ====================================================== Struct USBHS ======================================================= */
/**
  * @brief USBHS
  */
  typedef struct {                                   /*!< USBHS Structure                                                      */
    __OM uint32_t TASKS_START;                       /*!< (@ 0x00000000) Start the USB peripheral.                             */
    __OM uint32_t TASKS_STOP;                        /*!< (@ 0x00000004) Stop the USB peripheral                               */
    __IM uint32_t RESERVED[30];
    __IOM uint32_t SUBSCRIBE_START;                  /*!< (@ 0x00000080) Subscribe configuration for task START                */
    __IOM uint32_t SUBSCRIBE_STOP;                   /*!< (@ 0x00000084) Subscribe configuration for task STOP                 */
    __IM uint32_t RESERVED1[30];
    __IOM uint32_t EVENTS_SOF;                       /*!< (@ 0x00000100) Start of Frame.                                       */
    __IM uint32_t RESERVED2[31];
    __IOM uint32_t PUBLISH_SOF;                      /*!< (@ 0x00000180) Publish configuration for event SOF                   */
    __IM uint32_t RESERVED3[96];
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t RESERVED4[61];
    __IOM uint32_t ENABLE;                           /*!< (@ 0x00000400) Enable USB peripheral.                                */
    __IM uint32_t RESERVED5[15];
    __IOM NRF_USBHS_PHY_Type PHY;                    /*!< (@ 0x00000440) (unspecified)                                         */
  } NRF_USBHS_Type;                                  /*!< Size = 1128 (0x468)                                                  */

/* USBHS_TASKS_START: Start the USB peripheral. */
  #define USBHS_TASKS_START_ResetValue (0x00000000UL) /*!< Reset value of TASKS_START register.                                */

/* TASKS_START @Bit 0 : Start the USB peripheral. */
  #define USBHS_TASKS_START_TASKS_START_Pos (0UL)    /*!< Position of TASKS_START field.                                       */
  #define USBHS_TASKS_START_TASKS_START_Msk (0x1UL << USBHS_TASKS_START_TASKS_START_Pos) /*!< Bit mask of TASKS_START field.   */
  #define USBHS_TASKS_START_TASKS_START_Min (0x1UL)  /*!< Min enumerator value of TASKS_START field.                           */
  #define USBHS_TASKS_START_TASKS_START_Max (0x1UL)  /*!< Max enumerator value of TASKS_START field.                           */
  #define USBHS_TASKS_START_TASKS_START_Trigger (0x1UL) /*!< Trigger task                                                      */


/* USBHS_TASKS_STOP: Stop the USB peripheral */
  #define USBHS_TASKS_STOP_ResetValue (0x00000000UL) /*!< Reset value of TASKS_STOP register.                                  */

