nrfconnect/sdk-hal_nordic/nrfx/mdk/nrf54l20_enga_types.h
/* TASKS_STOP @Bit 0 : Stop the USB peripheral */
  #define USBHS_TASKS_STOP_TASKS_STOP_Pos (0UL)      /*!< Position of TASKS_STOP field.                                        */
  #define USBHS_TASKS_STOP_TASKS_STOP_Msk (0x1UL << USBHS_TASKS_STOP_TASKS_STOP_Pos) /*!< Bit mask of TASKS_STOP field.        */
  #define USBHS_TASKS_STOP_TASKS_STOP_Min (0x1UL)    /*!< Min enumerator value of TASKS_STOP field.                            */
  #define USBHS_TASKS_STOP_TASKS_STOP_Max (0x1UL)    /*!< Max enumerator value of TASKS_STOP field.                            */
  #define USBHS_TASKS_STOP_TASKS_STOP_Trigger (0x1UL) /*!< Trigger task                                                        */


/* USBHS_SUBSCRIBE_START: Subscribe configuration for task START */
  #define USBHS_SUBSCRIBE_START_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_START register.                        */

/* CHIDX @Bits 0..7 : DPPI channel that task START will subscribe to */
  #define USBHS_SUBSCRIBE_START_CHIDX_Pos (0UL)      /*!< Position of CHIDX field.                                             */
  #define USBHS_SUBSCRIBE_START_CHIDX_Msk (0xFFUL << USBHS_SUBSCRIBE_START_CHIDX_Pos) /*!< Bit mask of CHIDX field.            */
  #define USBHS_SUBSCRIBE_START_CHIDX_Min (0x00UL)   /*!< Min value of CHIDX field.                                            */
  #define USBHS_SUBSCRIBE_START_CHIDX_Max (0xFFUL)   /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define USBHS_SUBSCRIBE_START_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define USBHS_SUBSCRIBE_START_EN_Msk (0x1UL << USBHS_SUBSCRIBE_START_EN_Pos) /*!< Bit mask of EN field.                      */
  #define USBHS_SUBSCRIBE_START_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define USBHS_SUBSCRIBE_START_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define USBHS_SUBSCRIBE_START_EN_Disabled (0x0UL)  /*!< Disable subscription                                                 */
  #define USBHS_SUBSCRIBE_START_EN_Enabled (0x1UL)   /*!< Enable subscription                                                  */


/* USBHS_SUBSCRIBE_STOP: Subscribe configuration for task STOP */
  #define USBHS_SUBSCRIBE_STOP_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_STOP register.                          */

/* CHIDX @Bits 0..7 : DPPI channel that task STOP will subscribe to */
  #define USBHS_SUBSCRIBE_STOP_CHIDX_Pos (0UL)       /*!< Position of CHIDX field.                                             */
  #define USBHS_SUBSCRIBE_STOP_CHIDX_Msk (0xFFUL << USBHS_SUBSCRIBE_STOP_CHIDX_Pos) /*!< Bit mask of CHIDX field.              */
  #define USBHS_SUBSCRIBE_STOP_CHIDX_Min (0x00UL)    /*!< Min value of CHIDX field.                                            */
  #define USBHS_SUBSCRIBE_STOP_CHIDX_Max (0xFFUL)    /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define USBHS_SUBSCRIBE_STOP_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define USBHS_SUBSCRIBE_STOP_EN_Msk (0x1UL << USBHS_SUBSCRIBE_STOP_EN_Pos) /*!< Bit mask of EN field.                        */
  #define USBHS_SUBSCRIBE_STOP_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define USBHS_SUBSCRIBE_STOP_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define USBHS_SUBSCRIBE_STOP_EN_Disabled (0x0UL)   /*!< Disable subscription                                                 */
  #define USBHS_SUBSCRIBE_STOP_EN_Enabled (0x1UL)    /*!< Enable subscription                                                  */


/* USBHS_EVENTS_SOF: Start of Frame. */
  #define USBHS_EVENTS_SOF_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_SOF register.                                  */

/* EVENTS_SOF @Bit 0 : Start of Frame. */
  #define USBHS_EVENTS_SOF_EVENTS_SOF_Pos (0UL)      /*!< Position of EVENTS_SOF field.                                        */
  #define USBHS_EVENTS_SOF_EVENTS_SOF_Msk (0x1UL << USBHS_EVENTS_SOF_EVENTS_SOF_Pos) /*!< Bit mask of EVENTS_SOF field.        */
  #define USBHS_EVENTS_SOF_EVENTS_SOF_Min (0x0UL)    /*!< Min enumerator value of EVENTS_SOF field.                            */
  #define USBHS_EVENTS_SOF_EVENTS_SOF_Max (0x1UL)    /*!< Max enumerator value of EVENTS_SOF field.                            */
  #define USBHS_EVENTS_SOF_EVENTS_SOF_NotGenerated (0x0UL) /*!< Event not generated                                            */
  #define USBHS_EVENTS_SOF_EVENTS_SOF_Generated (0x1UL) /*!< Event generated                                                   */


/* USBHS_PUBLISH_SOF: Publish configuration for event SOF */
  #define USBHS_PUBLISH_SOF_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_SOF register.                                */

/* CHIDX @Bits 0..7 : DPPI channel that event SOF will publish to */
  #define USBHS_PUBLISH_SOF_CHIDX_Pos (0UL)          /*!< Position of CHIDX field.                                             */
  #define USBHS_PUBLISH_SOF_CHIDX_Msk (0xFFUL << USBHS_PUBLISH_SOF_CHIDX_Pos) /*!< Bit mask of CHIDX field.                    */
  #define USBHS_PUBLISH_SOF_CHIDX_Min (0x00UL)       /*!< Min value of CHIDX field.                                            */
  #define USBHS_PUBLISH_SOF_CHIDX_Max (0xFFUL)       /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define USBHS_PUBLISH_SOF_EN_Pos (31UL)            /*!< Position of EN field.                                                */
  #define USBHS_PUBLISH_SOF_EN_Msk (0x1UL << USBHS_PUBLISH_SOF_EN_Pos) /*!< Bit mask of EN field.                              */
  #define USBHS_PUBLISH_SOF_EN_Min (0x0UL)           /*!< Min enumerator value of EN field.                                    */
  #define USBHS_PUBLISH_SOF_EN_Max (0x1UL)           /*!< Max enumerator value of EN field.                                    */
  #define USBHS_PUBLISH_SOF_EN_Disabled (0x0UL)      /*!< Disable publishing                                                   */
  #define USBHS_PUBLISH_SOF_EN_Enabled (0x1UL)       /*!< Enable publishing                                                    */


/* USBHS_INTENSET: Enable interrupt */
  #define USBHS_INTENSET_ResetValue (0x00000000UL)   /*!< Reset value of INTENSET register.                                    */

/* SOF @Bit 0 : Write '1' to enable interrupt for event SOF */
  #define USBHS_INTENSET_SOF_Pos (0UL)               /*!< Position of SOF field.                                               */
  #define USBHS_INTENSET_SOF_Msk (0x1UL << USBHS_INTENSET_SOF_Pos) /*!< Bit mask of SOF field.                                 */
  #define USBHS_INTENSET_SOF_Min (0x0UL)             /*!< Min enumerator value of SOF field.                                   */
  #define USBHS_INTENSET_SOF_Max (0x1UL)             /*!< Max enumerator value of SOF field.                                   */
  #define USBHS_INTENSET_SOF_Set (0x1UL)             /*!< Enable                                                               */
  #define USBHS_INTENSET_SOF_Disabled (0x0UL)        /*!< Read: Disabled                                                       */
  #define USBHS_INTENSET_SOF_Enabled (0x1UL)         /*!< Read: Enabled                                                        */


/* USBHS_INTENCLR: Disable interrupt */
  #define USBHS_INTENCLR_ResetValue (0x00000000UL)   /*!< Reset value of INTENCLR register.                                    */

/* SOF @Bit 0 : Write '1' to disable interrupt for event SOF */
  #define USBHS_INTENCLR_SOF_Pos (0UL)               /*!< Position of SOF field.                                               */
  #define USBHS_INTENCLR_SOF_Msk (0x1UL << USBHS_INTENCLR_SOF_Pos) /*!< Bit mask of SOF field.                                 */
  #define USBHS_INTENCLR_SOF_Min (0x0UL)             /*!< Min enumerator value of SOF field.                                   */
  #define USBHS_INTENCLR_SOF_Max (0x1UL)             /*!< Max enumerator value of SOF field.                                   */
  #define USBHS_INTENCLR_SOF_Clear (0x1UL)           /*!< Disable                                                              */
  #define USBHS_INTENCLR_SOF_Disabled (0x0UL)        /*!< Read: Disabled                                                       */
  #define USBHS_INTENCLR_SOF_Enabled (0x1UL)         /*!< Read: Enabled                                                        */


/* USBHS_ENABLE: Enable USB peripheral. */
  #define USBHS_ENABLE_ResetValue (0x00000000UL)     /*!< Reset value of ENABLE register.                                      */

/* CORE @Bit 0 : Enable USB Controller */
  #define USBHS_ENABLE_CORE_Pos (0UL)                /*!< Position of CORE field.                                              */
  #define USBHS_ENABLE_CORE_Msk (0x1UL << USBHS_ENABLE_CORE_Pos) /*!< Bit mask of CORE field.                                  */
  #define USBHS_ENABLE_CORE_Min (0x0UL)              /*!< Min enumerator value of CORE field.                                  */
  #define USBHS_ENABLE_CORE_Max (0x1UL)              /*!< Max enumerator value of CORE field.                                  */
  #define USBHS_ENABLE_CORE_Disabled (0x0UL)         /*!< USB Controller disabled.                                             */
  #define USBHS_ENABLE_CORE_Enabled (0x1UL)          /*!< USB Controller enabled.                                              */

/* PHY @Bit 1 : Enable USB PHY */
  #define USBHS_ENABLE_PHY_Pos (1UL)                 /*!< Position of PHY field.                                               */
  #define USBHS_ENABLE_PHY_Msk (0x1UL << USBHS_ENABLE_PHY_Pos) /*!< Bit mask of PHY field.                                     */
  #define USBHS_ENABLE_PHY_Min (0x0UL)               /*!< Min enumerator value of PHY field.                                   */
  #define USBHS_ENABLE_PHY_Max (0x1UL)               /*!< Max enumerator value of PHY field.                                   */
  #define USBHS_ENABLE_PHY_Disabled (0x0UL)          /*!< USB PHY disabled.                                                    */
  #define USBHS_ENABLE_PHY_Enabled (0x1UL)           /*!< USB PHY enabled.                                                     */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                         USBHSCORE                                         ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

