nrfconnect/sdk-hal_nordic/nrfx/mdk/nrf54l20_enga_types.h
    __IOM uint32_t DOEPCTL13;                        /*!< (@ 0x00000CA0) Device Control OUT Endpoint Control Register          */
    __IM uint32_t RESERVED68;
    __IOM uint32_t DOEPINT13;                        /*!< (@ 0x00000CA8) Device OUT Endpoint Interrupt Register                */
    __IM uint32_t RESERVED69;
    __IOM uint32_t DOEPTSIZ13;                       /*!< (@ 0x00000CB0) Device OUT Endpoint Transfer Size Register            */
    __IOM uint32_t DOEPDMA13;                        /*!< (@ 0x00000CB4) Device OUT Endpoint DMA Address Register              */
    __IM uint32_t RESERVED70[2];
    __IOM uint32_t DOEPCTL14;                        /*!< (@ 0x00000CC0) Device Control OUT Endpoint Control Register          */
    __IM uint32_t RESERVED71;
    __IOM uint32_t DOEPINT14;                        /*!< (@ 0x00000CC8) Device OUT Endpoint Interrupt Register                */
    __IM uint32_t RESERVED72;
    __IOM uint32_t DOEPTSIZ14;                       /*!< (@ 0x00000CD0) Device OUT Endpoint Transfer Size Register            */
    __IOM uint32_t DOEPDMA14;                        /*!< (@ 0x00000CD4) Device OUT Endpoint DMA Address Register              */
    __IM uint32_t RESERVED73[2];
    __IOM uint32_t DOEPCTL15;                        /*!< (@ 0x00000CE0) Device Control OUT Endpoint Control Register          */
    __IM uint32_t RESERVED74;
    __IOM uint32_t DOEPINT15;                        /*!< (@ 0x00000CE8) Device OUT Endpoint Interrupt Register                */
    __IM uint32_t RESERVED75;
    __IOM uint32_t DOEPTSIZ15;                       /*!< (@ 0x00000CF0) Device OUT Endpoint Transfer Size Register            */
    __IOM uint32_t DOEPDMA15;                        /*!< (@ 0x00000CF4) Device OUT Endpoint DMA Address Register              */
    __IM uint32_t RESERVED76[66];
    __IOM uint32_t PCGCCTL;                          /*!< (@ 0x00000E00) Power and Clock Gating Control Register               */
    __IM uint32_t RESERVED77[63];
    __IOM uint32_t GSTARFXDIS;                       /*!< (@ 0x00000F00) Global STAR Fix Disable Register                      */
    __IM uint32_t RESERVED78[63];
    __IOM NRF_USBHSCORE_DWCOTGDFIFO_Type DWCOTGDFIFO[16]; /*!< (@ 0x00001000) (unspecified)                                    */
    __IM uint32_t RESERVED79[15360];
    __IOM NRF_USBHSCORE_DWCOTGDFIFODIRECTACCESS_Type DWCOTGDFIFODIRECTACCESS; /*!< (@ 0x00020000) (unspecified)                */
  } NRF_USBHSCORE_Type;                              /*!< Size = 262144 (0x40000)                                              */

/* USBHSCORE_GOTGCTL: Control and Status Register */
  #define USBHSCORE_GOTGCTL_ResetValue (0x000D0000UL) /*!< Reset value of GOTGCTL register.                                    */

/* VBVALIDOVEN @Bit 2 : Mode: Host only. VBUS Valid Override Enable (VbvalidOvEn) */
  #define USBHSCORE_GOTGCTL_VBVALIDOVEN_Pos (2UL)    /*!< Position of VBVALIDOVEN field.                                       */
  #define USBHSCORE_GOTGCTL_VBVALIDOVEN_Msk (0x1UL << USBHSCORE_GOTGCTL_VBVALIDOVEN_Pos) /*!< Bit mask of VBVALIDOVEN field.   */
  #define USBHSCORE_GOTGCTL_VBVALIDOVEN_Min (0x0UL)  /*!< Min enumerator value of VBVALIDOVEN field.                           */
  #define USBHSCORE_GOTGCTL_VBVALIDOVEN_Max (0x1UL)  /*!< Max enumerator value of VBVALIDOVEN field.                           */
  #define USBHSCORE_GOTGCTL_VBVALIDOVEN_DISABLED (0x0UL) /*!< Override is disabled and bvalid signal from the respective PHY
                                                              selected is used internally by the controller*/
  #define USBHSCORE_GOTGCTL_VBVALIDOVEN_ENABLED (0x1UL) /*!< The vbus-valid signal received from the PHY is overridden with
                                                             GOTGCTL.VbvalidOvVal*/

/* VBVALIDOVVAL @Bit 3 : Mode: Host only. VBUS Valid OverrideValue (VbvalidOvVal) */
  #define USBHSCORE_GOTGCTL_VBVALIDOVVAL_Pos (3UL)   /*!< Position of VBVALIDOVVAL field.                                      */
  #define USBHSCORE_GOTGCTL_VBVALIDOVVAL_Msk (0x1UL << USBHSCORE_GOTGCTL_VBVALIDOVVAL_Pos) /*!< Bit mask of VBVALIDOVVAL field.*/
  #define USBHSCORE_GOTGCTL_VBVALIDOVVAL_Min (0x0UL) /*!< Min enumerator value of VBVALIDOVVAL field.                          */
  #define USBHSCORE_GOTGCTL_VBVALIDOVVAL_Max (0x1UL) /*!< Max enumerator value of VBVALIDOVVAL field.                          */
  #define USBHSCORE_GOTGCTL_VBVALIDOVVAL_SET0 (0x0UL) /*!< vbusvalid value when GOTGCTL.VbvalidOvEn = 1                        */
  #define USBHSCORE_GOTGCTL_VBVALIDOVVAL_SET1 (0x1UL) /*!< vbusvalid value when GOTGCTL.VbvalidOvEn is 1                       */

/* AVALIDOVEN @Bit 4 : Mode: Host only. A-Peripheral Session Valid Override Enable (AvalidOvEn) */
  #define USBHSCORE_GOTGCTL_AVALIDOVEN_Pos (4UL)     /*!< Position of AVALIDOVEN field.                                        */
  #define USBHSCORE_GOTGCTL_AVALIDOVEN_Msk (0x1UL << USBHSCORE_GOTGCTL_AVALIDOVEN_Pos) /*!< Bit mask of AVALIDOVEN field.      */
  #define USBHSCORE_GOTGCTL_AVALIDOVEN_Min (0x0UL)   /*!< Min enumerator value of AVALIDOVEN field.                            */
  #define USBHSCORE_GOTGCTL_AVALIDOVEN_Max (0x1UL)   /*!< Max enumerator value of AVALIDOVEN field.                            */
  #define USBHSCORE_GOTGCTL_AVALIDOVEN_DISABLED (0x0UL) /*!< Derive AValid from PHY                                            */
  #define USBHSCORE_GOTGCTL_AVALIDOVEN_ENABLED (0x1UL) /*!< Derive Avalid from GOTGCTL.AvalidOvVal                             */

/* AVALIDOVVAL @Bit 5 : Mode: Host only. A-Peripheral Session Valid OverrideValue (AvalidOvVal) */
  #define USBHSCORE_GOTGCTL_AVALIDOVVAL_Pos (5UL)    /*!< Position of AVALIDOVVAL field.                                       */
  #define USBHSCORE_GOTGCTL_AVALIDOVVAL_Msk (0x1UL << USBHSCORE_GOTGCTL_AVALIDOVVAL_Pos) /*!< Bit mask of AVALIDOVVAL field.   */
  #define USBHSCORE_GOTGCTL_AVALIDOVVAL_Min (0x0UL)  /*!< Min enumerator value of AVALIDOVVAL field.                           */
  #define USBHSCORE_GOTGCTL_AVALIDOVVAL_Max (0x1UL)  /*!< Max enumerator value of AVALIDOVVAL field.                           */
  #define USBHSCORE_GOTGCTL_AVALIDOVVAL_VALUE0 (0x0UL) /*!< Avalid value is 1'b0 when GOTGCTL.AvalidOvEn =1                    */
  #define USBHSCORE_GOTGCTL_AVALIDOVVAL_VALUE1 (0x1UL) /*!< Avalid value is 1'b1 when GOTGCTL.AvalidOvEn =1                    */

/* BVALIDOVEN @Bit 6 : Mode: Device only. B-Peripheral Session Valid Override Value (BvalidOvEn) */
  #define USBHSCORE_GOTGCTL_BVALIDOVEN_Pos (6UL)     /*!< Position of BVALIDOVEN field.                                        */
  #define USBHSCORE_GOTGCTL_BVALIDOVEN_Msk (0x1UL << USBHSCORE_GOTGCTL_BVALIDOVEN_Pos) /*!< Bit mask of BVALIDOVEN field.      */
  #define USBHSCORE_GOTGCTL_BVALIDOVEN_Min (0x0UL)   /*!< Min enumerator value of BVALIDOVEN field.                            */
  #define USBHSCORE_GOTGCTL_BVALIDOVEN_Max (0x1UL)   /*!< Max enumerator value of BVALIDOVEN field.                            */
  #define USBHSCORE_GOTGCTL_BVALIDOVEN_DISABLED (0x0UL) /*!< Override is disabled and bvalid signal from the respective PHY
                                                             selected is used internally by the core*/
  #define USBHSCORE_GOTGCTL_BVALIDOVEN_ENABLED (0x1UL) /*!< Internally Bvalid received from the PHY is overridden with
                                                            GOTGCTL.BvalidOvVal*/

/* BVALIDOVVAL @Bit 7 : Mode: Device only. B-Peripheral Session Valid OverrideValue (BvalidOvVal) */
  #define USBHSCORE_GOTGCTL_BVALIDOVVAL_Pos (7UL)    /*!< Position of BVALIDOVVAL field.                                       */
  #define USBHSCORE_GOTGCTL_BVALIDOVVAL_Msk (0x1UL << USBHSCORE_GOTGCTL_BVALIDOVVAL_Pos) /*!< Bit mask of BVALIDOVVAL field.   */
  #define USBHSCORE_GOTGCTL_BVALIDOVVAL_Min (0x0UL)  /*!< Min enumerator value of BVALIDOVVAL field.                           */
  #define USBHSCORE_GOTGCTL_BVALIDOVVAL_Max (0x1UL)  /*!< Max enumerator value of BVALIDOVVAL field.                           */
  #define USBHSCORE_GOTGCTL_BVALIDOVVAL_VALUE0 (0x0UL) /*!< Bvalid value when GOTGCTL.BvalidOvEn =1                            */
  #define USBHSCORE_GOTGCTL_BVALIDOVVAL_VALUE1 (0x1UL) /*!< Bvalid value when GOTGCTL.BvalidOvEn =1                            */

/* DBNCEFLTRBYPASS @Bit 15 : Mode: Host and Device. Debounce Filter Bypass */
  #define USBHSCORE_GOTGCTL_DBNCEFLTRBYPASS_Pos (15UL) /*!< Position of DBNCEFLTRBYPASS field.                                 */
  #define USBHSCORE_GOTGCTL_DBNCEFLTRBYPASS_Msk (0x1UL << USBHSCORE_GOTGCTL_DBNCEFLTRBYPASS_Pos) /*!< Bit mask of
                                                                            DBNCEFLTRBYPASS field.*/
  #define USBHSCORE_GOTGCTL_DBNCEFLTRBYPASS_Min (0x0UL) /*!< Min enumerator value of DBNCEFLTRBYPASS field.                    */
  #define USBHSCORE_GOTGCTL_DBNCEFLTRBYPASS_Max (0x1UL) /*!< Max enumerator value of DBNCEFLTRBYPASS field.                    */
  #define USBHSCORE_GOTGCTL_DBNCEFLTRBYPASS_DISABLED (0x0UL) /*!< Debounce Filter Bypass is disabled.                          */
  #define USBHSCORE_GOTGCTL_DBNCEFLTRBYPASS_ENABLED (0x1UL) /*!< Debounce Filter Bypass is enabled.                            */

/* CONIDSTS @Bit 16 : Mode: Host and Device. Connector ID Status (ConIDSts) */
  #define USBHSCORE_GOTGCTL_CONIDSTS_Pos (16UL)      /*!< Position of CONIDSTS field.                                          */
  #define USBHSCORE_GOTGCTL_CONIDSTS_Msk (0x1UL << USBHSCORE_GOTGCTL_CONIDSTS_Pos) /*!< Bit mask of CONIDSTS field.            */
  #define USBHSCORE_GOTGCTL_CONIDSTS_Min (0x0UL)     /*!< Min enumerator value of CONIDSTS field.                              */
  #define USBHSCORE_GOTGCTL_CONIDSTS_Max (0x1UL)     /*!< Max enumerator value of CONIDSTS field.                              */
  #define USBHSCORE_GOTGCTL_CONIDSTS_MODEA (0x0UL)   /*!< The core is in A-Device mode.                                        */
  #define USBHSCORE_GOTGCTL_CONIDSTS_MODEB (0x1UL)   /*!< The core is in B-Device mode.                                        */

