nrfconnect/sdk-hal_nordic/nrfx/mdk/nrf54l20_enga_types.h
/* LPMENBESL @Bit 28 : LPM Enable BESL (LPM_EnBESL) */
  #define USBHSCORE_GLPMCFG_LPMENBESL_Pos (28UL)     /*!< Position of LPMENBESL field.                                         */
  #define USBHSCORE_GLPMCFG_LPMENBESL_Msk (0x1UL << USBHSCORE_GLPMCFG_LPMENBESL_Pos) /*!< Bit mask of LPMENBESL field.         */
  #define USBHSCORE_GLPMCFG_LPMENBESL_Min (0x0UL)    /*!< Min enumerator value of LPMENBESL field.                             */
  #define USBHSCORE_GLPMCFG_LPMENBESL_Max (0x1UL)    /*!< Max enumerator value of LPMENBESL field.                             */
  #define USBHSCORE_GLPMCFG_LPMENBESL_DISABLED (0x0UL) /*!< BESL is disabled                                                   */
  #define USBHSCORE_GLPMCFG_LPMENBESL_ENABLED (0x1UL) /*!< BESL is enabled as defined in LPM Errata                            */

/* LPMRESTORESLPSTS @Bit 29 : LPM Restore Sleep Status (LPM_RestoreSlpSts) */
  #define USBHSCORE_GLPMCFG_LPMRESTORESLPSTS_Pos (29UL) /*!< Position of LPMRESTORESLPSTS field.                               */
  #define USBHSCORE_GLPMCFG_LPMRESTORESLPSTS_Msk (0x1UL << USBHSCORE_GLPMCFG_LPMRESTORESLPSTS_Pos) /*!< Bit mask of
                                                                            LPMRESTORESLPSTS field.*/
  #define USBHSCORE_GLPMCFG_LPMRESTORESLPSTS_Min (0x0UL) /*!< Min enumerator value of LPMRESTORESLPSTS field.                  */
  #define USBHSCORE_GLPMCFG_LPMRESTORESLPSTS_Max (0x1UL) /*!< Max enumerator value of LPMRESTORESLPSTS field.                  */
  #define USBHSCORE_GLPMCFG_LPMRESTORESLPSTS_DISABLED (0x0UL) /*!< Puts the core in Shallow Sleep mode based on the BESL value
                                                                   from the Host*/
  #define USBHSCORE_GLPMCFG_LPMRESTORESLPSTS_ENABLED (0x1UL) /*!< Puts the core in Deep Sleep mode based on the BESL value from
                                                                  the Host*/


/* USBHSCORE_GPWRDN: Global Power Down Register */
  #define USBHSCORE_GPWRDN_ResetValue (0x00000010UL) /*!< Reset value of GPWRDN register.                                      */

/* PMUINTSEL @Bit 0 : PMU Interrupt Select (PMUIntSel) */
  #define USBHSCORE_GPWRDN_PMUINTSEL_Pos (0UL)       /*!< Position of PMUINTSEL field.                                         */
  #define USBHSCORE_GPWRDN_PMUINTSEL_Msk (0x1UL << USBHSCORE_GPWRDN_PMUINTSEL_Pos) /*!< Bit mask of PMUINTSEL field.           */
  #define USBHSCORE_GPWRDN_PMUINTSEL_Min (0x0UL)     /*!< Min enumerator value of PMUINTSEL field.                             */
  #define USBHSCORE_GPWRDN_PMUINTSEL_Max (0x1UL)     /*!< Max enumerator value of PMUINTSEL field.                             */
  #define USBHSCORE_GPWRDN_PMUINTSEL_DISABLE (0x0UL) /*!< Internal DWC_otg_core interrupt is selected                          */
  #define USBHSCORE_GPWRDN_PMUINTSEL_ENABLE (0x1UL)  /*!< External DWC_otg_pmu interrupt is selected                           */

/* PMUACTV @Bit 1 : PMU Active (PMUActv) */
  #define USBHSCORE_GPWRDN_PMUACTV_Pos (1UL)         /*!< Position of PMUACTV field.                                           */
  #define USBHSCORE_GPWRDN_PMUACTV_Msk (0x1UL << USBHSCORE_GPWRDN_PMUACTV_Pos) /*!< Bit mask of PMUACTV field.                 */
  #define USBHSCORE_GPWRDN_PMUACTV_Min (0x0UL)       /*!< Min enumerator value of PMUACTV field.                               */
  #define USBHSCORE_GPWRDN_PMUACTV_Max (0x1UL)       /*!< Max enumerator value of PMUACTV field.                               */
  #define USBHSCORE_GPWRDN_PMUACTV_DISABLE (0x0UL)   /*!< Disable PMU module                                                   */
  #define USBHSCORE_GPWRDN_PMUACTV_ENABLE (0x1UL)    /*!< Enable PMU module                                                    */

/* RESTORE @Bit 2 : Restore */
  #define USBHSCORE_GPWRDN_RESTORE_Pos (2UL)         /*!< Position of RESTORE field.                                           */
  #define USBHSCORE_GPWRDN_RESTORE_Msk (0x1UL << USBHSCORE_GPWRDN_RESTORE_Pos) /*!< Bit mask of RESTORE field.                 */
  #define USBHSCORE_GPWRDN_RESTORE_Min (0x0UL)       /*!< Min enumerator value of RESTORE field.                               */
  #define USBHSCORE_GPWRDN_RESTORE_Max (0x1UL)       /*!< Max enumerator value of RESTORE field.                               */
  #define USBHSCORE_GPWRDN_RESTORE_DISABLE (0x0UL)   /*!< The controller in normal mode of operation                           */
  #define USBHSCORE_GPWRDN_RESTORE_ENABLE (0x1UL)    /*!< The controller in Restore mode                                       */

/* PWRDNCLMP @Bit 3 : Power Down Clamp (PwrDnClmp) */
  #define USBHSCORE_GPWRDN_PWRDNCLMP_Pos (3UL)       /*!< Position of PWRDNCLMP field.                                         */
  #define USBHSCORE_GPWRDN_PWRDNCLMP_Msk (0x1UL << USBHSCORE_GPWRDN_PWRDNCLMP_Pos) /*!< Bit mask of PWRDNCLMP field.           */
  #define USBHSCORE_GPWRDN_PWRDNCLMP_Min (0x0UL)     /*!< Min enumerator value of PWRDNCLMP field.                             */
  #define USBHSCORE_GPWRDN_PWRDNCLMP_Max (0x1UL)     /*!< Max enumerator value of PWRDNCLMP field.                             */
  #define USBHSCORE_GPWRDN_PWRDNCLMP_DISABLE (0x0UL) /*!< Disable PMU power clamp                                              */
  #define USBHSCORE_GPWRDN_PWRDNCLMP_ENABLE (0x1UL)  /*!< Enable PMU power clamp                                               */

/* PWRDNRSTN @Bit 4 : Power Down ResetN (PwrDnRst_n) */
  #define USBHSCORE_GPWRDN_PWRDNRSTN_Pos (4UL)       /*!< Position of PWRDNRSTN field.                                         */
  #define USBHSCORE_GPWRDN_PWRDNRSTN_Msk (0x1UL << USBHSCORE_GPWRDN_PWRDNRSTN_Pos) /*!< Bit mask of PWRDNRSTN field.           */
  #define USBHSCORE_GPWRDN_PWRDNRSTN_Min (0x0UL)     /*!< Min enumerator value of PWRDNRSTN field.                             */
  #define USBHSCORE_GPWRDN_PWRDNRSTN_Max (0x1UL)     /*!< Max enumerator value of PWRDNRSTN field.                             */
  #define USBHSCORE_GPWRDN_PWRDNRSTN_DISABLE (0x0UL) /*!< Reset the controller                                                 */
  #define USBHSCORE_GPWRDN_PWRDNRSTN_ENABLE (0x1UL)  /*!< The controller is in normal operation                                */

