nrfconnect/sdk-hal_nordic/nrfx/mdk/nrf54l20_enga_types.h
/* BSESSVLD @Bit 22 : B Session Valid (BSessVld) */
  #define USBHSCORE_GPWRDN_BSESSVLD_Pos (22UL)       /*!< Position of BSESSVLD field.                                          */
  #define USBHSCORE_GPWRDN_BSESSVLD_Msk (0x1UL << USBHSCORE_GPWRDN_BSESSVLD_Pos) /*!< Bit mask of BSESSVLD field.              */
  #define USBHSCORE_GPWRDN_BSESSVLD_Min (0x0UL)      /*!< Min enumerator value of BSESSVLD field.                              */
  #define USBHSCORE_GPWRDN_BSESSVLD_Max (0x1UL)      /*!< Max enumerator value of BSESSVLD field.                              */
  #define USBHSCORE_GPWRDN_BSESSVLD_NOTVALID (0x0UL) /*!< B_Valid is 0                                                         */
  #define USBHSCORE_GPWRDN_BSESSVLD_VALID (0x1UL)    /*!< B_Valid is 1                                                         */

/* MULTVALIDBC @Bits 24..28 : MultValIdBC */
  #define USBHSCORE_GPWRDN_MULTVALIDBC_Pos (24UL)    /*!< Position of MULTVALIDBC field.                                       */
  #define USBHSCORE_GPWRDN_MULTVALIDBC_Msk (0x1FUL << USBHSCORE_GPWRDN_MULTVALIDBC_Pos) /*!< Bit mask of MULTVALIDBC field.    */
  #define USBHSCORE_GPWRDN_MULTVALIDBC_Min (0x0UL)   /*!< Min enumerator value of MULTVALIDBC field.                           */
  #define USBHSCORE_GPWRDN_MULTVALIDBC_Max (0x1FUL)  /*!< Max enumerator value of MULTVALIDBC field.                           */
  #define USBHSCORE_GPWRDN_MULTVALIDBC_RID_0 (0x00UL) /*!< OTG device as B-device                                              */
  #define USBHSCORE_GPWRDN_MULTVALIDBC_RID_C (0x01UL) /*!< OTG device as B-device, can connect                                 */
  #define USBHSCORE_GPWRDN_MULTVALIDBC_RID_B (0x02UL) /*!< OTG device as B-device, cannot connect                              */
  #define USBHSCORE_GPWRDN_MULTVALIDBC_RID_A (0x04UL) /*!< OTG device as A-device                                              */
  #define USBHSCORE_GPWRDN_MULTVALIDBC_RID_GND (0x08UL) /*!< ID_OTG pin is grounded                                            */
  #define USBHSCORE_GPWRDN_MULTVALIDBC_RID_A_RID_GND (0x0CUL) /*!< OTG device as A-device, RID_A=1 and RID_GND=1               */
  #define USBHSCORE_GPWRDN_MULTVALIDBC_RID_FLOAT (0x10UL) /*!< ID pull down when ID_OTG is floating                            */
  #define USBHSCORE_GPWRDN_MULTVALIDBC_RID_C_RID_FLOAT (0x11UL) /*!< OTG device as B-device, can connect, RID_C=1 and
                                                                     RID_FLOAT=1*/
  #define USBHSCORE_GPWRDN_MULTVALIDBC_RID_B_RID_FLOAT (0x12UL) /*!< OTG device as B-device, cannot connect, RID_B=1 and
                                                                     RID_FLOAT=1*/
  #define USBHSCORE_GPWRDN_MULTVALIDBC_RID_1 (0x1FUL) /*!< OTG device as A-device                                              */


/* USBHSCORE_GDFIFOCFG: Global DFIFO Configuration Register */
  #define USBHSCORE_GDFIFOCFG_ResetValue (0x0BEA0C00UL) /*!< Reset value of GDFIFOCFG register.                                */

/* GDFIFOCFG @Bits 0..15 : GDFIFOCfg */
  #define USBHSCORE_GDFIFOCFG_GDFIFOCFG_Pos (0UL)    /*!< Position of GDFIFOCFG field.                                         */
  #define USBHSCORE_GDFIFOCFG_GDFIFOCFG_Msk (0xFFFFUL << USBHSCORE_GDFIFOCFG_GDFIFOCFG_Pos) /*!< Bit mask of GDFIFOCFG field.  */

/* EPINFOBASEADDR @Bits 16..31 : This field provides the start address of the EP info controller. */
  #define USBHSCORE_GDFIFOCFG_EPINFOBASEADDR_Pos (16UL) /*!< Position of EPINFOBASEADDR field.                                 */
  #define USBHSCORE_GDFIFOCFG_EPINFOBASEADDR_Msk (0xFFFFUL << USBHSCORE_GDFIFOCFG_EPINFOBASEADDR_Pos) /*!< Bit mask of
                                                                            EPINFOBASEADDR field.*/


/* USBHSCORE_GINTMSK2: Interrupt Mask Register 2 */
  #define USBHSCORE_GINTMSK2_ResetValue (0x00000000UL) /*!< Reset value of GINTMSK2 register.                                  */

/* GINTMSK2 @Bits 0..31 : (unspecified) */
  #define USBHSCORE_GINTMSK2_GINTMSK2_Pos (0UL)      /*!< Position of GINTMSK2 field.                                          */
  #define USBHSCORE_GINTMSK2_GINTMSK2_Msk (0xFFFFFFFFUL << USBHSCORE_GINTMSK2_GINTMSK2_Pos) /*!< Bit mask of GINTMSK2 field.   */


/* USBHSCORE_GINTSTS2: Interrupt Register 2 */
  #define USBHSCORE_GINTSTS2_ResetValue (0x00000000UL) /*!< Reset value of GINTSTS2 register.                                  */

/* GINTSTS2 @Bits 0..31 : (unspecified) */
  #define USBHSCORE_GINTSTS2_GINTSTS2_Pos (0UL)      /*!< Position of GINTSTS2 field.                                          */
  #define USBHSCORE_GINTSTS2_GINTSTS2_Msk (0xFFFFFFFFUL << USBHSCORE_GINTSTS2_GINTSTS2_Pos) /*!< Bit mask of GINTSTS2 field.   */


/* USBHSCORE_HPTXFSIZ: Host Periodic Transmit FIFO Size Register */
  #define USBHSCORE_HPTXFSIZ_ResetValue (0x04000424UL) /*!< Reset value of HPTXFSIZ register.                                  */

/* PTXFSTADDR @Bits 0..10 : Host Periodic TxFIFO Start Address (PTxFStAddr) */
  #define USBHSCORE_HPTXFSIZ_PTXFSTADDR_Pos (0UL)    /*!< Position of PTXFSTADDR field.                                        */
  #define USBHSCORE_HPTXFSIZ_PTXFSTADDR_Msk (0x7FFUL << USBHSCORE_HPTXFSIZ_PTXFSTADDR_Pos) /*!< Bit mask of PTXFSTADDR field.  */

/* PTXFSIZE @Bits 16..26 : Host Periodic TxFIFO Depth (PTxFSize) */
  #define USBHSCORE_HPTXFSIZ_PTXFSIZE_Pos (16UL)     /*!< Position of PTXFSIZE field.                                          */
  #define USBHSCORE_HPTXFSIZ_PTXFSIZE_Msk (0x7FFUL << USBHSCORE_HPTXFSIZ_PTXFSIZE_Pos) /*!< Bit mask of PTXFSIZE field.        */


/* USBHSCORE_DIEPTXF: Device IN Endpoint Transmit FIFO Size Register */
  #define USBHSCORE_DIEPTXF_MaxCount (7UL)           /*!< Max size of DIEPTXF[8] array.                                        */
  #define USBHSCORE_DIEPTXF_MaxIndex (7UL)           /*!< Max index of DIEPTXF[8] array.                                       */
  #define USBHSCORE_DIEPTXF_MinIndex (1UL)           /*!< Min index of DIEPTXF[8] array.                                       */
  #define USBHSCORE_DIEPTXF_ResetValue (0x02000424UL) /*!< Reset value of DIEPTXF[8] register.                                 */

/* INEPNTXFSTADDR @Bits 0..10 : IN Endpoint FIFOn Transmit RAM Start Address (INEPnTxFStAddr) */
  #define USBHSCORE_DIEPTXF_INEPNTXFSTADDR_Pos (0UL) /*!< Position of INEPNTXFSTADDR field.                                    */
  #define USBHSCORE_DIEPTXF_INEPNTXFSTADDR_Msk (0x7FFUL << USBHSCORE_DIEPTXF_INEPNTXFSTADDR_Pos) /*!< Bit mask of INEPNTXFSTADDR
                                                                            field.*/

