nrfconnect/sdk-hal_nordic/nrfx/mdk/nrf54l20_enga_types.h
/* ENA32KHZSUSP @Bit 3 : Enable 32 KHz Suspend mode (Ena32KHzSusp) */
  #define USBHSCORE_DCFG_ENA32KHZSUSP_Pos (3UL)      /*!< Position of ENA32KHZSUSP field.                                      */
  #define USBHSCORE_DCFG_ENA32KHZSUSP_Msk (0x1UL << USBHSCORE_DCFG_ENA32KHZSUSP_Pos) /*!< Bit mask of ENA32KHZSUSP field.      */
  #define USBHSCORE_DCFG_ENA32KHZSUSP_Min (0x0UL)    /*!< Min enumerator value of ENA32KHZSUSP field.                          */
  #define USBHSCORE_DCFG_ENA32KHZSUSP_Max (0x1UL)    /*!< Max enumerator value of ENA32KHZSUSP field.                          */
  #define USBHSCORE_DCFG_ENA32KHZSUSP_DISABLED (0x0UL) /*!< USB 1.1 Full-Speed Serial Transceiver not selected                 */
  #define USBHSCORE_DCFG_ENA32KHZSUSP_ENABLED (0x1UL) /*!< USB 1.1 Full-Speed Serial Transceiver Interface selected            */

/* DEVADDR @Bits 4..10 : Device Address (DevAddr) */
  #define USBHSCORE_DCFG_DEVADDR_Pos (4UL)           /*!< Position of DEVADDR field.                                           */
  #define USBHSCORE_DCFG_DEVADDR_Msk (0x7FUL << USBHSCORE_DCFG_DEVADDR_Pos) /*!< Bit mask of DEVADDR field.                    */

/* PERFRINT @Bits 11..12 : Periodic Frame Interval (PerFrInt) */
  #define USBHSCORE_DCFG_PERFRINT_Pos (11UL)         /*!< Position of PERFRINT field.                                          */
  #define USBHSCORE_DCFG_PERFRINT_Msk (0x3UL << USBHSCORE_DCFG_PERFRINT_Pos) /*!< Bit mask of PERFRINT field.                  */
  #define USBHSCORE_DCFG_PERFRINT_Min (0x0UL)        /*!< Min enumerator value of PERFRINT field.                              */
  #define USBHSCORE_DCFG_PERFRINT_Max (0x3UL)        /*!< Max enumerator value of PERFRINT field.                              */
  #define USBHSCORE_DCFG_PERFRINT_EOPF80 (0x0UL)     /*!< 80 percent of the (micro)Frame interval                              */
  #define USBHSCORE_DCFG_PERFRINT_EOPF85 (0x1UL)     /*!< 85 percent of the (micro)Frame interval                              */
  #define USBHSCORE_DCFG_PERFRINT_EOPF90 (0x2UL)     /*!< 90 percent of the (micro)Frame interval                              */
  #define USBHSCORE_DCFG_PERFRINT_EOPF95 (0x3UL)     /*!< 95 percent of the (micro)Frame interval                              */

/* XCVRDLY @Bit 14 : XCVRDLY */
  #define USBHSCORE_DCFG_XCVRDLY_Pos (14UL)          /*!< Position of XCVRDLY field.                                           */
  #define USBHSCORE_DCFG_XCVRDLY_Msk (0x1UL << USBHSCORE_DCFG_XCVRDLY_Pos) /*!< Bit mask of XCVRDLY field.                     */
  #define USBHSCORE_DCFG_XCVRDLY_Min (0x0UL)         /*!< Min enumerator value of XCVRDLY field.                               */
  #define USBHSCORE_DCFG_XCVRDLY_Max (0x1UL)         /*!< Max enumerator value of XCVRDLY field.                               */
  #define USBHSCORE_DCFG_XCVRDLY_DISABLE (0x0UL)     /*!< No delay between xcvr_sel and txvalid during Device chirp            */
  #define USBHSCORE_DCFG_XCVRDLY_ENABLE (0x1UL)      /*!< Enable delay between xcvr_sel and txvalid during Device chirp        */

/* ERRATICINTMSK @Bit 15 : Erratic Error Interrupt Mask */
  #define USBHSCORE_DCFG_ERRATICINTMSK_Pos (15UL)    /*!< Position of ERRATICINTMSK field.                                     */
  #define USBHSCORE_DCFG_ERRATICINTMSK_Msk (0x1UL << USBHSCORE_DCFG_ERRATICINTMSK_Pos) /*!< Bit mask of ERRATICINTMSK field.   */
  #define USBHSCORE_DCFG_ERRATICINTMSK_Min (0x0UL)   /*!< Min enumerator value of ERRATICINTMSK field.                         */
  #define USBHSCORE_DCFG_ERRATICINTMSK_Max (0x1UL)   /*!< Max enumerator value of ERRATICINTMSK field.                         */
  #define USBHSCORE_DCFG_ERRATICINTMSK_NOMASK (0x0UL) /*!< Early suspend interrupt is generated on erratic error               */
  #define USBHSCORE_DCFG_ERRATICINTMSK_MASK (0x1UL)  /*!< Mask early suspend interrupt on erratic error                        */

/* IPGISOCSUPT @Bit 17 : Worst-Case Inter-Packet Gap ISOC OUT Support (ipgisocSupt) */
  #define USBHSCORE_DCFG_IPGISOCSUPT_Pos (17UL)      /*!< Position of IPGISOCSUPT field.                                       */
  #define USBHSCORE_DCFG_IPGISOCSUPT_Msk (0x1UL << USBHSCORE_DCFG_IPGISOCSUPT_Pos) /*!< Bit mask of IPGISOCSUPT field.         */
  #define USBHSCORE_DCFG_IPGISOCSUPT_Min (0x0UL)     /*!< Min enumerator value of IPGISOCSUPT field.                           */
  #define USBHSCORE_DCFG_IPGISOCSUPT_Max (0x1UL)     /*!< Max enumerator value of IPGISOCSUPT field.                           */
  #define USBHSCORE_DCFG_IPGISOCSUPT_DISABLED (0x0UL) /*!< Worst-Case Inter-Packet Gap ISOC OUT Support is disabled            */
  #define USBHSCORE_DCFG_IPGISOCSUPT_ENABLED (0x1UL) /*!< Worst-Case Inter-Packet Gap ISOC OUT Support is enabled              */

/* PERSCHINTVL @Bits 24..25 : Periodic Scheduling Interval (PerSchIntvl) */
  #define USBHSCORE_DCFG_PERSCHINTVL_Pos (24UL)      /*!< Position of PERSCHINTVL field.                                       */
  #define USBHSCORE_DCFG_PERSCHINTVL_Msk (0x3UL << USBHSCORE_DCFG_PERSCHINTVL_Pos) /*!< Bit mask of PERSCHINTVL field.         */
  #define USBHSCORE_DCFG_PERSCHINTVL_Min (0x0UL)     /*!< Min enumerator value of PERSCHINTVL field.                           */
  #define USBHSCORE_DCFG_PERSCHINTVL_Max (0x2UL)     /*!< Max enumerator value of PERSCHINTVL field.                           */
  #define USBHSCORE_DCFG_PERSCHINTVL_MF25 (0x0UL)    /*!< 25 percent of (micro)Frame                                           */
  #define USBHSCORE_DCFG_PERSCHINTVL_MF50 (0x1UL)    /*!< 50 percent of (micro)Frame                                           */
  #define USBHSCORE_DCFG_PERSCHINTVL_MF75 (0x2UL)    /*!< 75 percent of (micro)Frame                                           */

/* RESVALID @Bits 26..31 : Resume Validation Period (ResValid) */
  #define USBHSCORE_DCFG_RESVALID_Pos (26UL)         /*!< Position of RESVALID field.                                          */
  #define USBHSCORE_DCFG_RESVALID_Msk (0x3FUL << USBHSCORE_DCFG_RESVALID_Pos) /*!< Bit mask of RESVALID field.                 */


