nrfconnect/sdk-hal_nordic/nrfx/mdk/nrf54l20_enga_types.h
/* INEPINT6 @Bit 6 : IN Endpoint 6 Interrupt Bit */
  #define USBHSCORE_DAINT_INEPINT6_Pos (6UL)         /*!< Position of INEPINT6 field.                                          */
  #define USBHSCORE_DAINT_INEPINT6_Msk (0x1UL << USBHSCORE_DAINT_INEPINT6_Pos) /*!< Bit mask of INEPINT6 field.                */
  #define USBHSCORE_DAINT_INEPINT6_Min (0x0UL)       /*!< Min enumerator value of INEPINT6 field.                              */
  #define USBHSCORE_DAINT_INEPINT6_Max (0x1UL)       /*!< Max enumerator value of INEPINT6 field.                              */
  #define USBHSCORE_DAINT_INEPINT6_INACTIVE (0x0UL)  /*!< No Interrupt                                                         */
  #define USBHSCORE_DAINT_INEPINT6_ACTIVE (0x1UL)    /*!< Interrupt is active for the IN EP                                    */

/* INEPINT7 @Bit 7 : IN Endpoint 7 Interrupt Bit */
  #define USBHSCORE_DAINT_INEPINT7_Pos (7UL)         /*!< Position of INEPINT7 field.                                          */
  #define USBHSCORE_DAINT_INEPINT7_Msk (0x1UL << USBHSCORE_DAINT_INEPINT7_Pos) /*!< Bit mask of INEPINT7 field.                */
  #define USBHSCORE_DAINT_INEPINT7_Min (0x0UL)       /*!< Min enumerator value of INEPINT7 field.                              */
  #define USBHSCORE_DAINT_INEPINT7_Max (0x1UL)       /*!< Max enumerator value of INEPINT7 field.                              */
  #define USBHSCORE_DAINT_INEPINT7_INACTIVE (0x0UL)  /*!< No Interrupt                                                         */
  #define USBHSCORE_DAINT_INEPINT7_ACTIVE (0x1UL)    /*!< Interrupt is active for the IN EP                                    */

/* INEPINT8 @Bit 8 : IN Endpoint 8 Interrupt Bit */
  #define USBHSCORE_DAINT_INEPINT8_Pos (8UL)         /*!< Position of INEPINT8 field.                                          */
  #define USBHSCORE_DAINT_INEPINT8_Msk (0x1UL << USBHSCORE_DAINT_INEPINT8_Pos) /*!< Bit mask of INEPINT8 field.                */
  #define USBHSCORE_DAINT_INEPINT8_Min (0x0UL)       /*!< Min enumerator value of INEPINT8 field.                              */
  #define USBHSCORE_DAINT_INEPINT8_Max (0x1UL)       /*!< Max enumerator value of INEPINT8 field.                              */
  #define USBHSCORE_DAINT_INEPINT8_INACTIVE (0x0UL)  /*!< No Interrupt                                                         */
  #define USBHSCORE_DAINT_INEPINT8_ACTIVE (0x1UL)    /*!< Interrupt is active for the IN EP                                    */

/* INEPINT9 @Bit 9 : IN Endpoint 9 Interrupt Bit */
  #define USBHSCORE_DAINT_INEPINT9_Pos (9UL)         /*!< Position of INEPINT9 field.                                          */
  #define USBHSCORE_DAINT_INEPINT9_Msk (0x1UL << USBHSCORE_DAINT_INEPINT9_Pos) /*!< Bit mask of INEPINT9 field.                */
  #define USBHSCORE_DAINT_INEPINT9_Min (0x0UL)       /*!< Min enumerator value of INEPINT9 field.                              */
  #define USBHSCORE_DAINT_INEPINT9_Max (0x1UL)       /*!< Max enumerator value of INEPINT9 field.                              */
  #define USBHSCORE_DAINT_INEPINT9_INACTIVE (0x0UL)  /*!< No Interrupt                                                         */
  #define USBHSCORE_DAINT_INEPINT9_ACTIVE (0x1UL)    /*!< Interrupt is active for the IN EP                                    */

/* INEPINT10 @Bit 10 : IN Endpoint 10 Interrupt Bit */
  #define USBHSCORE_DAINT_INEPINT10_Pos (10UL)       /*!< Position of INEPINT10 field.                                         */
  #define USBHSCORE_DAINT_INEPINT10_Msk (0x1UL << USBHSCORE_DAINT_INEPINT10_Pos) /*!< Bit mask of INEPINT10 field.             */
  #define USBHSCORE_DAINT_INEPINT10_Min (0x0UL)      /*!< Min enumerator value of INEPINT10 field.                             */
  #define USBHSCORE_DAINT_INEPINT10_Max (0x1UL)      /*!< Max enumerator value of INEPINT10 field.                             */
  #define USBHSCORE_DAINT_INEPINT10_INACTIVE (0x0UL) /*!< No Interrupt                                                         */
  #define USBHSCORE_DAINT_INEPINT10_ACTIVE (0x1UL)   /*!< Interrupt is active for the IN EP                                    */

/* INEPINT11 @Bit 11 : IN Endpoint 11 Interrupt Bit */
  #define USBHSCORE_DAINT_INEPINT11_Pos (11UL)       /*!< Position of INEPINT11 field.                                         */
  #define USBHSCORE_DAINT_INEPINT11_Msk (0x1UL << USBHSCORE_DAINT_INEPINT11_Pos) /*!< Bit mask of INEPINT11 field.             */
  #define USBHSCORE_DAINT_INEPINT11_Min (0x0UL)      /*!< Min enumerator value of INEPINT11 field.                             */
  #define USBHSCORE_DAINT_INEPINT11_Max (0x1UL)      /*!< Max enumerator value of INEPINT11 field.                             */
  #define USBHSCORE_DAINT_INEPINT11_INACTIVE (0x0UL) /*!< No Interrupt                                                         */
  #define USBHSCORE_DAINT_INEPINT11_ACTIVE (0x1UL)   /*!< Interrupt is active for the IN EP                                    */

/* OUTEPINT0 @Bit 16 : OUT Endpoint 0 Interrupt Bit */
  #define USBHSCORE_DAINT_OUTEPINT0_Pos (16UL)       /*!< Position of OUTEPINT0 field.                                         */
  #define USBHSCORE_DAINT_OUTEPINT0_Msk (0x1UL << USBHSCORE_DAINT_OUTEPINT0_Pos) /*!< Bit mask of OUTEPINT0 field.             */
  #define USBHSCORE_DAINT_OUTEPINT0_Min (0x0UL)      /*!< Min enumerator value of OUTEPINT0 field.                             */
  #define USBHSCORE_DAINT_OUTEPINT0_Max (0x1UL)      /*!< Max enumerator value of OUTEPINT0 field.                             */
  #define USBHSCORE_DAINT_OUTEPINT0_INACTIVE (0x0UL) /*!< No Interrupt                                                         */
  #define USBHSCORE_DAINT_OUTEPINT0_ACTIVE (0x1UL)   /*!< Interrupt is active for OUT EP0                                      */

/* OUTEPINT1 @Bit 17 : OUT Endpoint 1 Interrupt Bit */
  #define USBHSCORE_DAINT_OUTEPINT1_Pos (17UL)       /*!< Position of OUTEPINT1 field.                                         */
  #define USBHSCORE_DAINT_OUTEPINT1_Msk (0x1UL << USBHSCORE_DAINT_OUTEPINT1_Pos) /*!< Bit mask of OUTEPINT1 field.             */
  #define USBHSCORE_DAINT_OUTEPINT1_Min (0x0UL)      /*!< Min enumerator value of OUTEPINT1 field.                             */
  #define USBHSCORE_DAINT_OUTEPINT1_Max (0x1UL)      /*!< Max enumerator value of OUTEPINT1 field.                             */
  #define USBHSCORE_DAINT_OUTEPINT1_INACTIVE (0x0UL) /*!< No Interrupt                                                         */
  #define USBHSCORE_DAINT_OUTEPINT1_ACTIVE (0x1UL)   /*!< Interrupt is active for the OUT EP                                   */

