nrfconnect/sdk-hal_nordic/nrfx/mdk/nrf54l20_enga_types.h
/* OUTEPMSK5 @Bit 21 : OUT Endpoint 5 Interrupt mask Bit */
  #define USBHSCORE_DAINTMSK_OUTEPMSK5_Pos (21UL)    /*!< Position of OUTEPMSK5 field.                                         */
  #define USBHSCORE_DAINTMSK_OUTEPMSK5_Msk (0x1UL << USBHSCORE_DAINTMSK_OUTEPMSK5_Pos) /*!< Bit mask of OUTEPMSK5 field.       */
  #define USBHSCORE_DAINTMSK_OUTEPMSK5_Min (0x0UL)   /*!< Min enumerator value of OUTEPMSK5 field.                             */
  #define USBHSCORE_DAINTMSK_OUTEPMSK5_Max (0x1UL)   /*!< Max enumerator value of OUTEPMSK5 field.                             */
  #define USBHSCORE_DAINTMSK_OUTEPMSK5_MASK (0x0UL)  /*!< Mask OUT Endpoint Interrupt                                          */
  #define USBHSCORE_DAINTMSK_OUTEPMSK5_NOMASK (0x1UL) /*!< No Interrupt mask                                                   */

/* OUTEPMSK12 @Bit 28 : OUT Endpoint 12 Interrupt mask Bit */
  #define USBHSCORE_DAINTMSK_OUTEPMSK12_Pos (28UL)   /*!< Position of OUTEPMSK12 field.                                        */
  #define USBHSCORE_DAINTMSK_OUTEPMSK12_Msk (0x1UL << USBHSCORE_DAINTMSK_OUTEPMSK12_Pos) /*!< Bit mask of OUTEPMSK12 field.    */
  #define USBHSCORE_DAINTMSK_OUTEPMSK12_Min (0x0UL)  /*!< Min enumerator value of OUTEPMSK12 field.                            */
  #define USBHSCORE_DAINTMSK_OUTEPMSK12_Max (0x1UL)  /*!< Max enumerator value of OUTEPMSK12 field.                            */
  #define USBHSCORE_DAINTMSK_OUTEPMSK12_MASK (0x0UL) /*!< Mask OUT Endpoint Interrupt                                          */
  #define USBHSCORE_DAINTMSK_OUTEPMSK12_NOMASK (0x1UL) /*!< No Interrupt mask                                                  */

/* OUTEPMSK13 @Bit 29 : OUT Endpoint 13 Interrupt mask Bit */
  #define USBHSCORE_DAINTMSK_OUTEPMSK13_Pos (29UL)   /*!< Position of OUTEPMSK13 field.                                        */
  #define USBHSCORE_DAINTMSK_OUTEPMSK13_Msk (0x1UL << USBHSCORE_DAINTMSK_OUTEPMSK13_Pos) /*!< Bit mask of OUTEPMSK13 field.    */
  #define USBHSCORE_DAINTMSK_OUTEPMSK13_Min (0x0UL)  /*!< Min enumerator value of OUTEPMSK13 field.                            */
  #define USBHSCORE_DAINTMSK_OUTEPMSK13_Max (0x1UL)  /*!< Max enumerator value of OUTEPMSK13 field.                            */
  #define USBHSCORE_DAINTMSK_OUTEPMSK13_MASK (0x0UL) /*!< Mask OUT Endpoint Interrupt                                          */
  #define USBHSCORE_DAINTMSK_OUTEPMSK13_NOMASK (0x1UL) /*!< No Interrupt mask                                                  */

/* OUTEPMSK14 @Bit 30 : OUT Endpoint 14 Interrupt mask Bit */
  #define USBHSCORE_DAINTMSK_OUTEPMSK14_Pos (30UL)   /*!< Position of OUTEPMSK14 field.                                        */
  #define USBHSCORE_DAINTMSK_OUTEPMSK14_Msk (0x1UL << USBHSCORE_DAINTMSK_OUTEPMSK14_Pos) /*!< Bit mask of OUTEPMSK14 field.    */
  #define USBHSCORE_DAINTMSK_OUTEPMSK14_Min (0x0UL)  /*!< Min enumerator value of OUTEPMSK14 field.                            */
  #define USBHSCORE_DAINTMSK_OUTEPMSK14_Max (0x1UL)  /*!< Max enumerator value of OUTEPMSK14 field.                            */
  #define USBHSCORE_DAINTMSK_OUTEPMSK14_MASK (0x0UL) /*!< Mask OUT Endpoint Interrupt                                          */
  #define USBHSCORE_DAINTMSK_OUTEPMSK14_NOMASK (0x1UL) /*!< No Interrupt mask                                                  */

/* OUTEPMSK15 @Bit 31 : OUT Endpoint 15 Interrupt mask Bit */
  #define USBHSCORE_DAINTMSK_OUTEPMSK15_Pos (31UL)   /*!< Position of OUTEPMSK15 field.                                        */
  #define USBHSCORE_DAINTMSK_OUTEPMSK15_Msk (0x1UL << USBHSCORE_DAINTMSK_OUTEPMSK15_Pos) /*!< Bit mask of OUTEPMSK15 field.    */
  #define USBHSCORE_DAINTMSK_OUTEPMSK15_Min (0x0UL)  /*!< Min enumerator value of OUTEPMSK15 field.                            */
  #define USBHSCORE_DAINTMSK_OUTEPMSK15_Max (0x1UL)  /*!< Max enumerator value of OUTEPMSK15 field.                            */
  #define USBHSCORE_DAINTMSK_OUTEPMSK15_MASK (0x0UL) /*!< Mask OUT Endpoint Interrupt                                          */
  #define USBHSCORE_DAINTMSK_OUTEPMSK15_NOMASK (0x1UL) /*!< No Interrupt mask                                                  */


/* USBHSCORE_DVBUSDIS: Device VBUS Discharge Time Register */
  #define USBHSCORE_DVBUSDIS_ResetValue (0x000017D7UL) /*!< Reset value of DVBUSDIS register.                                  */

/* DVBUSDIS @Bits 0..15 : Device VBUS Discharge Time (DVBUSDis) */
  #define USBHSCORE_DVBUSDIS_DVBUSDIS_Pos (0UL)      /*!< Position of DVBUSDIS field.                                          */
  #define USBHSCORE_DVBUSDIS_DVBUSDIS_Msk (0xFFFFUL << USBHSCORE_DVBUSDIS_DVBUSDIS_Pos) /*!< Bit mask of DVBUSDIS field.       */


/* USBHSCORE_DVBUSPULSE: Device VBUS Pulsing Time Register */
  #define USBHSCORE_DVBUSPULSE_ResetValue (0x000005B8UL) /*!< Reset value of DVBUSPULSE register.                              */

/* DVBUSPULSE @Bits 0..11 : Device VBUS Pulsing Time (DVBUSPulse) */
  #define USBHSCORE_DVBUSPULSE_DVBUSPULSE_Pos (0UL)  /*!< Position of DVBUSPULSE field.                                        */
  #define USBHSCORE_DVBUSPULSE_DVBUSPULSE_Msk (0xFFFUL << USBHSCORE_DVBUSPULSE_DVBUSPULSE_Pos) /*!< Bit mask of DVBUSPULSE
                                                                            field.*/


/* USBHSCORE_DTHRCTL: Device Threshold Control Register */
  #define USBHSCORE_DTHRCTL_ResetValue (0x08100020UL) /*!< Reset value of DTHRCTL register.                                    */

/* NONISOTHREN @Bit 0 : Non-ISO IN Endpoints Threshold Enable. (NonISOThrEn) */
  #define USBHSCORE_DTHRCTL_NONISOTHREN_Pos (0UL)    /*!< Position of NONISOTHREN field.                                       */
  #define USBHSCORE_DTHRCTL_NONISOTHREN_Msk (0x1UL << USBHSCORE_DTHRCTL_NONISOTHREN_Pos) /*!< Bit mask of NONISOTHREN field.   */
  #define USBHSCORE_DTHRCTL_NONISOTHREN_Min (0x0UL)  /*!< Min enumerator value of NONISOTHREN field.                           */
  #define USBHSCORE_DTHRCTL_NONISOTHREN_Max (0x1UL)  /*!< Max enumerator value of NONISOTHREN field.                           */
  #define USBHSCORE_DTHRCTL_NONISOTHREN_DISABLED (0x0UL) /*!< No thresholding                                                  */
  #define USBHSCORE_DTHRCTL_NONISOTHREN_ENABLED (0x1UL) /*!< Enable thresholding for non-isochronous IN endpoints              */

