nrfconnect/sdk-hal_nordic/nrfx/mdk/nrf54l20_enga_types.h
/* USBHSCORE_DIEPTSIZ1: Device IN Endpoint Transfer Size Register */
  #define USBHSCORE_DIEPTSIZ1_ResetValue (0x00000000UL) /*!< Reset value of DIEPTSIZ1 register.                                */

/* XFERSIZE @Bits 0..18 : Transfer Size (XferSize) */
  #define USBHSCORE_DIEPTSIZ1_XFERSIZE_Pos (0UL)     /*!< Position of XFERSIZE field.                                          */
  #define USBHSCORE_DIEPTSIZ1_XFERSIZE_Msk (0x7FFFFUL << USBHSCORE_DIEPTSIZ1_XFERSIZE_Pos) /*!< Bit mask of XFERSIZE field.    */

/* PKTCNT @Bits 19..28 : Packet Count (PktCnt) */
  #define USBHSCORE_DIEPTSIZ1_PKTCNT_Pos (19UL)      /*!< Position of PKTCNT field.                                            */
  #define USBHSCORE_DIEPTSIZ1_PKTCNT_Msk (0x3FFUL << USBHSCORE_DIEPTSIZ1_PKTCNT_Pos) /*!< Bit mask of PKTCNT field.            */

/* MC @Bits 29..30 : MC */
  #define USBHSCORE_DIEPTSIZ1_MC_Pos (29UL)          /*!< Position of MC field.                                                */
  #define USBHSCORE_DIEPTSIZ1_MC_Msk (0x3UL << USBHSCORE_DIEPTSIZ1_MC_Pos) /*!< Bit mask of MC field.                          */
  #define USBHSCORE_DIEPTSIZ1_MC_Min (0x1UL)         /*!< Min enumerator value of MC field.                                    */
  #define USBHSCORE_DIEPTSIZ1_MC_Max (0x3UL)         /*!< Max enumerator value of MC field.                                    */
  #define USBHSCORE_DIEPTSIZ1_MC_PACKETONE (0x1UL)   /*!< 1 packet                                                             */
  #define USBHSCORE_DIEPTSIZ1_MC_PACKETTWO (0x2UL)   /*!< 2 packets                                                            */
  #define USBHSCORE_DIEPTSIZ1_MC_PACKETTHREE (0x3UL) /*!< 3 packets                                                            */


/* USBHSCORE_DIEPDMA1: Device IN Endpoint DMA Address Register */
  #define USBHSCORE_DIEPDMA1_ResetValue (0x00000000UL) /*!< Reset value of DIEPDMA1 register.                                  */

/* DMAADDR @Bits 0..31 : Holds the start address of the external memory for storing or fetching endpoint */
  #define USBHSCORE_DIEPDMA1_DMAADDR_Pos (0UL)       /*!< Position of DMAADDR field.                                           */
  #define USBHSCORE_DIEPDMA1_DMAADDR_Msk (0xFFFFFFFFUL << USBHSCORE_DIEPDMA1_DMAADDR_Pos) /*!< Bit mask of DMAADDR field.      */


/* USBHSCORE_DTXFSTS1: Device IN Endpoint Transmit FIFO Status Register */
  #define USBHSCORE_DTXFSTS1_ResetValue (0x00000200UL) /*!< Reset value of DTXFSTS1 register.                                  */

/* INEPTXFSPCAVAIL @Bits 0..15 : IN Endpoint TxFIFO Space Avail (INEPTxFSpcAvail) */
  #define USBHSCORE_DTXFSTS1_INEPTXFSPCAVAIL_Pos (0UL) /*!< Position of INEPTXFSPCAVAIL field.                                 */
  #define USBHSCORE_DTXFSTS1_INEPTXFSPCAVAIL_Msk (0xFFFFUL << USBHSCORE_DTXFSTS1_INEPTXFSPCAVAIL_Pos) /*!< Bit mask of
                                                                            INEPTXFSPCAVAIL field.*/


/* USBHSCORE_DIEPCTL2: Device Control IN Endpoint Control Register */
  #define USBHSCORE_DIEPCTL2_ResetValue (0x00000000UL) /*!< Reset value of DIEPCTL2 register.                                  */

/* MPS @Bits 0..10 : Maximum Packet Size (MPS) */
  #define USBHSCORE_DIEPCTL2_MPS_Pos (0UL)           /*!< Position of MPS field.                                               */
  #define USBHSCORE_DIEPCTL2_MPS_Msk (0x7FFUL << USBHSCORE_DIEPCTL2_MPS_Pos) /*!< Bit mask of MPS field.                       */

/* USBACTEP @Bit 15 : USB Active Endpoint (USBActEP) */
  #define USBHSCORE_DIEPCTL2_USBACTEP_Pos (15UL)     /*!< Position of USBACTEP field.                                          */
  #define USBHSCORE_DIEPCTL2_USBACTEP_Msk (0x1UL << USBHSCORE_DIEPCTL2_USBACTEP_Pos) /*!< Bit mask of USBACTEP field.          */
  #define USBHSCORE_DIEPCTL2_USBACTEP_Min (0x0UL)    /*!< Min enumerator value of USBACTEP field.                              */
  #define USBHSCORE_DIEPCTL2_USBACTEP_Max (0x1UL)    /*!< Max enumerator value of USBACTEP field.                              */
  #define USBHSCORE_DIEPCTL2_USBACTEP_DISABLED (0x0UL) /*!< Not Active                                                         */
  #define USBHSCORE_DIEPCTL2_USBACTEP_ENABLED (0x1UL) /*!< USB Active Endpoint                                                 */

/* DPID @Bit 16 : (unspecified) */
  #define USBHSCORE_DIEPCTL2_DPID_Pos (16UL)         /*!< Position of DPID field.                                              */
  #define USBHSCORE_DIEPCTL2_DPID_Msk (0x1UL << USBHSCORE_DIEPCTL2_DPID_Pos) /*!< Bit mask of DPID field.                      */
  #define USBHSCORE_DIEPCTL2_DPID_Min (0x0UL)        /*!< Min enumerator value of DPID field.                                  */
  #define USBHSCORE_DIEPCTL2_DPID_Max (0x1UL)        /*!< Max enumerator value of DPID field.                                  */
  #define USBHSCORE_DIEPCTL2_DPID_DATA0EVENFRM (0x0UL) /*!< DATA0 or Even Frame                                                */
  #define USBHSCORE_DIEPCTL2_DPID_DATA1ODDFRM (0x1UL) /*!< DATA1 or Odd Frame                                                  */

/* NAKSTS @Bit 17 : NAK Status (NAKSts) */
  #define USBHSCORE_DIEPCTL2_NAKSTS_Pos (17UL)       /*!< Position of NAKSTS field.                                            */
  #define USBHSCORE_DIEPCTL2_NAKSTS_Msk (0x1UL << USBHSCORE_DIEPCTL2_NAKSTS_Pos) /*!< Bit mask of NAKSTS field.                */
  #define USBHSCORE_DIEPCTL2_NAKSTS_Min (0x0UL)      /*!< Min enumerator value of NAKSTS field.                                */
  #define USBHSCORE_DIEPCTL2_NAKSTS_Max (0x1UL)      /*!< Max enumerator value of NAKSTS field.                                */
  #define USBHSCORE_DIEPCTL2_NAKSTS_NONNAK (0x0UL)   /*!< The core is transmitting non-NAK handshakes based on the FIFO status */
  #define USBHSCORE_DIEPCTL2_NAKSTS_NAK (0x1UL)      /*!< The core is transmitting NAK handshakes on this endpoint             */

/* EPTYPE @Bits 18..19 : Endpoint Type (EPType) */
  #define USBHSCORE_DIEPCTL2_EPTYPE_Pos (18UL)       /*!< Position of EPTYPE field.                                            */
  #define USBHSCORE_DIEPCTL2_EPTYPE_Msk (0x3UL << USBHSCORE_DIEPCTL2_EPTYPE_Pos) /*!< Bit mask of EPTYPE field.                */
  #define USBHSCORE_DIEPCTL2_EPTYPE_Min (0x0UL)      /*!< Min enumerator value of EPTYPE field.                                */
  #define USBHSCORE_DIEPCTL2_EPTYPE_Max (0x3UL)      /*!< Max enumerator value of EPTYPE field.                                */
  #define USBHSCORE_DIEPCTL2_EPTYPE_CONTROL (0x0UL)  /*!< Control                                                              */
  #define USBHSCORE_DIEPCTL2_EPTYPE_ISOCHRONOUS (0x1UL) /*!< Isochronous                                                       */
  #define USBHSCORE_DIEPCTL2_EPTYPE_BULK (0x2UL)     /*!< Bulk                                                                 */
  #define USBHSCORE_DIEPCTL2_EPTYPE_INTERRUP (0x3UL) /*!< Interrupt                                                            */

