nrfconnect/sdk-hal_nordic/nrfx/mdk/nrf54l20_enga_types.h
/* USBHSCORE_DIEPTSIZ11: Device IN Endpoint Transfer Size Register */
  #define USBHSCORE_DIEPTSIZ11_ResetValue (0x00000000UL) /*!< Reset value of DIEPTSIZ11 register.                              */

/* XFERSIZE @Bits 0..18 : Transfer Size (XferSize) */
  #define USBHSCORE_DIEPTSIZ11_XFERSIZE_Pos (0UL)    /*!< Position of XFERSIZE field.                                          */
  #define USBHSCORE_DIEPTSIZ11_XFERSIZE_Msk (0x7FFFFUL << USBHSCORE_DIEPTSIZ11_XFERSIZE_Pos) /*!< Bit mask of XFERSIZE field.  */

/* PKTCNT @Bits 19..28 : Packet Count (PktCnt) */
  #define USBHSCORE_DIEPTSIZ11_PKTCNT_Pos (19UL)     /*!< Position of PKTCNT field.                                            */
  #define USBHSCORE_DIEPTSIZ11_PKTCNT_Msk (0x3FFUL << USBHSCORE_DIEPTSIZ11_PKTCNT_Pos) /*!< Bit mask of PKTCNT field.          */

/* MC @Bits 29..30 : MC */
  #define USBHSCORE_DIEPTSIZ11_MC_Pos (29UL)         /*!< Position of MC field.                                                */
  #define USBHSCORE_DIEPTSIZ11_MC_Msk (0x3UL << USBHSCORE_DIEPTSIZ11_MC_Pos) /*!< Bit mask of MC field.                        */
  #define USBHSCORE_DIEPTSIZ11_MC_Min (0x1UL)        /*!< Min enumerator value of MC field.                                    */
  #define USBHSCORE_DIEPTSIZ11_MC_Max (0x3UL)        /*!< Max enumerator value of MC field.                                    */
  #define USBHSCORE_DIEPTSIZ11_MC_PACKETONE (0x1UL)  /*!< 1 packet                                                             */
  #define USBHSCORE_DIEPTSIZ11_MC_PACKETTWO (0x2UL)  /*!< 2 packets                                                            */
  #define USBHSCORE_DIEPTSIZ11_MC_PACKETTHREE (0x3UL) /*!< 3 packets                                                           */


/* USBHSCORE_DIEPDMA11: Device IN Endpoint DMA Address Register */
  #define USBHSCORE_DIEPDMA11_ResetValue (0x00000000UL) /*!< Reset value of DIEPDMA11 register.                                */

/* DMAADDR @Bits 0..31 : Holds the start address of the external memory for storing or fetching endpoint */
  #define USBHSCORE_DIEPDMA11_DMAADDR_Pos (0UL)      /*!< Position of DMAADDR field.                                           */
  #define USBHSCORE_DIEPDMA11_DMAADDR_Msk (0xFFFFFFFFUL << USBHSCORE_DIEPDMA11_DMAADDR_Pos) /*!< Bit mask of DMAADDR field.    */


/* USBHSCORE_DTXFSTS11: Device IN Endpoint Transmit FIFO Status Register */
  #define USBHSCORE_DTXFSTS11_ResetValue (0x00000200UL) /*!< Reset value of DTXFSTS11 register.                                */

/* INEPTXFSPCAVAIL @Bits 0..15 : IN Endpoint TxFIFO Space Avail (INEPTxFSpcAvail) */
  #define USBHSCORE_DTXFSTS11_INEPTXFSPCAVAIL_Pos (0UL) /*!< Position of INEPTXFSPCAVAIL field.                                */
  #define USBHSCORE_DTXFSTS11_INEPTXFSPCAVAIL_Msk (0xFFFFUL << USBHSCORE_DTXFSTS11_INEPTXFSPCAVAIL_Pos) /*!< Bit mask of
                                                                            INEPTXFSPCAVAIL field.*/


/* USBHSCORE_DOEPCTL0: Device Control OUT Endpoint 0 Control Register */
  #define USBHSCORE_DOEPCTL0_ResetValue (0x00008000UL) /*!< Reset value of DOEPCTL0 register.                                  */

/* MPS @Bits 0..1 : Maximum Packet Size (MPS) */
  #define USBHSCORE_DOEPCTL0_MPS_Pos (0UL)           /*!< Position of MPS field.                                               */
  #define USBHSCORE_DOEPCTL0_MPS_Msk (0x3UL << USBHSCORE_DOEPCTL0_MPS_Pos) /*!< Bit mask of MPS field.                         */
  #define USBHSCORE_DOEPCTL0_MPS_Min (0x0UL)         /*!< Min enumerator value of MPS field.                                   */
  #define USBHSCORE_DOEPCTL0_MPS_Max (0x3UL)         /*!< Max enumerator value of MPS field.                                   */
  #define USBHSCORE_DOEPCTL0_MPS_BYTE64 (0x0UL)      /*!< 64 bytes                                                             */
  #define USBHSCORE_DOEPCTL0_MPS_BYTE32 (0x1UL)      /*!< 32 bytes                                                             */
  #define USBHSCORE_DOEPCTL0_MPS_BYTE16 (0x2UL)      /*!< 16 bytes                                                             */
  #define USBHSCORE_DOEPCTL0_MPS_BYTE8 (0x3UL)       /*!< 8 bytes                                                              */

/* USBACTEP @Bit 15 : USB Active Endpoint (USBActEP) */
  #define USBHSCORE_DOEPCTL0_USBACTEP_Pos (15UL)     /*!< Position of USBACTEP field.                                          */
  #define USBHSCORE_DOEPCTL0_USBACTEP_Msk (0x1UL << USBHSCORE_DOEPCTL0_USBACTEP_Pos) /*!< Bit mask of USBACTEP field.          */
  #define USBHSCORE_DOEPCTL0_USBACTEP_Min (0x1UL)    /*!< Min enumerator value of USBACTEP field.                              */
  #define USBHSCORE_DOEPCTL0_USBACTEP_Max (0x1UL)    /*!< Max enumerator value of USBACTEP field.                              */
  #define USBHSCORE_DOEPCTL0_USBACTEP_ACTIVE (0x1UL) /*!< USB Active Endpoint 0                                                */

/* NAKSTS @Bit 17 : NAK Status (NAKSts) */
  #define USBHSCORE_DOEPCTL0_NAKSTS_Pos (17UL)       /*!< Position of NAKSTS field.                                            */
  #define USBHSCORE_DOEPCTL0_NAKSTS_Msk (0x1UL << USBHSCORE_DOEPCTL0_NAKSTS_Pos) /*!< Bit mask of NAKSTS field.                */
  #define USBHSCORE_DOEPCTL0_NAKSTS_Min (0x0UL)      /*!< Min enumerator value of NAKSTS field.                                */
  #define USBHSCORE_DOEPCTL0_NAKSTS_Max (0x1UL)      /*!< Max enumerator value of NAKSTS field.                                */
  #define USBHSCORE_DOEPCTL0_NAKSTS_INACTIVE (0x0UL) /*!< The core is transmitting non-NAK handshakes based on the FIFO status */
  #define USBHSCORE_DOEPCTL0_NAKSTS_ACTIVE (0x1UL)   /*!< The core is transmitting NAK handshakes on this endpoint             */

/* EPTYPE @Bits 18..19 : Endpoint Type (EPType) */
  #define USBHSCORE_DOEPCTL0_EPTYPE_Pos (18UL)       /*!< Position of EPTYPE field.                                            */
  #define USBHSCORE_DOEPCTL0_EPTYPE_Msk (0x3UL << USBHSCORE_DOEPCTL0_EPTYPE_Pos) /*!< Bit mask of EPTYPE field.                */
  #define USBHSCORE_DOEPCTL0_EPTYPE_Min (0x0UL)      /*!< Min enumerator value of EPTYPE field.                                */
  #define USBHSCORE_DOEPCTL0_EPTYPE_Max (0x0UL)      /*!< Max enumerator value of EPTYPE field.                                */
  #define USBHSCORE_DOEPCTL0_EPTYPE_ACTIVE (0x0UL)   /*!< Endpoint Control 0                                                   */

