nrfconnect/sdk-hal_nordic/nrfx/mdk/nrf54l20_enga_types.h
/* MPS @Bits 0..10 : Maximum Packet Size (MPS) */
  #define USBHSCORE_DOEPCTL14_MPS_Pos (0UL)          /*!< Position of MPS field.                                               */
  #define USBHSCORE_DOEPCTL14_MPS_Msk (0x7FFUL << USBHSCORE_DOEPCTL14_MPS_Pos) /*!< Bit mask of MPS field.                     */

/* USBACTEP @Bit 15 : USB Active Endpoint (USBActEP) */
  #define USBHSCORE_DOEPCTL14_USBACTEP_Pos (15UL)    /*!< Position of USBACTEP field.                                          */
  #define USBHSCORE_DOEPCTL14_USBACTEP_Msk (0x1UL << USBHSCORE_DOEPCTL14_USBACTEP_Pos) /*!< Bit mask of USBACTEP field.        */
  #define USBHSCORE_DOEPCTL14_USBACTEP_Min (0x0UL)   /*!< Min enumerator value of USBACTEP field.                              */
  #define USBHSCORE_DOEPCTL14_USBACTEP_Max (0x1UL)   /*!< Max enumerator value of USBACTEP field.                              */
  #define USBHSCORE_DOEPCTL14_USBACTEP_DISABLED (0x0UL) /*!< Not Active                                                        */
  #define USBHSCORE_DOEPCTL14_USBACTEP_ENABLED (0x1UL) /*!< USB Active Endpoint                                                */

/* DPID @Bit 16 : Endpoint Data PID (DPID) */
  #define USBHSCORE_DOEPCTL14_DPID_Pos (16UL)        /*!< Position of DPID field.                                              */
  #define USBHSCORE_DOEPCTL14_DPID_Msk (0x1UL << USBHSCORE_DOEPCTL14_DPID_Pos) /*!< Bit mask of DPID field.                    */
  #define USBHSCORE_DOEPCTL14_DPID_Min (0x0UL)       /*!< Min enumerator value of DPID field.                                  */
  #define USBHSCORE_DOEPCTL14_DPID_Max (0x1UL)       /*!< Max enumerator value of DPID field.                                  */
  #define USBHSCORE_DOEPCTL14_DPID_INACTIVE (0x0UL)  /*!< Endpoint Data PID not active                                         */
  #define USBHSCORE_DOEPCTL14_DPID_ACTIVE (0x1UL)    /*!< Endpoint Data PID active                                             */

/* NAKSTS @Bit 17 : NAK Status (NAKSts) */
  #define USBHSCORE_DOEPCTL14_NAKSTS_Pos (17UL)      /*!< Position of NAKSTS field.                                            */
  #define USBHSCORE_DOEPCTL14_NAKSTS_Msk (0x1UL << USBHSCORE_DOEPCTL14_NAKSTS_Pos) /*!< Bit mask of NAKSTS field.              */
  #define USBHSCORE_DOEPCTL14_NAKSTS_Min (0x0UL)     /*!< Min enumerator value of NAKSTS field.                                */
  #define USBHSCORE_DOEPCTL14_NAKSTS_Max (0x1UL)     /*!< Max enumerator value of NAKSTS field.                                */
  #define USBHSCORE_DOEPCTL14_NAKSTS_NONNAK (0x0UL)  /*!< The core is transmitting non-NAK handshakes based on the FIFO status */
  #define USBHSCORE_DOEPCTL14_NAKSTS_NAK (0x1UL)     /*!< The core is transmitting NAK handshakes on this endpoint             */

/* EPTYPE @Bits 18..19 : Endpoint Type (EPType) */
  #define USBHSCORE_DOEPCTL14_EPTYPE_Pos (18UL)      /*!< Position of EPTYPE field.                                            */
  #define USBHSCORE_DOEPCTL14_EPTYPE_Msk (0x3UL << USBHSCORE_DOEPCTL14_EPTYPE_Pos) /*!< Bit mask of EPTYPE field.              */
  #define USBHSCORE_DOEPCTL14_EPTYPE_Min (0x0UL)     /*!< Min enumerator value of EPTYPE field.                                */
  #define USBHSCORE_DOEPCTL14_EPTYPE_Max (0x3UL)     /*!< Max enumerator value of EPTYPE field.                                */
  #define USBHSCORE_DOEPCTL14_EPTYPE_CONTROL (0x0UL) /*!< Control                                                              */
  #define USBHSCORE_DOEPCTL14_EPTYPE_ISOCHRONOUS (0x1UL) /*!< Isochronous                                                      */
  #define USBHSCORE_DOEPCTL14_EPTYPE_BULK (0x2UL)    /*!< Bulk                                                                 */
  #define USBHSCORE_DOEPCTL14_EPTYPE_INTERRUPT (0x3UL) /*!< Interrupt                                                          */

/* STALL @Bit 21 : STALL Handshake (Stall) */
  #define USBHSCORE_DOEPCTL14_STALL_Pos (21UL)       /*!< Position of STALL field.                                             */
  #define USBHSCORE_DOEPCTL14_STALL_Msk (0x1UL << USBHSCORE_DOEPCTL14_STALL_Pos) /*!< Bit mask of STALL field.                 */
  #define USBHSCORE_DOEPCTL14_STALL_Min (0x0UL)      /*!< Min enumerator value of STALL field.                                 */
  #define USBHSCORE_DOEPCTL14_STALL_Max (0x1UL)      /*!< Max enumerator value of STALL field.                                 */
  #define USBHSCORE_DOEPCTL14_STALL_INACTIVE (0x0UL) /*!< STALL All non-active tokens                                          */
  #define USBHSCORE_DOEPCTL14_STALL_ACTIVE (0x1UL)   /*!< STALL All Active Tokens                                              */

/* CNAK @Bit 26 : (unspecified) */
  #define USBHSCORE_DOEPCTL14_CNAK_Pos (26UL)        /*!< Position of CNAK field.                                              */
  #define USBHSCORE_DOEPCTL14_CNAK_Msk (0x1UL << USBHSCORE_DOEPCTL14_CNAK_Pos) /*!< Bit mask of CNAK field.                    */
  #define USBHSCORE_DOEPCTL14_CNAK_Min (0x0UL)       /*!< Min enumerator value of CNAK field.                                  */
  #define USBHSCORE_DOEPCTL14_CNAK_Max (0x1UL)       /*!< Max enumerator value of CNAK field.                                  */
  #define USBHSCORE_DOEPCTL14_CNAK_INACTIVE (0x0UL)  /*!< No Clear NAK                                                         */
  #define USBHSCORE_DOEPCTL14_CNAK_ACTIVE (0x1UL)    /*!< Clear NAK                                                            */

/* SNAK @Bit 27 : Set NAK (SNAK) */
  #define USBHSCORE_DOEPCTL14_SNAK_Pos (27UL)        /*!< Position of SNAK field.                                              */
  #define USBHSCORE_DOEPCTL14_SNAK_Msk (0x1UL << USBHSCORE_DOEPCTL14_SNAK_Pos) /*!< Bit mask of SNAK field.                    */
  #define USBHSCORE_DOEPCTL14_SNAK_Min (0x0UL)       /*!< Min enumerator value of SNAK field.                                  */
  #define USBHSCORE_DOEPCTL14_SNAK_Max (0x1UL)       /*!< Max enumerator value of SNAK field.                                  */
  #define USBHSCORE_DOEPCTL14_SNAK_INACTIVE (0x0UL)  /*!< No Set NAK                                                           */
  #define USBHSCORE_DOEPCTL14_SNAK_ACTIVE (0x1UL)    /*!< Set NAK                                                              */

