nrfconnect/sdk-hal_nordic/nrfx/mdk/nrf54l20_enga_types.h
/* STEP @Bit 2 : Step */
  #define VPRCSR_DCSR_STEP_Pos (2UL)                 /*!< Position of STEP field.                                              */
  #define VPRCSR_DCSR_STEP_Msk (0x1UL << VPRCSR_DCSR_STEP_Pos) /*!< Bit mask of STEP field.                                    */

/* CAUSE @Bits 6..8 : Debug Mode enter cause */
  #define VPRCSR_DCSR_CAUSE_Pos (6UL)                /*!< Position of CAUSE field.                                             */
  #define VPRCSR_DCSR_CAUSE_Msk (0x7UL << VPRCSR_DCSR_CAUSE_Pos) /*!< Bit mask of CAUSE field.                                 */
  #define VPRCSR_DCSR_CAUSE_Min (0x1UL)              /*!< Min enumerator value of CAUSE field.                                 */
  #define VPRCSR_DCSR_CAUSE_Max (0x5UL)              /*!< Max enumerator value of CAUSE field.                                 */
  #define VPRCSR_DCSR_CAUSE_EBREAK (0x1UL)           /*!< An ebreak instruction was executed. (priority 3)                     */
  #define VPRCSR_DCSR_CAUSE_TRIGGER (0x2UL)          /*!< The Trigger Module caused a breakpoint exception. (priority 4,
                                                          highest)*/
  #define VPRCSR_DCSR_CAUSE_HALTREQ (0x3UL)          /*!< The debugger requested entry to Debug Mode using haltreq. (priority
                                                          1)*/
  #define VPRCSR_DCSR_CAUSE_STEP (0x4UL)             /*!< The hart single stepped because step was set. (priority 0, lowest)   */
  #define VPRCSR_DCSR_CAUSE_RESETHALTREQ (0x5UL)     /*!< The hart halted directly out of reset due to resethaltreq. It is also
                                                          acceptable to report 3 when this happens. (priority 2)*/

/* STEPIE @Bit 11 : Step Interrupt Enable */
  #define VPRCSR_DCSR_STEPIE_Pos (11UL)              /*!< Position of STEPIE field.                                            */
  #define VPRCSR_DCSR_STEPIE_Msk (0x1UL << VPRCSR_DCSR_STEPIE_Pos) /*!< Bit mask of STEPIE field.                              */
  #define VPRCSR_DCSR_STEPIE_Min (0x0UL)             /*!< Min enumerator value of STEPIE field.                                */
  #define VPRCSR_DCSR_STEPIE_Max (0x1UL)             /*!< Max enumerator value of STEPIE field.                                */
  #define VPRCSR_DCSR_STEPIE_Disabled (0x0UL)        /*!< Interrupts are disabled during single stepping                       */
  #define VPRCSR_DCSR_STEPIE_Enabled (0x1UL)         /*!< Interrupts are enabled during single stepping. Implementations may
                                                          hard wire this bit to 0. In that case interrupt behavior can be
                                                          emulated by the debugger.*/

/* EBREAKM @Bit 15 : M-mode ebreak */
  #define VPRCSR_DCSR_EBREAKM_Pos (15UL)             /*!< Position of EBREAKM field.                                           */
  #define VPRCSR_DCSR_EBREAKM_Msk (0x1UL << VPRCSR_DCSR_EBREAKM_Pos) /*!< Bit mask of EBREAKM field.                           */
  #define VPRCSR_DCSR_EBREAKM_Min (0x0UL)            /*!< Min enumerator value of EBREAKM field.                               */
  #define VPRCSR_DCSR_EBREAKM_Max (0x1UL)            /*!< Max enumerator value of EBREAKM field.                               */
  #define VPRCSR_DCSR_EBREAKM_SPEC (0x0UL)           /*!< ebreak instructions in M-mode behave as described in the Privileged
                                                          Spe*/
  #define VPRCSR_DCSR_EBREAKM_ENTERDBG (0x1UL)       /*!< ebreak instructions in M-mode enter Debug Mode                       */

/* XDEBUGVER @Bits 28..31 : External Debug version */
  #define VPRCSR_DCSR_XDEBUGVER_Pos (28UL)           /*!< Position of XDEBUGVER field.                                         */
  #define VPRCSR_DCSR_XDEBUGVER_Msk (0xFUL << VPRCSR_DCSR_XDEBUGVER_Pos) /*!< Bit mask of XDEBUGVER field.                     */
  #define VPRCSR_DCSR_XDEBUGVER_Min (0x4UL)          /*!< Min enumerator value of XDEBUGVER field.                             */
  #define VPRCSR_DCSR_XDEBUGVER_Max (0x4UL)          /*!< Max enumerator value of XDEBUGVER field.                             */
  #define VPRCSR_DCSR_XDEBUGVER_STDDBG (0x4UL)       /*!< External debug support exists as it is described in this document    */


/**
  * @brief DPC [VPRCSR_DPC] Debug PC
  */
  #define VPRCSR_DPC (0x000007B1ul)
  #define VPRCSR_DPC_ResetValue (0x00000000UL)       /*!< Reset value of DPC register.                                         */

/* VAL @Bits 0..31 : Debug PC value */
  #define VPRCSR_DPC_VAL_Pos (0UL)                   /*!< Position of VAL field.                                               */
  #define VPRCSR_DPC_VAL_Msk (0xFFFFFFFFUL << VPRCSR_DPC_VAL_Pos) /*!< Bit mask of VAL field.                                  */


/**
  * @brief MCYCLE [VPRCSR_MCYCLE] Machine Cycle Counter
  */
  #define VPRCSR_MCYCLE (0x00000B00ul)
  #define VPRCSR_MCYCLE_ResetValue (0x00000000UL)    /*!< Reset value of MCYCLE register.                                      */

/* VAL @Bits 0..31 : Machine Cycle Counter value */
  #define VPRCSR_MCYCLE_VAL_Pos (0UL)                /*!< Position of VAL field.                                               */
  #define VPRCSR_MCYCLE_VAL_Msk (0xFFFFFFFFUL << VPRCSR_MCYCLE_VAL_Pos) /*!< Bit mask of VAL field.                            */


/**
  * @brief MINSTRET [VPRCSR_MINSTRET] Machine Instruction Counter
  */
  #define VPRCSR_MINSTRET (0x00000B02ul)
  #define VPRCSR_MINSTRET_ResetValue (0x00000000UL)  /*!< Reset value of MINSTRET register.                                    */

/* VAL @Bits 0..31 : Machine Instruction Counter value */
  #define VPRCSR_MINSTRET_VAL_Pos (0UL)              /*!< Position of VAL field.                                               */
  #define VPRCSR_MINSTRET_VAL_Msk (0xFFFFFFFFUL << VPRCSR_MINSTRET_VAL_Pos) /*!< Bit mask of VAL field.                        */


/**
  * @brief MCYCLEH [VPRCSR_MCYCLEH] Machine Cycle Counter (Upper part)
  */
  #define VPRCSR_MCYCLEH (0x00000B80ul)
  #define VPRCSR_MCYCLEH_ResetValue (0x00000000UL)   /*!< Reset value of MCYCLEH register.                                     */

/* VAL @Bits 0..31 : Machine Cycle Counter value */
  #define VPRCSR_MCYCLEH_VAL_Pos (0UL)               /*!< Position of VAL field.                                               */
  #define VPRCSR_MCYCLEH_VAL_Msk (0xFFFFFFFFUL << VPRCSR_MCYCLEH_VAL_Pos) /*!< Bit mask of VAL field.                          */


/**
  * @brief MINSTRETH [VPRCSR_MINSTRETH] Machine Instruction Counter (Upper part)
  */
  #define VPRCSR_MINSTRETH (0x00000B82ul)
  #define VPRCSR_MINSTRETH_ResetValue (0x00000000UL) /*!< Reset value of MINSTRETH register.                                   */

