nrfconnect/sdk-hal_nordic/nrfx/mdk/nrf54l20_enga_types.h
/* CNT0RELOAD @Bits 0..15 : Reload value for CNT0 */
  #define VPRCSR_NORDIC_CNTTOP_CNT0RELOAD_Pos (0UL)  /*!< Position of CNT0RELOAD field.                                        */
  #define VPRCSR_NORDIC_CNTTOP_CNT0RELOAD_Msk (0xFFFFUL << VPRCSR_NORDIC_CNTTOP_CNT0RELOAD_Pos) /*!< Bit mask of CNT0RELOAD
                                                                            field.*/

/* CNT1RELOAD @Bits 16..31 : Reload value for CNT1 */
  #define VPRCSR_NORDIC_CNTTOP_CNT1RELOAD_Pos (16UL) /*!< Position of CNT1RELOAD field.                                        */
  #define VPRCSR_NORDIC_CNTTOP_CNT1RELOAD_Msk (0xFFFFUL << VPRCSR_NORDIC_CNTTOP_CNT1RELOAD_Pos) /*!< Bit mask of CNT1RELOAD
                                                                            field.*/


/**
  * @brief CNTADD [VPRCSR_NORDIC_CNTADD] CNT Add
  */
  #define VPRCSR_NORDIC_CNTADD (0x000007D4ul)
  #define VPRCSR_NORDIC_CNTADD_ResetValue (0x00000000UL) /*!< Reset value of CNTADD register.                                  */

/* VAL @Bits 0..31 : Value added to CNT */
  #define VPRCSR_NORDIC_CNTADD_VAL_Pos (0UL)         /*!< Position of VAL field.                                               */
  #define VPRCSR_NORDIC_CNTADD_VAL_Msk (0xFFFFFFFFUL << VPRCSR_NORDIC_CNTADD_VAL_Pos) /*!< Bit mask of VAL field.              */


/**
  * @brief CNT0 [VPRCSR_NORDIC_CNT0] 16 bit Counter 0
  */
  #define VPRCSR_NORDIC_CNT0 (0x000007D5ul)
  #define VPRCSR_NORDIC_CNT0_ResetValue (0x00000000UL) /*!< Reset value of CNT0 register.                                      */

/* VAL @Bits 0..15 : CNT0 value */
  #define VPRCSR_NORDIC_CNT0_VAL_Pos (0UL)           /*!< Position of VAL field.                                               */
  #define VPRCSR_NORDIC_CNT0_VAL_Msk (0xFFFFUL << VPRCSR_NORDIC_CNT0_VAL_Pos) /*!< Bit mask of VAL field.                      */


/**
  * @brief CNTADD0 [VPRCSR_NORDIC_CNTADD0] CNT0 Add
  */
  #define VPRCSR_NORDIC_CNTADD0 (0x000007D6ul)
  #define VPRCSR_NORDIC_CNTADD0_ResetValue (0x00000000UL) /*!< Reset value of CNTADD0 register.                                */

/* VAL @Bits 0..31 : Value added to CNT0 */
  #define VPRCSR_NORDIC_CNTADD0_VAL_Pos (0UL)        /*!< Position of VAL field.                                               */
  #define VPRCSR_NORDIC_CNTADD0_VAL_Msk (0xFFFFFFFFUL << VPRCSR_NORDIC_CNTADD0_VAL_Pos) /*!< Bit mask of VAL field.            */


/**
  * @brief CNT1 [VPRCSR_NORDIC_CNT1] 16-bit Counter 1
  */
  #define VPRCSR_NORDIC_CNT1 (0x000007D7ul)
  #define VPRCSR_NORDIC_CNT1_ResetValue (0x00000000UL) /*!< Reset value of CNT1 register.                                      */

/* VAL @Bits 0..15 : CNT1 value */
  #define VPRCSR_NORDIC_CNT1_VAL_Pos (0UL)           /*!< Position of VAL field.                                               */
  #define VPRCSR_NORDIC_CNT1_VAL_Msk (0xFFFFUL << VPRCSR_NORDIC_CNT1_VAL_Pos) /*!< Bit mask of VAL field.                      */


/**
  * @brief CNTADD1 [VPRCSR_NORDIC_CNTADD1] CNT1 Add
  */
  #define VPRCSR_NORDIC_CNTADD1 (0x000007D8ul)
  #define VPRCSR_NORDIC_CNTADD1_ResetValue (0x00000000UL) /*!< Reset value of CNTADD1 register.                                */

/* VAL @Bits 0..31 : Value added to CNT1 */
  #define VPRCSR_NORDIC_CNTADD1_VAL_Pos (0UL)        /*!< Position of VAL field.                                               */
  #define VPRCSR_NORDIC_CNTADD1_VAL_Msk (0xFFFFFFFFUL << VPRCSR_NORDIC_CNTADD1_VAL_Pos) /*!< Bit mask of VAL field.            */


/**
  * @brief WAIT0 [VPRCSR_NORDIC_WAIT0] Wait 0
  */
  #define VPRCSR_NORDIC_WAIT0 (0x000007DAul)
  #define VPRCSR_NORDIC_WAIT0_ResetValue (0x00000000UL) /*!< Reset value of WAIT0 register.                                    */

/* DATA @Bits 0..15 : Value to write to CNT0 */
  #define VPRCSR_NORDIC_WAIT0_DATA_Pos (0UL)         /*!< Position of DATA field.                                              */
  #define VPRCSR_NORDIC_WAIT0_DATA_Msk (0xFFFFUL << VPRCSR_NORDIC_WAIT0_DATA_Pos) /*!< Bit mask of DATA field.                 */

/* WRITEDATA @Bit 16 : (unspecified) */
  #define VPRCSR_NORDIC_WAIT0_WRITEDATA_Pos (16UL)   /*!< Position of WRITEDATA field.                                         */
  #define VPRCSR_NORDIC_WAIT0_WRITEDATA_Msk (0x1UL << VPRCSR_NORDIC_WAIT0_WRITEDATA_Pos) /*!< Bit mask of WRITEDATA field.     */
  #define VPRCSR_NORDIC_WAIT0_WRITEDATA_Min (0x0UL)  /*!< Min enumerator value of WRITEDATA field.                             */
  #define VPRCSR_NORDIC_WAIT0_WRITEDATA_Max (0x1UL)  /*!< Max enumerator value of WRITEDATA field.                             */
  #define VPRCSR_NORDIC_WAIT0_WRITEDATA_WAIT (0x0UL) /*!< Wait until CNT0 reaches 0                                            */
  #define VPRCSR_NORDIC_WAIT0_WRITEDATA_WRITE (0x1UL) /*!< Write DATA to CNT0 and then wait until CNT0 reaches 0               */


/**
  * @brief WAIT1 [VPRCSR_NORDIC_WAIT1] Wait 1
  */
  #define VPRCSR_NORDIC_WAIT1 (0x000007DBul)
  #define VPRCSR_NORDIC_WAIT1_ResetValue (0x00000000UL) /*!< Reset value of WAIT1 register.                                    */

/* DATA @Bits 0..15 : Value to write to CNT1 */
  #define VPRCSR_NORDIC_WAIT1_DATA_Pos (0UL)         /*!< Position of DATA field.                                              */
  #define VPRCSR_NORDIC_WAIT1_DATA_Msk (0xFFFFUL << VPRCSR_NORDIC_WAIT1_DATA_Pos) /*!< Bit mask of DATA field.                 */

/* WRITEDATA @Bit 16 : (unspecified) */
  #define VPRCSR_NORDIC_WAIT1_WRITEDATA_Pos (16UL)   /*!< Position of WRITEDATA field.                                         */
  #define VPRCSR_NORDIC_WAIT1_WRITEDATA_Msk (0x1UL << VPRCSR_NORDIC_WAIT1_WRITEDATA_Pos) /*!< Bit mask of WRITEDATA field.     */
  #define VPRCSR_NORDIC_WAIT1_WRITEDATA_Min (0x0UL)  /*!< Min enumerator value of WRITEDATA field.                             */
  #define VPRCSR_NORDIC_WAIT1_WRITEDATA_Max (0x1UL)  /*!< Max enumerator value of WRITEDATA field.                             */
  #define VPRCSR_NORDIC_WAIT1_WRITEDATA_WAIT (0x0UL) /*!< Wait until CNT1 reaches 0                                            */
  #define VPRCSR_NORDIC_WAIT1_WRITEDATA_WRITE (0x1UL) /*!< Write DATA to CNT1 and then wait until CNT1 reaches 0               */


/**
  * @brief WAIT [VPRCSR_NORDIC_WAIT] Wait
  */
  #define VPRCSR_NORDIC_WAIT (0x000007DCul)
  #define VPRCSR_NORDIC_WAIT_ResetValue (0x00000000UL) /*!< Reset value of WAIT register.                                      */

/* VAL @Bits 0..31 : (unspecified) */
  #define VPRCSR_NORDIC_WAIT_VAL_Pos (0UL)           /*!< Position of VAL field.                                               */
  #define VPRCSR_NORDIC_WAIT_VAL_Msk (0xFFFFFFFFUL << VPRCSR_NORDIC_WAIT_VAL_Pos) /*!< Bit mask of VAL field.                  */


/**
  * @brief TASKS [VPRCSR_NORDIC_TASKS] DPPI Tasks
  */
  #define VPRCSR_NORDIC_TASKS (0x000007E0ul)
  #define VPRCSR_NORDIC_TASKS_ResetValue (0x00000000UL) /*!< Reset value of TASKS register.                                    */

/* TASKS0 @Bit 0 : (unspecified) */
  #define VPRCSR_NORDIC_TASKS_TASKS0_Pos (0UL)       /*!< Position of TASKS0 field.                                            */
  #define VPRCSR_NORDIC_TASKS_TASKS0_Msk (0x1UL << VPRCSR_NORDIC_TASKS_TASKS0_Pos) /*!< Bit mask of TASKS0 field.              */
  #define VPRCSR_NORDIC_TASKS_TASKS0_Min (0x0UL)     /*!< Min enumerator value of TASKS0 field.                                */
  #define VPRCSR_NORDIC_TASKS_TASKS0_Max (0x1UL)     /*!< Max enumerator value of TASKS0 field.                                */
  #define VPRCSR_NORDIC_TASKS_TASKS0_Disabled (0x0UL) /*!< TASKS[0] diabled                                                    */
  #define VPRCSR_NORDIC_TASKS_TASKS0_Enabled (0x1UL) /*!< TASKS[0] enabled                                                     */

/* TASKS1 @Bit 1 : (unspecified) */
  #define VPRCSR_NORDIC_TASKS_TASKS1_Pos (1UL)       /*!< Position of TASKS1 field.                                            */
  #define VPRCSR_NORDIC_TASKS_TASKS1_Msk (0x1UL << VPRCSR_NORDIC_TASKS_TASKS1_Pos) /*!< Bit mask of TASKS1 field.              */
  #define VPRCSR_NORDIC_TASKS_TASKS1_Min (0x0UL)     /*!< Min enumerator value of TASKS1 field.                                */
  #define VPRCSR_NORDIC_TASKS_TASKS1_Max (0x1UL)     /*!< Max enumerator value of TASKS1 field.                                */
  #define VPRCSR_NORDIC_TASKS_TASKS1_Disabled (0x0UL) /*!< TASKS[1] diabled                                                    */
  #define VPRCSR_NORDIC_TASKS_TASKS1_Enabled (0x1UL) /*!< TASKS[1] enabled                                                     */

